[
    {
        "name": "Tübix Orga Team",
        "titel": "Tübix init",
        "abstract": "* Begrüßung\n* Infos zum Ablauf des Tages\n* Veränderungen zu letztem Jahr\n* Änderungen in letzter Minute\n* Fragen?",
        "description": "",
        "aboutme": "Orga Team",
        "vorwissen": "",
        "urlid": "tuebix-init",
        "duration": 20,
        "room": "V1 (F119)",
        "timebegin": "09:30",
        "timeend": "09:50",
        "weblinks": {}
    },
    {
        "name": "Prof. Klaus Knopper",
        "titel": "Generative, analytische KI und RAGs in Unterricht und Prüfungen",
        "abstract": "Generative KI kann enorm hilfreich sein, – entsprechendes Fachwissen und kritische Überprüfung der generierten Inhalte vorausgesetzt – um schnell und effizient Zusammenfassungen, Erklärungen und auch Beispiele für den Unterricht in fast allen Disziplinen zu erhalten, aber auch eine Hilfe in Prüfungsaufgaben, die die Schüler*innen als Werkzeug unterstützt, grammatikalisch korrekte und verständliche Formulierungen zu finden, mathematische und Programmier-Aufgaben zu lösen.\n\nAuch ist es mit Hilfe von sog. RAGs (Retrieval Augmented Generation) möglich, Unterrichtsmaterial und Regulierungstexte wie Prüfungsordnungen mit korrekten Quellenangaben als \"Wissensbasis\" für Chatbots zu verwenden, um KI-Assistentenzen im Studium anzubieten.\n\nAuch für automatische Transkripte und Übersetzungen in Videokonferenzen (z.B. in BigBlueButton) sind einfache Open Source KI-Systeme nützlich, um den gesprochenen Text direkt umzuwandeln, und steigern die Barrierefreiheit.\n\nAllerdings: Je mehr man sich auf die reine KI verlässt, je weniger eigene Kompetenzen und fachliche Kenntnisse beim Prompt-Engineering eingesetzt werden, desto fragwürdiger werden die Resultate. Schließlich ist es auch für die Prüfenden eine zunehmende Herausforderung, wie die Eigenleistung der Prüflinge beim erlaubten Einsatz von generativen KIs noch realistisch bewertet werden kann.\n\nDer Vortrag ist ein Followup zu den Linux-Tagen 2025 in Chemnitz vom März 2025.",
        "description": "",
        "aboutme": "Software-Entwickler, Professor für Software-Engineering und Vizepräsident Digitalisierung an der Hochschule Kaiserslautern/RLP",
        "vorwissen": "Der Vortrag richtet sich vorwiegend an Lehrende und Schüler*innen. Für das Verständnis des einfachen API-Beispiels sind Einsteiger-Python-Kenntnisse nützlich, aber nicht zwingend erforderlich.",
        "urlid": "137-generative-analytische-ki-und-rags-in-unterricht-und-prufungen",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "10:00",
        "timeend": "10:50",
        "weblinks": {}
    },
    {
        "name": "Ingo Blechschmidt",
        "titel": "P̶r̶o̶g̶r̶a̶m̶m̶c̶o̶d̶e̶ ̶t̶e̶s̶t̶e̶n̶?̶ Korrektheit beweisen!",
        "abstract": "Eine Schnupperstunde in Agda, der funktionalen Programmiersprache, mit der man die Korrektheit von Programmcode mathematisch wasserdicht beweisen kann, anstatt auf Tests oder Code-Reviews angewiesen zu sein.",
        "description": "**Erwartungsmanagement:** Aktuell ist es noch so, dass es sich nur in wenigen Praxisfällen lohnt, den substanziellen Beweisaufwand einzugehen -- auch wenn (nahezu) absolute Korrektheitsgarantie winkt. Diese Whirlwind-Tour dient daher vor allem zur Erweiterung des Horizonts. (Und jede Menge Spaß macht sie auch.)\n\n**Hinweis:** Um 15:00 Uhr gibt es noch einen [weiteren Vortrag zum gleichen Thema](https://www.tuebix.org/2025/programm/146-wenn-s-drauf-ankommt-code-korrekt-beweisen/). Die beiden Vorträge ergänzen sich -- in Mikes Vortrag geht es um Isabelle, hier geht es um Agda. Beides sind Beweisassistenzsysteme, allerdings mit ziemlich verschiedenen Designprinzipien, Vorteilen und Nachteilen. Beide Vorträge eignen sich zum Reinschnuppern.",
        "aboutme": "Mathematiker aus Augsburg",
        "vorwissen": "Vertrautheit mit mindestens einer Programmiersprache",
        "urlid": "159-p-r-o-g-r-a-m-m-c-o-d-e-t-e-s-t-e-n-korrektheit-beweisen",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "11:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Florian Snow",
        "titel": "REUSE - Einfache Lizenzierung für Menschen und Maschinen",
        "abstract": "Freie Software lebt von Wiederverwendung, doch ohne klare Lizenzinformationen, kann das zu rechtlichen Problemen führen. Genau hier setzt REUSE an: Es bietet einen einfachen Standard zur Lizenzierung, der sowohl für Menschen verständlich als auch maschinenlesbar ist. Mit wenigen einfachen Schritten setzt man REUSE ein und bekommt bestätigt, dass die Lizenzinformationen korrekt und vollständig sind. Der Vortrag zeigt, wie der Ansatz funktioniert, warum er den Alltag erleichtert und wie REUSE per CI/CD dafür sorgen kann, dass die Lizenzierung immer klar ist.",
        "description": "",
        "aboutme": "Florian Snow ist ein Softwareentwickler aus Nürnberg, mit einem Hintergrund in einer Vielzahl verschiedener Bereiche wie Lehre, Programmierung, Linguistik und Design. Seit etwa 1999 interessiert er sich für Freie Software und ist seit etwa 2006 in der Community aktiv. Neben seiner Arbeit als Softwareentwickler arbeitet er und engagiert sich ehrenamtlich für die Free Software Foundation Europe, wo er über die Jahre in vielen verschiedenen Bereichen aktiv war.",
        "vorwissen": "",
        "urlid": "134-reuse-einfache-lizenzierung-fur-menschen-und-maschinen",
        "duration": 20,
        "room": "V1 (F119)",
        "timebegin": "12:00",
        "timeend": "12:20",
        "weblinks": {}
    },
    {
        "name": "Michael Jerger",
        "titel": "Community in der eigenen Hand - föderiertes forgejo",
        "abstract": "Die Großen werden immer lieb und nett bleiben. Wer das nach den vielen Erfahrungen mit gelöschten XING-Gruppen, werbeverseuchtem SourceForge, copilotisiertem GitHub oder toxicTwitter nicht mehr so recht glauben will, der wartet sicher ungeduldig auf eine föderierte Git Platftorm. Das haben wir auch lange und jetzt aber beschlossen, nicht länger zu warten sondern zu handeln.\n\nWir implementieren Föderation mit Forgejo. Nach dem ersten Benutzer-Feature Star im letzten Jahr hat sich unter der Haube schon einiges weiterbewegt: Die Community wächst mit weiteren Contributors, Sicherheit mit Signaturen, Inbox-Support, Actor-Refresh und das nächste Benutzer Feature \"user-activity-follow\" ist in Sicht.\n\nDen Einblick in den Maschinenraum, Überlegungen zur Sicherheit, Herausforderungen und unsere Roadmap  stellen wir euch vor.",
        "description": "",
        "aboutme": "Wer wir sind: meissa GmbH\nAus: Reutlingen - http://meissa.de\nDev: Python, Java, Kotlin, Clojure, Go\nOps: K8s & OpenShift, Cloud, OpenTofu, CI/CD\nService&Support: Forgejo\n\nHier unser Blog: https://domaindrivenarchitecture.org",
        "vorwissen": "",
        "urlid": "121-community-in-der-eigenen-hand-foderiertes-forgejo",
        "duration": 20,
        "room": "V1 (F119)",
        "timebegin": "12:30",
        "timeend": "12:50",
        "weblinks": {}
    },
    {
        "name": "Ingo Blechschmidt",
        "titel": "Wie vollbringen ChatGPT & Co das Kunststück des Lernens?",
        "abstract": "Herkömmliche Computeralgorithmen sind dem menschlichen Intellekt in vielerlei Hinsicht überlegen: zum Beispiel beim Multiplizieren großer Zahlen oder bei der Analyse einer großen Anzahl von Zügen bei Schach. Doch es gibt auch viele Aufgaben, die uns für selbstverständlich sind, die Fähigkeiten von Algorithmen jedoch bei weitem übersteigen: Starre Algorithmen können weder menschliche Handschriften entziffern noch wie ChatGPT auf zahlreiche Fragen selbstsichere Antworten geben.\n\nDie jüngsten Durchbrüche in der künstlichen Intelligenz umgehen diese Probleme mit einem ganz anderen Ansatz: Sie nutzen künstliche neuronale Netze, die durch die (teils verstandene) Funktionsweise des menschlichen Gehirns inspiriert sind.\n\nDas Besondere an künstlichen neuronalen Netzen ist, dass sie nicht starr, sondern lernfähig sind. Menschliche Programmierer geben ihre grobe Struktur vor und liefern Trainingsdaten, schreiben aber keine einzige Codezeile, die ihr Verhalten steuert.\n\nIm Sinne eines guten Unix-Kommandozeilentools möchte dieser Vortrag eine Sache erklären und die aber gut erklären: Wie gelingt künstlichen neuronalen Netzen das Lernen?\n\nWir erfahren, dass die Antwort auf einen mathematischen Durchbruch Ende des 17. Jahrhunderts basiert und diskutieren, warum Deep Learning erst in den letzten Jahren einen steilen Aufschwung erlebte, obwohl die Grundlagen künstlicher neuronaler Netze seit den 1980er Jahren verstanden sind. Wir werden auch einige der größten Probleme neuronaler Netze ansprechen, die sich direkt aus der Art und Weise ergeben, wie neuronale Netze lernen.\n\nDer Vortrag erfordert keine fortgeschrittenen mathematischen Kenntnisse. Wer Michael Nielsens Buch bereits kennt, muss nichts Neues erwarten und sollte diesen Vortrag nur dann besuchen, wenn man Ergänzungen und Kommentare beisteuern möchte.",
        "description": "",
        "aboutme": "Mathematiker aus Augsburg",
        "vorwissen": "",
        "urlid": "138-wie-vollbringen-chatgpt-co-das-kunststuck-des-lernens",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "13:00",
        "timeend": "13:50",
        "weblinks": {}
    },
    {
        "name": "Sebastian Preisner",
        "titel": "Ansible Hacks: Effizienzsteigerung durch smarte Tricks und Kniffe für DevOps-Profis",
        "abstract": "Der Vortrag zeigt fortgeschrittene Methoden für den effektiven Einsatz von Ansible in komplexen Umgebungen. Im Mittelpunkt stehen der Umgang mit großen Inventories, die Nutzung von Jinja-Expressions und flexible Rollenkonzepte. Ergänzt wird das Ganze durch praktische Tipps, die den Alltag mit Ansible erleichtern.",
        "description": "Wachsende Inventories und komplexe Rollenstrukturen stellen in Ansible-Projekten häufig eine Herausforderung dar und erschweren nicht selten das Onboarding neuer Teammitglieder. Der Vortrag beleuchtet erprobte Strategien und Lösungsansätze aus der Praxis, um diesen Herausforderungen effektiv zu begegnen. Im Mittelpunkt stehen dabei sowohl bewährte Entwicklungsprinzipien für besser lesbaren und wartbaren Code als auch kreative Methoden für den Umgang mit umfangreichen Inventories und flexible Rollenkonzepte. Ergänzt wird dies durch praxisnahe Beispiele und unkonventionelle Tipps, die den Alltag mit Ansible erleichtern. Grundkenntnisse in Ansible werden vorausgesetzt da sich der Vortrag an fortgeschrittene Ansible-Anwender richtet.",
        "aboutme": "Technik, Automatisierung und Open Source sind nicht nur Beruf, sondern auch Leidenschaft. Ob Hausautomation, 3D-Druck oder der tägliche Einsatz von Tools wie Ansible und Docker – das Ausprobieren neuer Technologien gehört genauso zum Alltag wie das Entwickeln kreativer Lösungen. Besonders die Automatisierung begeistert, weil sie ermöglicht, lästige Routineaufgaben effizient auszulagern und so mehr Raum für die wirklich spannenden Herausforderungen zu schaffen. Mit dieser Begeisterung und fundierter Praxiserfahrung werden seit Jahren komplexe IT-Umgebungen gestaltet und optimiert.",
        "vorwissen": "Grundkenntnisse sind vorausgesetzt, der Vortrag richtet sich an fortgeschrittene Anwender.",
        "urlid": "129-ansible-hacks-effizienzsteigerung-durch-smarte-tricks-und-kniffe-fur-devops-profis",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "14:00",
        "timeend": "14:50",
        "weblinks": {}
    },
    {
        "name": "Mike Sperber",
        "titel": "Wenn's drauf ankommt: Code korrekt beweisen",
        "abstract": "Manche Software hat besondere Anforderungen - nicht nur an das Design sondern auch die Korrektheit der Realisierung.  Leider sind Entwicklungsprozesse oft fehleranfällig, und bekanntermaßen können alle Tests der Welt nur die Anwesenheit von Fehlern zeigen, nicht aber deren Abwesenheit.\n\nGlücklicherweise sind in den letzten Jahren die sogenannten formalen Methoden und ihre Werkzeuge immer zugänglicher geworden.  Diese Methoden werden inzwischen auch in größeren Projekten angewandt und liefern mathematische Beweise, dass die Software kritische, explizit formulierte Anforderungen auch garantiert erfüllt.  Dafür werden die kritischen Eigenschaften in den Code aufgenommen und verifiziert.\n\nIm Vortrag geht es speziell darum, Code mit Hilfe mathematisch korrekt zu beweisen.  Im Studium macht man das gelegentlich an Spielzeugbeispielen und lernt es dort als mühsame Plackerei kennen: Mit Hilfe moderner Open-Source-Werkzeuge - sogenannter Beweisassistenten - geht es nicht nur leichter von der Hand, sondern macht auch richtig Laune.",
        "description": "Der Vortrag zeigt, wo der Einsatz solcher Werkzeuge sinnvoll ist und wie ihr Einsatz in der Praxis abläuft.",
        "aboutme": "Dr. Michael Sperber ist Geschäftsführer der Active Group GmbH, die Individualsoftware mit funktionaler Programmierung entwickelt. Er ist international anerkannter Experte für funktionale Programmierung und wendet sie seit über 20 Jahren in Forschung, Lehre und industrieller Entwicklung an. Außerdem hat er zahlreiche Fachartikel und Bücher zum Thema verfasst, sowie das Curriculum für das iSAQB-Advanced-Modul \"Formale Methoden\" (zusammen mit Lars Hupel). Michael Sperber ist Mitbegründer des Blogs funktionale-programmierung.de und Mitorganisator der Entwicklerkonferenz BOB.",
        "vorwissen": "grundlegende Programmierkenntnisse",
        "urlid": "146-wenn-s-drauf-ankommt-code-korrekt-beweisen",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "15:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Prof. Klaus Knopper",
        "titel": "Verteidigung gegen Ransomware-Cyberangriffe mit Linux und Open Source",
        "abstract": "Durch die Komplexität umfangreicher IT-Systeme sowohl in Unternehmen und Behörden, als auch im privaten Bereich, ist es fast nur eine Frage der Zeit und Beharrlichkeit von Kriminellen, bis ein Cyber-Angriff durchschlägt, Daten kompromittiert und oft auch unternehmenskritische Daten im Darknet veröffentlicht werden und durch die abschließende Zerstörung immense Schäden für die digitale Aktionsfähigkeit und das Ansehen der Betreiber anrichtet.\n\nIm Vortrag werden die Hintergründe von Ransomware-Angriffen beleuchtet, konkrete Schutzmaßnahmen und auch das eine oder andere bekanntere Tool aus dem Linux / Open Source Werkzeugkasten vorgestellt, um die Wahrscheinlichkeit eines erfolgreichen Cyber-Angriffs und die Folgen zu minimieren – und ggf. zerstörte Daten auch wieder zu reparieren.\n\nDer Vortrag ist ein Followup zur Einführung in die Thematik auf den Chemnitzer Linux-Tagen 2024.",
        "description": "",
        "aboutme": "Software-Entwickler, Professor für Software-Engineering und Vizepräsident Digitalisierung an der Hochschule Kaiserslautern/RLP",
        "vorwissen": "Grundlagenwissen zu Netzwerken/Internet und Dateisystemen sowie Interesse an Experten-Tools (auch auf der Linux-Kommandozeile) ist hilfreich, aber nicht zwingend erforderlich.",
        "urlid": "136-verteidigung-gegen-ransomware-cyberangriffe-mit-linux-und-open-source",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "16:00",
        "timeend": "16:50",
        "weblinks": {}
    },
    {
        "name": "Ingo Blechschmidt",
        "titel": "Wie eine Gruppe Nerds einen Wald rettete und nur um Haaresbreite vier Wochen Gefängnis entkam",
        "abstract": "Über die erfolgreiche Rettung vom Forst Kasten bei München. Ein Blick hinter die Kulissen von Klimagerechtigkeitsaktivismus, wenn er von Linux-Nerds und anderen Sorten Nerds gestaltet wird",
        "description": "",
        "aboutme": "Mathematiker aus Augsburg",
        "vorwissen": "",
        "urlid": "140-wie-eine-gruppe-nerds-einen-wald-rettete-und-nur-um-haaresbreite-vier-wochen-gefangnis-entkam",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "17:00",
        "timeend": "17:50",
        "weblinks": {}
    },
    {
        "name": "Tübix Orga Team",
        "titel": "Tübix exit",
        "abstract": "* gemeinsamer Abschluss\n* lottery.sh\n* Ausblick auf nächstes Jahr",
        "description": "",
        "aboutme": "Orga Team",
        "vorwissen": "",
        "urlid": "tuebix-exit",
        "duration": 20,
        "room": "V1 (F119)",
        "timebegin": "18:00",
        "timeend": "18:20",
        "weblinks": {}
    },
    {
        "name": "Harald König",
        "titel": "Hacker Jeopardy",
        "abstract": "Eine unterhaltsame Quizshow zu Informatik-Themen.\nWird vermutlich von Harald König moderiert werden. Falls er ausfällt, moderiert Volker oder jemand anderes.",
        "description": "",
        "aboutme": "Physik-Studium in Tübingen,\nRechner und DCF77 seit ~1980, (La)TeX seit 1986,\nUNIX seit ~1987,\nLinux seit 1992 (0.98.4),\nXFree86-Treiber fuer S3 von ~1993-2001.\nVon 2001 bis 2014 bei der science+computing ag in Tuebingen als SW-Entwickler.\nSeit 2014 nun bei Bosch Sensortec GmbH in Kusterdingen/Reutlingen als “System Expert” fuer Linux (DevOps) und embedded Android (Treiber).\n\nWeitere Interessen sind u.a. Reisen, Kernel, System-Technik und -Tools, Hardware, Grafik (-Treiber,-HW), neuerdings mal wieder Embedded-Systeme und Messtechnik, GPS und OpenStreetmap, u.v.a.m…..",
        "vorwissen": "",
        "urlid": "166-hacker-jeopardy",
        "duration": 110,
        "room": "V1 (F119)",
        "timebegin": "18:30",
        "timeend": "20:20",
        "weblinks": {}
    },
    {
        "name": "Dr. Christoph Zimmermann",
        "titel": "Linux Inlaws - World Domination by Accident",
        "abstract": "Jeder hört Podcasts. Wenige machen welche. Die wenigsten Podcaster beschäftigen sich damit, wie die Inhalte eigentlich zu ihren Zuhörern kommen, sondern verlassen sich auf kommerzielle Plattformen wie Soundcloud, Spotify, etc. \n\nWie Martin Visser und ich vor mehr als fünf Jahren Linux Inlaws - ein englischer FLOSS-Podcast mit mittlerweile im Durchschnitt fünfstelligen Downloads pro Episode sowie Gästen wie der Free software Foundation, der Electronic Frontier Foundation, der Free Software Foundation Europe und der Software Freedom Conservancy (um nur einige der Teilnehmer zu nennen, die im Laufe der Jahre bei der Show dabei waren) - starteten, stand neben den Inhalten ein wichtiger Punkt im Vordergrund: wenig Arbeit! D.h. wie können wir den Automatisierungsgrad nach der Aufnahme einer Show so erhöhen, daß die Show mit so wenig manuellem Aufwand wie möglich zu den Zuhörern gelangt? Und das alles natürlich ausschließlich mit freier Software.\n\nDer Vortrag gibt einen Überblick über folgenden:\n\n- Einführung,\n- Tech-Stack,\n- Workflow-Vorstellung / Automatisierung,\n- Hosting-Aspekte,\n- Dos and don'ts,\n- Diskussion.\n\nDer Vortrag richtet sich nicht nur an Podcaster, die vor ähnlichen Herausforderungen stehen, sondern auch an alle Interessierten, die schon immer mal wissen wollten, was eigentlich hinter der Produktion eines Podcasts steht und wie freie Software hier helfen kann.",
        "description": "",
        "aboutme": "Graubärtiger FLOSS-Hacker ohne Bart, besessen von Open-Source-Betriebssystemen und anderen Hipster-Themen.\n\nMeine erste Begegnung mit den FLOSS-Technologien war 1987, als ich einen Editor namens Emacs kompilierte. Diese Begegnung hatte einen bleibenden Effekt, so dass ich mich mehr als dreißig Jahre später immer noch mit FLOSS-Ökosystemen, -Technologien und -Gemeinschaften sowohl aus technischer als auch aus gesellschaftlicher und politischer Sicht beschäftige. Ich bin Vorstandsmitglied einer der größten deutschen Linux User Groups und regelmäßiger Referent auf deutschen und internationalen FLOSS-Veranstaltungen. Zusammen mit Martin Visser moderiere ich einen der am schnellsten wachsenden FLOSS-Podcasts namens Linux Inlaws. Zu anderen Hobbies gehören IT-Sicherheit, anderer Leute Computer, alles was mit Software-Entwicklung zu tun hat und andere Formen der schwarzen Kunst :-).",
        "vorwissen": "",
        "urlid": "132-linux-inlaws-world-domination-by-accident",
        "duration": 50,
        "room": "V2 (F112)",
        "timebegin": "10:00",
        "timeend": "10:50",
        "weblinks": {}
    },
    {
        "name": "Andreas Grupp",
        "titel": "Das Fediverse",
        "abstract": "Die Abhängigkeit von zentralisierten Big Tech Unternehmen, sowie die damit einhergehenden Gefahren für die freie Welt, ist seit geraumer Zeit bekannt. In jüngerer Zeit, in Zeiten geopolitischer Bedrohungen rückt diese Problematik zwar zunehmend in das Bewusstsein von mehr Menschen, aber nach wie vor meinen Viele die einschlägigen Plattformen wären alternativlos. Dem ist nicht so!\n\nUnter den vielfältigen Alternativen für Online-Diensten gibt es auch solche für den weiten Bereich sogenannter \"Social Media\". Unter Rückbesinnung auf das dezentrale Prinzip der Internet-Technologie sind eine große Zahl an Video-, Micro- & Macro-Blogging-, Foto-Sharing-Plattformen, ... u.v.m. verfügbar und untereinander vernetzt.\n\nDieser nicht technische Talk ...\n\n- beleuchtet die Probleme die mit zentralen Plattformen einhergehen,\n- erläutert das Prinzip hinter den Schlagworten \"Dezentralität\" und \"Föderation\",\n- und zeigt Einstiegsmöglichkeiten in die Welt des Fediverse auf.",
        "description": "",
        "aboutme": "FLOSS- und Privacy-Enthusiast mit der Forderung nach digitaler Souveränität an Schulen, in Vereinen, Unternehmen und natürlich des Staats, möglichst vernetzt in einem werteorientierten Europa. Fortbildner u.a. im Bereich Rechnernetze (CCNA), Network Securty, Linux, Mail-Verschlüsselung … . Im Fediverse u.a. hier https://social.tchncs.de/@angry beheimatet.",
        "vorwissen": "Keines",
        "urlid": "126-das-fediverse",
        "duration": 50,
        "room": "V2 (F112)",
        "timebegin": "11:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Ingo Blechschmidt",
        "titel": "Wie funktioniert eigentlich das Internet? Eine Einführung für alle, die gar nicht oder nicht genau wissen, was eine IP-Adresse ist",
        "abstract": "Unsichtbar im Hintergrund kommunizieren und kooperieren viele Computer miteinander, um dir deine heiß ersehnten Katzenvideos zu liefern. In diesem Workshop machen wir diese Kommunikation mit dem Tool Wireshark (verfügbar für alle Betriebssysteme) sichtbar. In mehreren Live-Demos lernen wir, dass die uns bekannten Domainnamen wie tuebix.org nur eine dünne Hülle über den eigentlichen Adressen sind – den IP-Adressen, mit denen sich Computer wirklich identifizieren.\n\nWir decken auf, welche versteckten Informationen dein Browser bei jeder Anfrage mitsendet, und wir zeigen, wie einfach es ist, Datenverkehr abzufangen.\n\nDieser Workshop richtet sich an alle, die wissen wollen, wie das Internet funktioniert und in welcher Form Computer miteinander kommunizieren. Es sind keinerlei Vorkenntnisse nötig. Wer sich mit Netzwerkprotokollen und -architekturen bereits auskennt, wird sich hier vermutlich zu Tode langweilen.",
        "description": "",
        "aboutme": "Mathematiker aus Augsburg",
        "vorwissen": "",
        "urlid": "139-wie-funktioniert-eigentlich-das-internet-eine-einfuhrung-fur-alle-die-gar-nicht-oder-nicht-genau-wissen-was-eine-ip-adresse-ist",
        "duration": 50,
        "room": "V2 (F112)",
        "timebegin": "12:00",
        "timeend": "12:50",
        "weblinks": {}
    },
    {
        "name": "Dr. Christoph Zimmermann",
        "titel": "FLOSS an Hochschulen - Quo vadis?",
        "abstract": "FLOSS @ Uni - Quo Vadis?\n\nFree Libre Open Source Software (FLOSS) hat sich mittlerweile einen Stammplatz im deutschen Hochschulwesen erobert und ist ist als fester Ausbildungsbestandteil aus den Modulplänen nicht mehr wegzudenken. \n\nSo sollte man/frau/div jedenfalls meinen.\n\nLeider sieht die Realität anders aus. Viel zu oft werden die Schwerpunkte immer noch auf proprietäre Software gelegt; die Omnipräsenz von Powerpoint und Mathlab als häufiger Bestandteil vom Hochschulalltag spricht leider eine zu eindeutige Sprache. Dieser Vortrag stützt sich auf Erfahrungen mit diesem Thema an der University of Applied Sciences in Frankfurt und ist wie folgt gegliedert:\n\n- Einführung\n- Bestandsaufnahme: Wo stehen wir in der Ausbildung?\n- Anforderung an die Ausbildung (insbesondere im Hinblick auf die Omnipräsenz von FLOSS in der Industrie und anderswo)\n- Die Zukunft / nächste Schritte: Ziel und Wege dorthin\n\nDer Fokus dieses Vortrags liegt hierbei auf dem Erfahrungsaustausch der Teilnehmer, daher sind die obigen Themenpunkte als Anhaltspunkte für die Schwerpunkt dieser Diskussion zu verstehen.\n\nDieser Vortrag wendet sich an Praktiker in diesem Umfeld und solche, die es werden wollen.",
        "description": "",
        "aboutme": "Graubärtiger FLOSS-Hacker ohne Bart, besessen von Open-Source-Betriebssystemen und anderen Hipster-Themen.\n\nMeine erste Begegnung mit den FLOSS-Technologien war 1987, als ich einen Editor namens Emacs kompilierte. Diese Begegnung hatte einen bleibenden Effekt, so dass ich mich mehr als dreißig Jahre später immer noch mit FLOSS-Ökosystemen, -Technologien und -Gemeinschaften sowohl aus technischer als auch aus gesellschaftlicher und politischer Sicht beschäftige. Ich bin Vorstandsmitglied einer der größten deutschen Linux User Groups und regelmäßiger Referent auf deutschen und internationalen FLOSS-Veranstaltungen. Zusammen mit Martin Visser moderiere ich einen der am schnellsten wachsenden FLOSS-Podcasts namens Linux Inlaws. Zu anderen Hobbies gehören IT-Sicherheit, anderer Leute Computer, alles was mit Software-Entwicklung zu tun hat und andere Formen der schwarzen Kunst :-).",
        "vorwissen": "",
        "urlid": "123-floss-an-hochschulen-quo-vadis",
        "duration": 50,
        "room": "V2 (F112)",
        "timebegin": "13:00",
        "timeend": "13:50",
        "weblinks": {}
    },
    {
        "name": "Veit Schiele",
        "titel": "Wie uns LLMs beim Programmieren helfen",
        "abstract": "Data Scientists nutzen zunehmend LLMs (GitHub Copilot, LLama, Claude etc.) um schnell einen Prototypen für ihre Datenanalyse zu bauen. Ihre Erwartungen, was sie innerhalb kurzer Zeit mit einem LLM erreichen wollten, sind fast grenzenlos. Häufig ist das Programmieren mit LLMs jedoch schwierig und wenig intuitiv. In diesem Vortrag möchte ich etwas von unserer über zweijährigen Erfahrung mit LLMs zur Datenanalyse mit Python an euch weiterzugeben.",
        "description": "Der Vortrag versucht Antworten auf die folgenden Fragen zu geben:\n* Was dürft ihr von LLMs erwarten?\n* Wie könnt ihr robuste und wartungsarme Software mit LLMs schreiben?\n  * Wie kommen wir zu unserem ersten Prototypen?\n  * Wie spezifizieren wir das Software-Design?\n  * Wie machen wir Code-Reviews und Refactorings?\n  * Wie dokumentieren und Testen wir unseren Code?",
        "aboutme": "Veit Schiele ist Gründer und Geschäftsführer der cusy GmbH, einem Unternehmen, das Data Scientists bei der Datenanalyse unterstützt, passende IT-Plattformen bereitstellt und entsprechende Seminare anbietet. In den letzten Jahren sammelte cusy Erfahrungen mit KI-gestützter Software-Entwicklung und baute diese in ihre IT-Plattformen ein.",
        "vorwissen": "Programmiergrundkenntnisse (in Python) sind wünschenswert.",
        "urlid": "114-wie-uns-llms-beim-programmieren-helfen",
        "duration": 50,
        "room": "V2 (F112)",
        "timebegin": "14:00",
        "timeend": "14:50",
        "weblinks": {}
    },
    {
        "name": "Christof Hanke",
        "titel": "Elektroschrott vermeiden und Geld sparen mit OpenWRT",
        "abstract": "Ihren alten WLAN-Router weiter verwenden, nicht auf den Schrott werfen und dabei Geld sparen ? Das geht mit OpenWRT!\n\nDas OpenSource Projekt OpenWRT steht für \"open wireless router\". Es stellt für verschiedene WLAN-Router (hierzulande oft eine FritzBox) eine alternative, flexiblere und oft modernere Firmware (Betriebssystem) zur Verfügung, auch wenn der Hersteller den Support für das Produkt schon längst eingestellt hat. Damit kann man alten, gebrauchten WLAN-Routern ein zweites Leben einhauchen und sicher weiterbetreiben ohne dafür ein Neugerät anzuschaffen, das dann auch bald wieder \"alt\" ist. So kann es z.B. für die Erweiterung eines  vorhandenen WLANs zu Hause eine kostengünstige, umweltbewusste Alternative sein.",
        "description": "Der Vortrag richtet sich an technikaffine Leute, die mehr aus ihrem Netzwerk zu Hause machen wollen.  \nOpenWRT wird kurz vorgestellt vor und ich erzähle wie ich dazu kam und wie es meine Erwartungen, was man alles damit tun kann übertroffen hat.   \nIch gehe kurz auf den Geschwindigkeitshype der Internetanbieter und wie viel man wirklich braucht.  \nDie wohl größte Hürde, das Flashen (Aufspielen) von OpenWRT wird anhand einer Live-Vorführung mit einer alten FritzBox erklärt. Diese kann gerne von jemandem aus dem Publikum mitgebracht werden.\n\nDanach wird die Weboberfläche eingeführt und je nach Zeit die Themen\n\n\\- Erweiterungen eines WLANs mit Kabelverbindung.   \n- Erweiterung eines WLANs ohne Kabelverbindung  \n- VPN mit Wireguard\n\nangesprochen.",
        "aboutme": "Nach meinem Physik-Studium arbeite ich seit über zwanzig Jahren Systemadministrator an einem renommierten Rechenzentrum. Dabei erlebe ich den Wandel der Technologien hautnah mit.\nSeit einigen Jahre bin ich in Teilzeit, um auch mal andere Wege zu gehen, die aber auch meist in der IT enden.",
        "vorwissen": "Es wird nur geringes Fachwissen benötigt. Der Vortrag richtig sich explizit an interessierte Laien.",
        "urlid": "131-elektroschrott-vermeiden-und-geld-sparen-mit-openwrt",
        "duration": 50,
        "room": "V2 (F112)",
        "timebegin": "15:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Olaf Flebbe",
        "titel": "Fledermaus Desktop",
        "abstract": "Programmiersprachen, Visualisierung, Plattformübergreifende Programmierung, High Performance Computing, GUI paradigmen.\nC, go, rust.\nSafe Programming.\nNeues C",
        "description": "Die Daten des Fledermaus detektors (siehe anderer Vortrag) wollen auch visualisiert werden.\n\nDazu habe ich eine portable Auswertesoftware geschrieben und zwar in C, go und rust, um zu vergleichen. Was ich auf den Weg dorthin gelernt habe:\n\nImmediate Mode GUI's: nuklear für C, gioui für go und egui für Rust.\n\nFFT:  fftw, meow-fft vs gofft vs rust-fft \n\nMultithreading: OpenMP, PosixThreads, C13 Threads vs Goroutines vs Rust Multithreading.\n\nDie OpenSSF Recommendations für Safe C coding vs Rust.\n\nWindows, Linux, MacOS native und crosscompiled: Mingw64, osxcross.\n\nViel zu viel Zeit dafür aufgewendet ... lol",
        "aboutme": "40+ Jahre Erfahrung mit Computern.\nPromotion in theor. Astrophysik.\nMacht beruflich was mit Navigation für EBikes.",
        "vorwissen": "",
        "urlid": "119-fledermaus-desktop",
        "duration": 50,
        "room": "V2 (F112)",
        "timebegin": "16:00",
        "timeend": "16:50",
        "weblinks": {}
    },
    {
        "name": "Olaf Flebbe",
        "titel": "Fledermaus Detektor update",
        "abstract": "Der Fledermausdetektor https://oflebbe.de/presentations/2024/bat_c.pdf hat ein Update bekommen.",
        "description": "* Hardware Update\n* Bugs / Learnings",
        "aboutme": "40+ Jahre Erfahrung mit Computern.\nPromotion in theor. Astrophysik.\nMacht beruflich was mit Navigation für EBikes.",
        "vorwissen": "",
        "urlid": "118-fledermaus-detektor-update",
        "duration": 20,
        "room": "V2 (F112)",
        "timebegin": "17:00",
        "timeend": "17:20",
        "weblinks": {}
    },
    {
        "name": "Stefan Baur",
        "titel": "Bootserver2Go & der X2Go-OpenBox-MicroDesktop",
        "abstract": "[X2Go](https://wiki.x2go.org) ist eine freie Remote-Desktop- und Remote-Application-Software. Zu ihr gehört ein herstellerübergreifend nutzbares ThinClient-Image - in verschiedenen Ausprägungen - welches sich auch über das Netzwerk booten lässt. Mit diesem Image kann man sowohl zu X2Go- wie auch zu XDMCP- und RDP-Servern Verbindungen aufbauen. \nMit dem Bootserver2Go kann man diese ThinClient-Images in einem bestehenden Netzwerk bereitstellen - obwohl dort bereits ein DHCP-Server (z.B. eine FritzBox oder ein Speedport-Router) läuft.",
        "description": "Häufig lässt sich eine Netzboot-Möglichkeit nicht ohne größeren Eingriff in die vorhandene Umgebung testen. Sei es, weil der verwendete Router dies gar nicht unterstützt, oder weil man in der Firma nicht so einfach am DHCP-Server Änderungen vornehmen darf.\n\nUnser Bootserver2Go integriert sich in bestehende Netzwerke, und erkennt, ob dort ein DHCP-Server mit Netzboot-Konfiguration aktiv ist. Wenn ja, stellt er sich tot, wenn nein, ergänzt er die Datenpakete des bestehenden Servers um die notwendigen Einträge. Und sollte man doch auf Probleme stoßen - Stecker ziehen reicht, um den Originalzustand wiederherzustellen, man muss keine Konfigurationsänderungen zurückrollen oder Dienste neu starten.\n\nAls Hardware nutzen wir, um dem \"2Go\" im Namen gerecht zu werden, einen Raspberry Pi 4 oder neuer; optional mit Display und/oder Lautsprecher für ausführlichere Statusinformationen. Dadurch ist die Lösung leicht zu transportieren.\nFür eine dauerhafte Installation kann man natürlich genausogut leistungsfähigere, Intel-kompatible Hardware verwenden.\nUnd natürlich kann unser Bootserver2Go nicht nur X2Go-ThinClient-Images bereitstellen, sondern auch andere Netzboot-Images, z.B. ein minimales Rettungssystem oder ein komplettes Desktop-Linux aus dem Debian-Live-Projekt.\n\nDadurch wird der Bootserver2Go auch interessant, um spontan Not-Arbeitsplätze in Betrieb zu \nnehmen, z.B. mit aus Restbeständen bunt zusammengewürfelter Hardware nach einem Katastrophenfall (Brand, Überschwemmung), oder zum schnellen Wiederanlauf nach einem Ransomware-Angriff (in diesem Fall bitte vorher alle Festplatten der betroffenen Systeme abklemmen - schützt vor Reinfektion und macht den Forensikern das Leben leichter).\nAls Terminalserver (egal ob X2Go, XDMCP, oder RDP) kann entweder vor Ort noch vorhandene (saubere) Hardware genutzt werden, oder bei ausreichender Bandbreite natürlich auch ein Cloudserver.\n\nBei der Live-Demo werden wir unseren neuen X2Go-OpenBox-MicroDesktop als ThinClient-Image vorführen. Dieser verfügt über einen minimalen lokal laufenden Desktop mit Browsern und Terminal-Emulationen, so dass Videokonferenzen und Mainframe/Midrange-Zugriff direkt vom Client aus funktioniert. Durch den auf dem ThinClient laufenden Desktop muss man auf dem X2Go-Server keinen kompletten Desktop, sondern nur noch einzelne Anwendungen bereitstellen, wodurch er auf günstigerer Hardware laufen bzw. mehr Benutzer versorgen kann.\n\nAlles rund um X2Go ist im X2Go-Wiki zu finden:\nhttps://wiki.x2go.org/doku.php\n\nSpeziell zum Einstieg gibt es diese Wiki-Seite:\nhttps://wiki.x2go.org/doku.php/doc:newtox2go",
        "aboutme": "Stefan Baur, Jahrgang 1977, ist der aktuelle Projektmanager und Lead Evangelist des Open-Source-Projekts X2Go und geschäftsführender Gesellschafter der BAUR-ITCS UG (haftungsbeschränkt), welche Support für X2Go und eine auf X2Go basierende Security-Lösung anbietet, sowie einer der Vorstände der Open Remote Computing Association - orca e.V., einem Dachverein für freie Remote-Computing-Projekte. Nebenbei bastelt er noch an seinem privaten Projekt “Grannophone” - einem Open-Source-Videotelefon für Senioren.",
        "vorwissen": "Linux-Grundkenntnisse (speziell im Bereich Administration und Netzwerk) sollten zum Verständnis des Vortrags vorhanden sein. Schon mal ein Live-Linux (egal ob übers Netz oder via USB-Stick/CD-ROM/DVD) benutzt zu haben, schadet ebenfalls nicht.",
        "urlid": "127-bootserver2go-der-x2go-openbox-microdesktop",
        "duration": 50,
        "room": "V3 (A301)",
        "timebegin": "10:00",
        "timeend": "10:50",
        "weblinks": {}
    },
    {
        "name": "Lukas Kallies",
        "titel": "Container-Plattform - aber sicher! Ein Kurztrip durch die Landschaft der Cloud-Nativen Security-Produkte",
        "abstract": "Eine klassische IT-Landschaft unterscheidet sich nicht grundlegend von einer Container-basierten Umgebung. Dennoch greifen bewährte Sicherheits- und Überwachungsmaßnahmen nicht mehr oder nicht effizient. Mit SUSE Security (NeuVector) und Red Hat Advanced Cluster Security stehen potente Lösungen zur Verfügung. Der Vortrag soll zeigen, welche Herausforderungen mit diesen Ansätzen bewältigt werden können.",
        "description": "",
        "aboutme": "Working at Puzzle ITC on Open Source, Automation and Container Platform topics.",
        "vorwissen": "Es sollte das Verständnis vorhanden sein, was eine Container-Plattformen auf Kubernetes-Basis ist. Erfahrungen mit dem Erstellen von Applikationen auf einer solchen Plattform sind wünschenswert.",
        "urlid": "148-container-plattform-aber-sicher-ein-kurztrip-durch-die-landschaft-der-cloud-nativen-security-produkte",
        "duration": 50,
        "room": "V3 (A301)",
        "timebegin": "11:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Adrian Reber",
        "titel": "State of Checkpoint/Restore in Kubernetes (now with GPUs)",
        "abstract": "Gestartet als \"Forensic Container Checkpointing\" in 2022 als Kubernetes Alpha Feature, ist Checkpoint/Restore inzwischen in Kubernetes ein Beta Feature und nun auch möglich mit containerd 2.x und CRI-O. Selbst wenn das Feature unter dem Namen \"Forensic Container Checkpointing\" in Kubernetes verfügbar ist, ist es nicht darauf beschränkt. In diesem Vortrag möchte ich auf die zusätzlichen Use Cases, wie Container Migration, Fehler Toleranz, Schnellere Start und optimierte Ressourcennutzung eingehen. Besonders in Kombination mit Container die GPUs nutzen eröffnet es die Möglichkeit die GPUs effizienter zu nutzen und Leerlauf zu verhindern (mit Live Demo).",
        "description": "",
        "aboutme": "Adrian is a Senior Principal Software Engineer at Red Hat and is migrating processes at least since 2010. He started to migrate processes in a high performance computing environment and at some point he migrated so many processes that he got a PhD for that. Most of the time he is now migrating containers but occasionally he still migrates single processes.",
        "vorwissen": "",
        "urlid": "116-state-of-checkpoint-restore-in-kubernetes-now-with-gpus",
        "duration": 20,
        "room": "V3 (A301)",
        "timebegin": "12:00",
        "timeend": "12:20",
        "weblinks": {}
    },
    {
        "name": "Holger Gantikow",
        "titel": "Irgendwas mit Containern 2025",
        "abstract": "Da Holger dieses Jahr noch nicht so ganz mit der Abarbeitung seiner Todo-Liste hinterherkommt, soll diese Einreichung einen Platzhalter darstellen.\n\nAktuell plant er entweder einen \"vollen\" Talk zu Container im Kontext von HPC/Automotive (\"2025 Update\") oder Security - oder (wahrscheinlicher) 2 kleine zu den Themen.",
        "description": "",
        "aboutme": "Holger Gantikow arbeitet als IT-Landscape Architect für Atos/Eviden science + computing in Tübingen.\nSeit knapp 15 Jahren beschäftigt er sich dort mit der Komplexität von CAE-Berechnungsumgebungen und hilft Kunden aus der Automobilindustrie, das Beste aus ihren Systemen herauszuholen. Von Anfang an war er fasziniert davon, wie die Virtualisierung die IT verändert hat. Heutzutage interessiert er sich vor allem für Container.",
        "vorwissen": "Ein spezielles Vorwissen der Zuhörer wird nicht vorausgesetzt. Interesse an HPC, Virtualisierung, speziell Containern ist sicherlich von Vorteil, um eine rege Diskussion und Erfahrungsaustausch zu gewährleisten.",
        "urlid": "144-irgendwas-mit-containern-2025",
        "duration": 50,
        "room": "V3 (A301)",
        "timebegin": "12:30",
        "timeend": "13:20",
        "weblinks": {}
    },
    {
        "name": "Samuel Precupas",
        "titel": "EU Cyber Resiliance Act: Fakten, Mythen und Ungeklärtes",
        "abstract": "Wir befinden uns schon in der Übergangsphase des CRAs und erste Verpflichtungen treten schon im September 2026 in Kraft. Die vollständige Umsetzung muss bis Dezember 2027 erfolgen. Trotz dieser nahen Deadlines kursieren noch viele Mythen zum CRA, weiterhin gibt es noch einige Unklarheiten innerhalb des Gesetzestexts, welche dringend geklärt und besprochen werden müssen.\nIn diesem Vortrag binde Ich an einen gemeinsam mit der OSBA geschriebenen Artikel (https://osb-alliance.de/featured/mythbusting-cra) an, und erweitere diesen in Vortragsform mit weiteren Mythen, die mir über den Weg gelaufen sind, zeige ungeklärte Fragen auf und gebe den Zuschauern Leitlinien, zum Navigieren des CRA Textes in einem Versuch ein wenig zu beruhigen.",
        "description": "",
        "aboutme": "Softwareentwickler mit Compliance Hintergrund bei der sodgeIT GmbH in Balingen\n\nB.Sc. in IT-Security",
        "vorwissen": "",
        "urlid": "124-eu-cyber-resiliance-act-fakten-mythen-und-ungeklartes",
        "duration": 20,
        "room": "V3 (A301)",
        "timebegin": "13:30",
        "timeend": "13:50",
        "weblinks": {}
    },
    {
        "name": "Rainer Grimm",
        "titel": "C++26 Highlights",
        "abstract": "Mit Reflection, Contracts und std::execution erhält C++ drei Features, die die Sprache nachhaltig verändern werden:\n\n- \"Reflexion\" ist die Fähigkeit eines Programms, seine Struktur und sein Verhalten zu untersuchen, zu hinterfragen und zu ändern,\n\n- ein „Contract“ spezifiziert Schnittstellen für Softwarekomponenten präzise und überprüfbar. Diese Softwarekomponenten sind Funktionen, die Vorbedingungen, Nachbedingungen und Invarianten erfüllen,\n\n- std::execution, früher als „Executors“ oder „Senders/Receivers“ bekannt, bietet „ein Standard-C++-Framework für die Verwaltung der asynchronen Ausführung auf generischen Ausführungsressourcen“.",
        "description": "",
        "aboutme": "Rainer Grimm ist seit vielen Jahren als Softwarearchitekt, Team- und Schulungsleiter tätig. In seiner Freizeit schreibt er gerne Artikel zu den Programmiersprachen C++, Python und Haskell, spricht aber auch gerne auf Fachkonferenzen. Auf seinem Blog Modernes C++ (heise Developer) beschäftigt er sich intensiv mit seiner Leidenschaft C++. Seit 2016 steht er auf selbstständigen Beinen. Insbesondere das Vermitteln von Wissen zu modernem C++ ist ihm eine Herzensangelegenheit. Seine Bücher \"C++11 für Programmierer\", \"C++\" und \"C++-Standardbibliothek\" für die \"kurz und gut\"-Reihe sind beim Verlag O'Reilly erschienen. Seine englischsprachigen Werke \"The C++ Standard Library\", \"Concurrency with Modern C++\" und \"C++20\" sind in mehrere Sprachen übersetzt worden. 2022 erschien sein englischsprachiges Buch zu den \"C++ Core Guidelines\" bei Addison-Wesley.",
        "vorwissen": "Grundwissen C++",
        "urlid": "115-c-26-highlights",
        "duration": 50,
        "room": "V3 (A301)",
        "timebegin": "14:00",
        "timeend": "14:50",
        "weblinks": {}
    },
    {
        "name": "Michael Weiss",
        "titel": "How to Tübix",
        "abstract": "Einblicke in die Organisation des Tübix sowie Anekdoten aus den letzten Jahren und Zeit für Fragen.\n\nZielgruppe: Interessenten (Blicke hinter die Kulissen was die Organisation angeht) und Leute die selber einen Linuxtag organisieren wollen.",
        "description": "",
        "aboutme": "Softwareentwickler bzw. Sysadmin bei der science + computing AG in Tübingen (Teil von Atos/Eviden). Früherer NixOS Entwickler. Auf der Tübix seit 2017 im Orgateam (und seit 2016 als Teilnehmer/Speaker).",
        "vorwissen": "",
        "urlid": "152-how-to-tubix",
        "duration": 50,
        "room": "V3 (A301)",
        "timebegin": "15:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Michael Weiss & Christoph Prokop",
        "titel": "Lightning Talks Intro",
        "abstract": "Kurze Begrüßung, Aufbau und Beschreibung des Vorgehens.\nOpen mic nach den im Vorfeld eingereichten Lightning Talks.",
        "description": "",
        "aboutme": "\n\n#### Michael Weiss\n\nSoftwareentwickler bzw. Sysadmin bei der science + computing AG in Tübingen (Teil von Atos/Eviden). Früherer NixOS Entwickler. Auf der Tübix seit 2017 im Orgateam (und seit 2016 als Teilnehmer/Speaker).\n\n#### Christoph Prokop\n\nIch mag Linux und Spiele.",
        "vorwissen": "",
        "urlid": "172-lightning-talks-intro",
        "duration": 5,
        "room": "V3 (A301)",
        "timebegin": "16:00",
        "timeend": "16:05",
        "weblinks": {}
    },
    {
        "name": "Lukas Pietzschmann",
        "titel": "Von riesigen Commits und Cthulhu's Merge: Ein Blick in die Linux-Kernel-Historie",
        "abstract": "Der Lightning-Talk erzählt ein paar schräge Geschichten aus der Git-Historie des Kernels. Dabei geht’s vor allem um riesige Commits und einen Merge, der so viele Eltern hatte, dass er den Spitznamen „Cthulhu“ bekam.",
        "description": "",
        "aboutme": "- Doktorand am Institut für Verteilte Systeme der Uni Ulm\n- Begeistert von allem, was Code ausführt\n- [Hätte lieber Zig als Rust im Kernel ;)](https://media2.giphy.com/media/v1.Y2lkPTc5MGI3NjExYXBvNmJhc3U3ZWRmNXJhc3duNGdxMGJoaDA3YWJwbHZxMjU5b2Q5aCZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/3oEjI1erPMTMBFmNHi/giphy.gif)",
        "vorwissen": "",
        "urlid": "169-von-riesigen-commits-und-cthulhu-s-merge-ein-blick-in-die-linux-kernel-historie",
        "duration": 5,
        "room": "V3 (A301)",
        "timebegin": "16:05",
        "timeend": "16:10",
        "weblinks": {}
    },
    {
        "name": "Michael Weiss",
        "titel": "Nix(OS) - Ein Überblick",
        "abstract": "Ein kurzer Überblick über den funktionalen Paketmanager Nix, die darauf basierende Linux Distribution NixOS, sowie Nixpkgs und weitere nützliche Tools. Es geht v.a. darum die Konzepte zu vermitteln sowie die Unterschiede zu klassischen Paket-Managern aufzuzeigen (mögliche Vor- und Nachteile).",
        "description": "Nix ist ein funktionaler Paketmanager, der auch auf anderen Betriebssystem genutzt werden kann, ohne Konflikte mit dem bestehenden package manager zu bekommen. NixOS ist eine auf Nix basierende Linux-Distribution, mit der neben den Software-Paketen zusätzlich auch die System-Konfiguration über Nix verwaltet werden kann. Die Paket-Definitionen und NixOS Module zur Systemkonfiguration werden in Nixpkgs, einem großen Git Repository, zentral verwaltet.\n\nNix(OS) verfügt unter anderem über folgende Features:\n- Transparent source/binary model\n- Declarative (system configuration)\n- Reproducible builds\n- Multi-user, multi-version (no conflicts)\n- Portable (Linux, macOS, …)\n- Reliable and atomic updates\n- Rollbacks",
        "aboutme": "Softwareentwickler bzw. Sysadmin bei der science + computing AG in Tübingen (Teil von Atos/Eviden). Früherer NixOS Entwickler. Auf der Tübix seit 2017 im Orgateam (und seit 2016 als Teilnehmer/Speaker).",
        "vorwissen": "Zum besseren Verständnis hilft es bereits (genauer) mit anderen Linux Distributionen bzw. Paketmanagern vertraut zu sein.",
        "urlid": "170-nix-os-ein-uberblick",
        "duration": 5,
        "room": "V3 (A301)",
        "timebegin": "16:10",
        "timeend": "16:15",
        "weblinks": {}
    },
    {
        "name": "",
        "titel": "Lightning Talks: Open mic",
        "abstract": "Open stage: Hier sind die Teilnehmenden gefragt: Wer will noch spontan ein Projekt/Konzept/Tool/etc. vorstellen?",
        "description": "",
        "aboutme": "",
        "vorwissen": "",
        "urlid": "156-lightning-talks-open-mic",
        "duration": 80,
        "room": "V3 (A301)",
        "timebegin": "16:30",
        "timeend": "17:50",
        "weblinks": {}
    },
    {
        "name": "Matthias Schlecht",
        "titel": "Virtualisierst du schon, oder klickst du noch? Automatisierte VM-Umgebung mit FOSS-Software-Stack!",
        "abstract": "DeepDive in die FOSS-Virtualisieungsumgebung von BelWü.",
        "description": "Dieser DeepDive beinhaltet folgende Themen\n  * Intro: Wer ist BelWü und was machen wir?\n  * Überblick über die Serverlandschaft\n  * Speicher und SAN\n  * Verkabelung und physikalisches Netzwerk (Doku...)\n  * Installation von Servern (di-netboot)\n  * Netzwerk-Stack mit BGP und SAN-Netzwerk\n  * Ansible und Playbooks\n  * Backups und Restore\n  * Live-Migration und deren Tücken\n  * Firewall-Konzept, dynamische Firewall-Regeln",
        "aboutme": "System Engineer beim Landeshochschulnetzwerk BelWü. Linux-begeistert seit Ubuntu 8.04.",
        "vorwissen": "Die Begriffe VM, Ansible und Hypervisor sollten bekannt sein. Es wird auch einen kleinen BGP-Teil geben, das kann man aber als Blackbox betrachten ;-)",
        "urlid": "128-virtualisierst-du-schon-oder-klickst-du-noch-automatisierte-vm-umgebung-mit-foss-software-stack",
        "duration": 50,
        "room": "V5 (C215)",
        "timebegin": "12:30",
        "timeend": "13:20",
        "weblinks": {}
    },
    {
        "name": "Yannick Huber",
        "titel": "Automatisierte Netzwerk Performance Messungen mit dem Open Source Toolkit perfSONAR",
        "abstract": "perfSONAR ist ein Open Source Toolset, das die automatisierte Durchführung von aktiven Performance-Messungen zwischen mehreren verteilten Messpunkten über Netzwerkgrenzen hinweg ermöglicht.\nEs kombiniert mehre existierende Open-Source Lösungen zu Messung von Netzwerk-Performance-Parametern. Zudem bietet es eine internationale Community, die offene Testknoten anbietet, gegen die automatisierte Tests ausgeführt werden können. Dies erlaubt es beispielsweise Peerings zu verschiedenen internationalen Netzen zu bewerten und historische Daten zu sammeln, um etwaige Änderungen zu erkennen. Dies ist als Netzwerkbetreiber ein hilfreiches Analysetool. \nUm der perfSONAR Community etwas zurückzugeben, hat das BelWü mittlerweile einen eigenen öffentlichen perfSONAR Server gehostet. \nDer Vortrag veranschaulicht die hierbei gewonnen Erfahrungen mit dem Aufsetzen und Verwenden von PerfSONAR und zeigt, wie das perfSONAR Toolkit bestehende Open Source Software zu einem eigenständigen neuen Open Source Software kombiniert.",
        "description": "",
        "aboutme": "Yannick arbeitet beim BelWü, dem Hochschulnetzbetreiber für Baden-Württemberg als Mitarbeiter im BwNET 2.0 Projekt – einer vom MWK Baden-Württemberg (MWK) geförderten Forschungsinitiative des Bundes, die aktuelle Forschung mit dem operativen Management von Kommunikationsnetzen verbindet. Im Rahmen des Projekts forscht er im Bereich Netzwerk Monitoring und ist unter anderem an der Entwicklung der Open-Source Flow Monitoring Software \"Flowpipeline\" beteiligt.",
        "vorwissen": "Grundlegende Vorkenntnisse im Netzwerkbereich sind hilfreich.",
        "urlid": "157-automatisierte-netzwerk-performance-messungen-mit-dem-open-source-toolkit-perfsonar",
        "duration": 20,
        "room": "V5 (C215)",
        "timebegin": "13:30",
        "timeend": "13:50",
        "weblinks": {}
    },
    {
        "name": "Sebastian Neuner",
        "titel": "NetBox: Doku fürs Datacenter und Netzwerk",
        "abstract": "NetBox ist eine Web-Anwendung zur Dokumentation von allen Möglichen Dingen im Datacenter/Netz, z.B. Servern, Routern, IP-Adressen... In einem kurzen Show & Tell zeige ich, was die Software kann, aber auch wo ggf. Hürden liegen und mehr Mühe investiert werden muss, als man erstmal erwarten würde.",
        "description": "NetBox ist eine großartige Software zur Dokumentation von Sites, Routern, Servern, Schränken, ... (\"Datacenter Inventory Management\", DCIM) und von IP-Adressen, Präfixen, VLANs, ... (\"IP Address Management\", IPAM). In den letzten Jahren ist NetBox stetig an Features gewachsen und wird auch im professionellen Umfeld z.B. bei Internetprovidern eingesetzt.\n\nDie Verknüpfung dieser Dinge macht NetBox zu einem sehr mächtigen Werkzeug. Beispielsweise könnte bei einem Server eine Position in einem Rack zugewiesen werden, seine Interfaces angelegt und mit IP-Adressen versehen und mit Cables auf einen Switch gepatcht werden.\n\nNetBox wird über eine Web-Oberfläche bedient, aber hat hat auch Möglichkeiten, eigene Scripte einzubinden und stellt REST/GraphQL APIs bereit.\n\nBeim praktischen Einstieg in NetBox herrscht aber oft etwas Ernüchterung, da beispielsweise für jede Art von Gerät ein Device Type angelegt werden muss. Dieser sollte auch gleich ein möglichst gutes Template für Geräte sein - z.B. Interfaces, Netzteile, etc. enthalten. Das ist erstmal unerwartet mühsam, lohnt sich später aber. Auch die Dokumentation von Leitungen ist naturgemäß mühsam - ähnlich wie in anderen Dokumentationstools. Der geübte User weiß deshalb Features wie Bulk-Edits zu schätzen.\n\nDer Vortrag soll als Show & Tell eine Übersicht über die Features geben, aber auch beleuchten, welche Funktionalitäten (absichtlich) fehlen, und wo die Bedienung ggf. mühsam ist.",
        "aboutme": "Backbone-Netzwerker beim Landeshochschulnetz (BelWü)",
        "vorwissen": "Vorwissen ist nicht zwingend nötig. Ein Verständnis von (auch kleinen) Rechenzentren/Netzen hilft zu verstehen, was man mit der Software machen kann und warum man das braucht.",
        "urlid": "125-netbox-doku-furs-datacenter-und-netzwerk",
        "duration": 20,
        "room": "V5 (C215)",
        "timebegin": "14:00",
        "timeend": "14:20",
        "weblinks": {}
    },
    {
        "name": "Moritz Flüchter",
        "titel": "Read linux networking code without C-ing - Kernel-Code abstrahieren und verstehen!",
        "abstract": "Der Linux-Kernel-Quellcode wirkt auf den ersten Blick abschreckend, kompliziert und schwer zugänglich - und auf den zweiten und dritten Blick auch.\nDabei ist es durchaus möglich Teile des Kernels zu lesen und zu verstehen wenn ein paar Grundkonzepte bekannt sind.",
        "description": "Ziel dieses Vortrags ist es, den Einstieg in das Lesen des Quellcodes im Bereich der Netzwerkprotokolle zu erleichtern und das auch ohne tiefgehende C-Kenntnisse.\nDazu werden zentrale Konzepte des Linux-Netzwerkstacks kurz erklärt und gezeigt, wie man diese als Orientierung nutzen kann, um sich im Code zurechtzufinden.\n\nEin vollständiges Verständnis des Kernels ist dabei nicht das Ziel (das wäre in 20 Minuten auch ziemlich schwer), dafür aber ein erster Schritt und Anreiz zur eigenen Erforschung des Kernels.",
        "aboutme": "Ich bin Moritz, arbeite an der Uni im Bereich Netzwerktechnik. Mit Linux beschäftige ich mich schon seit längerem, aber erst seit kurzem mit dem Kernel selbst. \nAktuell liegt mein Interesse besonders bei eBPF und dem Netzwerkstack.",
        "vorwissen": "Grundlegendes Vorwissen über Betriebssyteme, Programmiersprachen und den Linux Kernel ist meiner Meinung nach notwendig.  Vor allem, um überhaupt ein Interesse am Lesen von Quellcode zu haben. Weiterhin ist ein wenig Wissen über Netzwerkrotokollen (Pakete, IP, TCP, UDP) sehr hilfreich.",
        "urlid": "151-read-linux-networking-code-without-c-ing-kernel-code-abstrahieren-und-verstehen",
        "duration": 20,
        "room": "V5 (C215)",
        "timebegin": "14:30",
        "timeend": "14:50",
        "weblinks": {}
    },
    {
        "name": "Steffen Klein",
        "titel": "Zynthian",
        "abstract": "# Zynthian\nMultipurpose Musik-Computer basierend auf RaspberryPi und einem auf Debian basierenden OS.",
        "description": "# Zynthian\n...kann u.a. folgende Rollen einnehmen:\n- Synthesizer/Sound Expander\n- Multieffektgerät\n- Live Looping Sampler\n- Step Sequencer\n- Tuner\n\n...kann als vollständiges DIY-Kit gekauft oder einzeln in Selbstbau-Projekten genutzt werden.\n\nWir schauen uns diese audiophile eierlegende Wollmilchsau an, wie ist das System aufgebaut, welche Möglichkeiten bietet es und vor allem: Wie hört es sich an?",
        "aboutme": "Started with keyboards, proceeded to MIDI recording for which I needed a computer, which in turn lead to the need of understanding and fixing problems, learned about Linux...\n… and many, many years later about Zynthian.\nThe circle is closed!",
        "vorwissen": "Kein Vorwissen nötig, ein gewisses Interesse an Musikelektronik und/oder Linux mag aber hilfreich sein.",
        "urlid": "103-zynthian",
        "duration": 50,
        "room": "V5 (C215)",
        "timebegin": "15:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Christian Seiler",
        "titel": "Partitionen, MBR, GPT, UEFI - was soll das ganze?",
        "abstract": "In der heutigen Zeit ist es nicht immer einfach, bei dem Thema Partitionierung durchzusteigen. In diesem Vortrag wird Schritt für Schritt erklärt, was Partitionen sind, warum man sie braucht, und welche Standards sich wie durchgesetzt haben. Es werden diverse Tools vorgestellt, die man verwenden kann, um Partitionen zu verstehen und zu bearbeiten.",
        "description": "",
        "aboutme": "Ich bin Softwareentwickler im Raum Tübingen/Reutlingen und bin nun schon seit fast 30 Jahren mit Linux unterwegs. Ich bin in der Linux User Group Tübingen und im ChaosTreff Tübingen aktiv.",
        "vorwissen": "",
        "urlid": "155-partitionen-mbr-gpt-uefi-was-soll-das-ganze",
        "duration": 50,
        "room": "V5 (C215)",
        "timebegin": "16:00",
        "timeend": "16:50",
        "weblinks": {}
    },
    {
        "name": "Sebastian Steck",
        "titel": "Quelltext-Klage als Verbraucher",
        "abstract": "Copyleft-Lizenzen, wie die GPL, schreiben vor, dass Verbraucher neben der Binary auch den vollständigen Quelltext erhalten. Wie kürzliche Gerichtsverfahren gezeigt haben, können auch Verbraucher auf die Bereitstellung dieses Quelltextes klagen. Daneben können auch Verbraucherverbände klagen; diese können gleich für alle Geräte eines Herstellers klagen.",
        "description": "Dieser Vortrag wird zuerst erklären was freie Software und Copyleft ist und dann für den Vortag wichtige Teile der GPL-2.0 und LGPL-2.1 vorstellen. Sodann wird philosophiert, dass auch juristische Systeme gehackt werden können. Anschließend wird der noch laufende Fall Software Freedom Conservancy gegen Vizio besprochen; der abgeschlossene Fall Sebastian Steck gegen AVM wird ausführlich dargestellt. Abschließend wird detailliert erklärt, wie ein Verbraucherverband in diesen Fällen Urteile, die auf alle Geräte eines Herstellers wirken, erreichen kann, und um Mitglieder für einen Freie-Software-Verbraucherverband geworben.",
        "aboutme": "Ich beschäftige mit seit über zehn Jahren mit der GPL und deutschem Recht. Im Prozess Sebastian Steck gegen AVM war ich der Kläger. Ich habe den Freie-Software-Verbraucherverband FOSS Users e.V. mitgegründet.",
        "vorwissen": "",
        "urlid": "133-quelltext-klage-als-verbraucher",
        "duration": 50,
        "room": "V5 (C215)",
        "timebegin": "17:00",
        "timeend": "17:50",
        "weblinks": {}
    },
    {
        "name": "Rüdiger Marwein",
        "titel": "Kachel dich glücklich",
        "abstract": "Mitmachen: Wir lernen i3 kennen, wie er funktioniert und wie man ihn konfiguriert.",
        "description": "Es gibt eine besondere Art Desktop, bei dem sich Fenster nicht überlagern. Das kann Stress reduzieren, die Produktivität steigern und die \"Fenster-Hygiene\" verbessern. \n\nIch möchte Euch über die Einstiegshürde helfen und Lust darauf machen, solch einen Desktop selbst zu nutzen.\n\nWer mitmachen möchte, benötigt ein lauffähiges Linux (ich selbst werde Debian nutzen).\nWer kann, darf zuhause vorinstallieren: \n``sudo apt install i3-wm i3lock i3status dmenu dex xss-lock vim rofi nitrogen numlockx autotiling x11-utils``",
        "aboutme": "Ich nutze Linux seit ca 25 Jahren Linux als Desktop für jegliche Alltagsaufgaben, für Spiele und zum Programmieren, habe Medien-Informatik in Reutlingen studiert, arbeite als IT-Berater in der Modebranche und engagiere mich für Medienkompetenz.",
        "vorwissen": "Linux Grundlagen, Tastaturbedienung, Texteditor",
        "urlid": "112-kachel-dich-glucklich",
        "duration": 110,
        "room": "W1 (B116)",
        "timebegin": "10:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "TUXEDO",
        "titel": "Einstieg in Linux am Beispiel TUXEDO OS",
        "abstract": "Bist du neugierig auf Linux, weißt aber nicht, wo du anfangen sollst? Dieser Workshop richtet sich an Einsteiger und zeigt dir, wie einfach es ist, mit TUXEDO OS in die Welt von Linux einzutauchen.",
        "description": "Dieser Workshop bietet eine praktische Einführung in die Welt von Linux. Anhand der benutzerfreundlichen Distribution TUXEDO OS lernst du die Grundlagen des Betriebssystems kennen. Wir führen dich durch die Installation, zeigen dir die wichtigsten Programme und Funktionen und beantworten deine Fragen.  \n\nWir haben einige Notebooks für euch bereitstehen, aber bringt gerne eure eigenen Geräte mit.",
        "aboutme": "\"Linux first\" - nach diesem Motto werden TUXEDO-Notebooks und -PCs am Standort Augsburg in Süddeutschland in erster Linie auf den Betrieb mit Linux optimiert. Bei TUXEDO ist Linux kein Neben- oder Nischengeschäft. Linux ist unser Markenkern, seit inzwischen 18 Jahren!\n\nSo erhalten Sie von TUXEDO nicht nur Linux-Notebooks und -PCs mit bestmöglichem Linux-Support, sondern Hardware, die mit sämtlichen Treibern startklar vorinstalliert ausgeliefert wird. TUXEDO Computers sind individuell konfigurierbare Linux-Notebooks und Desktop PCs, die auf den Betrieb mit Ubuntu-basierten Betriebssystemen optimiert sind, eben Linux-Hardware im Maßanzug.",
        "vorwissen": "",
        "urlid": "109-einstieg-in-linux-am-beispiel-tuxedo-os",
        "duration": 110,
        "room": "W1 (B116)",
        "timebegin": "14:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Bonnie",
        "titel": "How to do a podcast with Free Software",
        "abstract": "In this workshop, Bonnie will share her knowledge and skills on how to produce podcasts using Free Software, providing you with the tools and techniques to create your own podcast projects.\n\nThis is the perfect workshop for everybody who wants to share their ideas and thoughts with others through podcasts. Join this hands-on workshop where we produce our very first podcast together using Free Software. Learn the basics of recording, editing, and publishing podcasts with Free Software tools, and discover how to create quality content without relying on proprietary software. Everybody is welcome to join us from beginners and those looking to switch to Free Software!\n\nPlease, register for attending the workshop: https://share.fsfe.org/apps/forms/s/fQWcEi2BYzoJy6KRpQmT69eH",
        "description": "",
        "aboutme": "Bonnie Mehring hat Politikwissenschaften in Marburg studiert und arbeitet bereits seit über 10 Jahren für und mit Freie Software. Durch Freie Software hat sie nicht nur ein umfangreiches Wissen über Computer und Technologie erworben, sondern auch Verbindungen zu anderen Menschen geknüpft. Sie nimmt gerne an verschiedenen Konferenzen und Veranstaltungen zu Freier Software teil und genießt die Gelegenheit, mit Menschen aus der Freien-Software-Gemeinschaft in Kontakt zu treten. Für Bonnie ist es von größter Bedeutung, dass inklusive und einladende Freie-Software-Gemeinschaften geschaffen werden, die es jedem ermöglichen, sich zu engagieren und zu lernen. Derzeit arbeitet Bonnie als Projektmanagerin bei der Free Software Foundation Europe und verantwortet den jährlichen \"I Love Free Software Day\" sowie den Programmierwettbewerb \"Youth Hacking 4 Freedom\" und ist Host des Software Freedom Podcast.",
        "vorwissen": "",
        "urlid": "105-how-to-do-a-podcast-with-free-software",
        "duration": 110,
        "room": "W1 (B116)",
        "timebegin": "16:00",
        "timeend": "17:50",
        "weblinks": {}
    },
    {
        "name": "Harald König",
        "titel": "STRACE-Sprechstunde(n)",
        "abstract": "Was ich schon immer mit STRACE machen & diskutieren wollte -- iIhr fragt, ich erzähle und trace...\n\nAn euren Fragen, Themen und Problemen (oder doch nur meine eigenen Lösungen?) werde ich einige Grundlagen von STRACE erörtern und helfen, neue Ideen zu bekommen…\n\nAm besten natürlich über EURE Probleme, daher bitte im VORAUS mit interessanten Themen melden an: koenig (at) linux.de",
        "description": "strace ist ein wahres Wundertool in Linux, man muss es nur einsetzen – und kann damit sehr viel\nüber die Abläufe und Interna von Linux lernen. Mit strace können einzelne oder mehrere Prozesse zur Laufzeit auf System-Call-Ebene ”beobachtet“ werden. Damit lassen sich bei vielen Problemen\nsehr einfach wertvolle Informationen zum Debuggen gewinnen: welche Config-Dateien wurden wirklich gelesen, welches war die letzte Datei oder Shared-Library vor dem Crash usw. Im Unterschied\nzu interaktiven Debuggern läuft das zu testende Programm mit strace mehr oder weniger in Echtzeit ab, und man erhält schon während des Programm-Laufs jede Menge Ausgaben zu allen erfolgten\nKernel-Calls, so dass man den Ablauf des Prozesses ”live“ mitverfolgen bzw. den abgespeicherten\nOutput nachträglich bequem auswerten kann.\nAuch bei Performance-Problemen kann man mit strace interessante Informationen gewinnen: wie\noft wird ein Syscall ausgeführt, wie lange dauern diese, wie lange ”rechnet“ das Programm selbst\nzwischen den Kernel-Calls. Man kann auch den kompletten I/O eines Programms (Disk oder Net) mit\nstrace recht elegant mitprotokollieren und später offline analysieren (oder auch ”replay“en, bei Bedarf sogar in ”Echtzeit“ Dank präziser Time-Stamps).\n\nDer Workshop soll anregen, strace kennen zulernen, und neue Ideen im Umgang mit strace zu bekommen (das gilt natürlich auch für durch eure Fragen;-)\n\nAuf diesen alten Folien (https://www.luga.de/download/Vortraege/lit2016-strace.pdf) gibt es ab Seite 10 so einiges über strace zu schmökern...",
        "aboutme": "Physik-Studium in Tübingen,\nRechner und DCF77 seit ~1980, (La)TeX seit 1986,\nUNIX seit ~1987,\nLinux seit 1992 (0.98.4),\nXFree86-Treiber fuer S3 von ~1993-2001.\nVon 2001 bis 2014 bei der science+computing ag in Tuebingen als SW-Entwickler.\nSeit 2014 nun bei Bosch Sensortec GmbH in Kusterdingen/Reutlingen als “System Expert” fuer Linux (DevOps) und embedded Android (Treiber).\n\nWeitere Interessen sind u.a. Reisen, Kernel, System-Technik und -Tools, Hardware, Grafik (-Treiber,-HW), neuerdings mal wieder Embedded-Systeme und Messtechnik, GPS und OpenStreetmap, u.v.a.m…..",
        "vorwissen": "kein Vorwissen erforderlich – nur ein wenig Interesse an strace und den Linux Kernel-Calls",
        "urlid": "164-strace-sprechstunde-n",
        "duration": 110,
        "room": "W2 (A302)",
        "timebegin": "10:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Philipp Kammerer",
        "titel": "Einstieg in LaTeX",
        "abstract": "Mit dem Textsatzsystem LaTeX kann man einfach und effizient umfangreiche Dokumente erstellen (besonders im wissenschftlichen Kontext). \nIn diesem Workshop möchte ich die wichtigsten Grundlagen für einen einfachen Einstieg in LaTeX vermitteln.",
        "description": "Mit dem Textsatzsystem LaTeX kann man einfach und effizient umfangreiche Dokumente, wie etwa wissenschaftliche Arbeiten, Vortragsfolien, (Serien-)Briefe nach DIN, Musikpartituren und vieles mehr erstellen. Die Auszeichnungssprache erlaubt es, systemübergreifend einheitliche PDF Dateien zu erstellen, die sprachspezifische typografische Regeln und Konventionen einhalten.\nIn diesem Workshop gebe ich euch einen kleinen Rundumschlag, was LaTeX ist, wie es funktioniert und wie man es einsetzen kann. \nVon der Installation aus den Paketquellen, über das erste einfache \"Hallo Welt\" Dokument, hin zu den wichtigsten semantischen Elementen wie Gliederung des Textes durch Überschriften und Absätze, Tabellen, Abbildungen, Fußnoten, Inhaltsverzeichnis, Titelblatt (und ggf. mehr?), sollte für den LaTeX Neueinsteiger alles wichtige dabei sein. Die Handhabung von Fehlern beim Übersetzen der Eingabedatei ins PDF ist ebenfalls Teil des Workshops.",
        "aboutme": "Fachinformatiker für Anwendungsentwicklung und Mediengestalter. Seit 2017 mit der B1 Systems GmbH unterwegs als Trainer & Consultant. Begeistert sich für LaTeX, Blender und Inkscape.",
        "vorwissen": "",
        "urlid": "142-einstieg-in-latex",
        "duration": 110,
        "room": "W2 (A302)",
        "timebegin": "12:00",
        "timeend": "13:50",
        "weblinks": {}
    },
    {
        "name": "Ingo Blechschmidt",
        "titel": "Drei bizarre philosopho-logische Erzählungen zum Auswahlaxiom, vielleicht dem umstrittensten Axiom der Mathematik",
        "abstract": "Manche halten das Auswahlaxiom für offensichtlich wahr, während andere sich durch kein Argument der Welt überzeugen lassen – sie kennen schließlich Gegenbeispiele.\n\nWie kann es in der Mathematik, die doch neutral und objektiv sein soll und in der jede Frage durch eine Rechnung oder einen Beweis entschieden werden kann, so viel Diskussion geben?\n\nIn diesem Vortrag werden wir:\n\n- erfahren, was das Auswahlaxiom eigentlich aussagt,\n- verstehen, warum es so nützlich ist,\n- uns der Gefahr hingeben, die mit der Annahme des Auswahlaxioms einhergehen,\n- uns daran erfreuen, wie man das Axiom in einem Universum namens „Gödels Sandbox“ sicher simulieren kann,\n- und schließlich auf Axiome stoßen, die weniger umstritten sind – aber tatsächlich viel dramatischer und weitreichender.",
        "description": "",
        "aboutme": "Mathematiker aus Augsburg",
        "vorwissen": "",
        "urlid": "141-drei-bizarre-philosopho-logische-erzahlungen-zum-auswahlaxiom-vielleicht-dem-umstrittensten-axiom-der-mathematik",
        "duration": 50,
        "room": "W2 (A302)",
        "timebegin": "15:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Philipp Kammerer",
        "titel": "Leben auf der Kommandozeile; nicht nur für Nerds.",
        "abstract": "Was man so alles an alltäglichen Aufgaben auf der Kommandozeile erledigen kann.",
        "description": "In diesem Workshop möchte ich einige Beispiele zeigen, was man außer „Konfigurationsdateien bearbeiten und `ssh`“ sonst noch so alles auf der Kommandozeile machen kann.\nHier steht die Schlichtheit, Eleganz und der Fokus auf Funktion im Vordergrund.",
        "aboutme": "Fachinformatiker für Anwendungsentwicklung und Mediengestalter. Seit 2017 mit der B1 Systems GmbH unterwegs als Trainer & Consultant. Begeistert sich für LaTeX, Blender und Inkscape.",
        "vorwissen": "",
        "urlid": "143-leben-auf-der-kommandozeile-nicht-nur-fur-nerds",
        "duration": 110,
        "room": "W2 (A302)",
        "timebegin": "16:00",
        "timeend": "17:50",
        "weblinks": {}
    },
    {
        "name": "Dr. Christoph Zimmermann",
        "titel": "Kodi on speed",
        "abstract": "Kodi on speed\n\nSeit dem ersten Release vor über 20 Jahren hat sich Kodi mit über einer Milliarde Installationen einen festen Platz auf der Liste der beliebtesten Home Theater Systeme gesichert. Ursprünglich für die Xbox vorgesehen (daher auch der initiale Name XBMC für Xbox Media Center), ist diese Software mittlerweile auf den meisten Systemen als Bestandteil der Standard-Distribution verfügbar. Ein wesentlicher Aspekt von dieser Software ist die Erweiterbarkeit durch sogenannte Addons für das Look and Feel, Metadatenquellen wie Filmdatenbanken, Video-Erweiterungen (wie z.B. Youtube und Mediatheken) und vieles andere mehr. \n\nAber wie wird eine solche Erweiterung erstellt? Der Vortrag gibt einen Überblick über die Programmierung, Installation und Konfiguration von Addons anhand von Beispielen aus dem praktischen Einsatz.\n\nDieser Beitrag  gliedert sich wie folgt: \n- Architektur von Kodi,\n- Anatomie einer Erweiterung,\n- Programmierung und Installation,\n- Kodis Addon-Umgebung (Konfiguration, Datenbanken, etc.)\n- Fortgeschrittene Aspekte (Systemumgebung, Benutzerdaten-Organisation, etc.),\n- Diskussion.\n\nDer Fokus des Vortrags liegt hierbei auf der Praxis; wenn möglich, werden Code und andere praxisrelevante Artefakte zur Illustration benutzt. Der Vortrag\tstützt sich auf 15 Jahre praktische Erfahrung mit dieser Software sowie Kodi als Fallstudie im Rahmen von Hochschulpraktika zu diesem Thema.",
        "description": "",
        "aboutme": "Graubärtiger FLOSS-Hacker ohne Bart, besessen von Open-Source-Betriebssystemen und anderen Hipster-Themen.\n\nMeine erste Begegnung mit den FLOSS-Technologien war 1987, als ich einen Editor namens Emacs kompilierte. Diese Begegnung hatte einen bleibenden Effekt, so dass ich mich mehr als dreißig Jahre später immer noch mit FLOSS-Ökosystemen, -Technologien und -Gemeinschaften sowohl aus technischer als auch aus gesellschaftlicher und politischer Sicht beschäftige. Ich bin Vorstandsmitglied einer der größten deutschen Linux User Groups und regelmäßiger Referent auf deutschen und internationalen FLOSS-Veranstaltungen. Zusammen mit Martin Visser moderiere ich einen der am schnellsten wachsenden FLOSS-Podcasts namens Linux Inlaws. Zu anderen Hobbies gehören IT-Sicherheit, anderer Leute Computer, alles was mit Software-Entwicklung zu tun hat und andere Formen der schwarzen Kunst :-).",
        "vorwissen": "Python-Grundkenntnisse",
        "urlid": "122-kodi-on-speed",
        "duration": 50,
        "room": "V4 (C118a)",
        "timebegin": "12:00",
        "timeend": "12:50",
        "weblinks": {}
    },
    {
        "name": "Gabriel Wustmann",
        "titel": "Die Postscriptrevolution - eine Retrospektive",
        "abstract": "Eine Rückschau auf die Revolution, die die Programmiersprache [sic!] Postscript, welche 1982 erstmals veröffentlich wurde, ausgelöst hat.",
        "description": "Der Vortag gibt einen Überblick was Postscript ist, warum es eine Programmiersprache ist und was sie leisten kann. Dabei wird ebenso die Revolution im Druckwesen, die die Veröffentlichung ausgelöst hat, betrachtet.\nAbgerundet wird die Retrospektive wie und wo uns heute noch Postscript begegnet.",
        "aboutme": "Seit gut 20 Jahren mit IT beschäftigt und auch dort IT tätig. Nebenbei ein Faible für (technik-)historische IT-Entwicklungen, die zum Teil schon vergessen sind.",
        "vorwissen": "Geometriekenntnisse, rudimentäre Programmiersprachenkenntnis",
        "urlid": "120-die-postscriptrevolution-eine-retrospektive",
        "duration": 50,
        "room": "V4 (C118a)",
        "timebegin": "13:00",
        "timeend": "13:50",
        "weblinks": {}
    },
    {
        "name": "Oliver Bruns",
        "titel": "Einführung in das Buildsystem Bazel",
        "abstract": "[Bazel](https://bazel.build) ist die Reimplementierung von Googles Buildsystem Blaze und als Open-Source [verfügbar](https://github.com/bazelbuild/bazel). Wir schauen uns an was für Bazel spricht und warum - oder warum nicht - man es einsetzen will.",
        "description": "* Kurzüberblick `make`, `ccache`, `distcc`.\n* Kurzüberblick `cmake` und andere Meta-Buildsysteme.\n* Ein einfaches `BUILD` File.\n* Was betrachtet Bazel als Inputs?\n* BzlMod - third-party Dependencies mit Bazel.\n* Alternativen.\n* Linux-Distribution-Maintainer vs. Bazel.\n* Case-Study: Von drei Stunden zu vier Minuten.\n* Was macht Bazel so schnell?",
        "aboutme": "Ich bin Softwareentwickler mit mehr als 10 Jahren Erfahrung in C++ auf Linux. Das Ökosystem der Sprache - Buildtools, statische Analyse, dynamische Analyse, Debugger, Performancetools - waren dabei schon immer im Fokus.",
        "vorwissen": "Wenn du als Entwickler unter langsamen oder nicht reproduzierbaren Builds leidest, wirst du Sinn und Zweck von Bazel schnell schätzen lernen. Vorwissen ist aber nicht erforderlich - der Talk wird die Probleme mit Demos illustrieren.",
        "urlid": "135-einfuhrung-in-das-buildsystem-bazel",
        "duration": 50,
        "room": "V4 (C118a)",
        "timebegin": "14:00",
        "timeend": "14:50",
        "weblinks": {}
    },
    {
        "name": "Andre",
        "titel": "Aufwände schätzen",
        "abstract": "Wer wurde nicht schon einmal gefragt, wie lange etwas oder wie viel Material für jenes Projekt benötigt wird? Manch einer liegt mit seinen Schätzungen erstaunlich richtig, andere eklatant daneben. Dies kann recht teuer und aufwendig werden, wenn der Zeitplan gesprengt wird.\n\nIn dem Vortrag möchte ich euch daher ein paar unkomplizierte Methoden vorstellen, wie man einfach zu relativ guten Werten kommen kann – ganz ohne Magie oder höhere Mathematik.",
        "description": "",
        "aboutme": "Ich nutze Linux seit der Zeit als Textinstaller noch üblich waren. \nUrsprünglich eher Techniker, aber zu den Technikthemen haben sich mit der Zeit immer mehr organisatorische Themen gesellt, die auch ädequat bedient werden müssen.",
        "vorwissen": "",
        "urlid": "150-aufwande-schatzen",
        "duration": 20,
        "room": "V4 (C118a)",
        "timebegin": "15:00",
        "timeend": "15:20",
        "weblinks": {}
    },
    {
        "name": "Bonnie",
        "titel": "Youth Hacking 4 Freedom 2026",
        "abstract": "Du programmierst und tüftelst gerne an Software oder Hardware? Und du bist bereit für eine Herausforderung? Dann ist das \"Youth Hacking 4 Freedom\" der perfekte Wettbewerb, um deine Fähigkeiten zu testen.",
        "description": "Die fünfte Runde des Programmierwettbewerbs \"Youth Hacking 4 Freedom\" steht in den Startlöchern und wir freuen uns darauf Jugendliche aus ganz Europa wieder zu begrüßen. \"Youth Hacking 4 Freedom\" ist ein Programmierwettbewerb für europäische Teenager zwischen 14 und 18 Jahren. Die Teilnehmenden haben die Möglichkeit, unter der Anleitung von Expert*innen aus dem Freien Software Ecosystem an ihrer eigenen Projektidee zu arbeiten. \nFür die Projekte gibt es keine Einschränkungen, solange sie am Ende unter einer Freien Software-Lizenz veröffentlicht werden. In diesem Wettbewerb können junge Leute ihre Fähigkeiten testen, lernen, wie man unter Zeitdruck an einem Projekt arbeitet, und vor allem Spaß haben, während sie verschiedene Leute aus Europa treffen. Natürlich gibt es auch tolle Preise zu gewinnen, bis zu 4096 Euro für den ersten Platz.",
        "aboutme": "Bonnie Mehring hat Politikwissenschaften in Marburg studiert und arbeitet bereits seit über 10 Jahren für und mit Freie Software. Durch Freie Software hat sie nicht nur ein umfangreiches Wissen über Computer und Technologie erworben, sondern auch Verbindungen zu anderen Menschen geknüpft. Sie nimmt gerne an verschiedenen Konferenzen und Veranstaltungen zu Freier Software teil und genießt die Gelegenheit, mit Menschen aus der Freien-Software-Gemeinschaft in Kontakt zu treten. Für Bonnie ist es von größter Bedeutung, dass inklusive und einladende Freie-Software-Gemeinschaften geschaffen werden, die es jedem ermöglichen, sich zu engagieren und zu lernen. Derzeit arbeitet Bonnie als Projektmanagerin bei der Free Software Foundation Europe und verantwortet den jährlichen \"I Love Free Software Day\" sowie den Programmierwettbewerb \"Youth Hacking 4 Freedom\" und ist Host des Software Freedom Podcast.",
        "vorwissen": "",
        "urlid": "104-youth-hacking-4-freedom-2026",
        "duration": 20,
        "room": "V4 (C118a)",
        "timebegin": "15:30",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Uli Kleemann",
        "titel": "In Algorithms we trust - too much?    What if AI fails",
        "abstract": "\"Some people love AI, but others fear it. Why? Is it because of its potential harm to the job market? The way it stretches the barrier between fabrication and reality? Perhaps they saw too many Terminator movies? Whatever the reason, the news media is full of stories that paint glorious pictures of AI’s potential and devastating images of its failures.\"",
        "description": "In Algorithms We Trust - too much?}\nWe believe in the power of the algorithm - the superiority of the machine over the human mind - artificial intelligence. But it doesn't even exist - it's an invention of clever marketing people, and AI is not new either, just as CYBER is not an abbreviation for cybernetics \nfrom the Greek. It is a theory of all dynamic systems. It deals in particular with information processing in dynamic systems and their regulation and control. Cybernetics researches the essential properties of dynamic systems so that they can process the relevant information and the systems can be steered in a targeted manner or steer themselves accordingly \n\\url{https://wirtschaftslexikon.gabler.de/definition/kybernetik-41182}\nand has its origins in the middle of the 20th century.",
        "aboutme": "#57\n#linux User seit 1997\n#zertifizierter Admin seit 2017\n#Selbstdenker\n# Krypto\n# IT-Security",
        "vorwissen": "Grundkenntniss in ML sind hilfreich, jedoch nicht erforderlich.",
        "urlid": "162-in-algorithms-we-trust-too-much-what-if-ai-fails",
        "duration": 50,
        "room": "V4 (C118a)",
        "timebegin": "16:00",
        "timeend": "16:50",
        "weblinks": {}
    },
    {
        "name": "Uli Kleemann",
        "titel": "Krieg ist nicht nur wenn geschossen wird über Cyberwaffen und wie man die herstellen könnte",
        "abstract": "Spätestens seit dem Ukraine-Konfikt aus dem ein Krieg geworden ist dürfte es kein Geheimnis mehr sein der Cyberkrieg ist in vollem Gange. Von Desinformationskampagnen über DDos Angriffe  bis zu \"beschädigten\" Untersee Glasfaserkablen. Angriffe auf kritische Infrastrukturen  sind an der Tagesordnung und dazu gehören nicht nur Kraftwerke  und Verkehrsanlagen alles was erreichbar ist  ist auch ein potentielles Ziel ob nun Bundestag oder Hochschule  nichts und niemand darf sich sicher fühlen.",
        "description": "Krieg, bisher eine teuere Unternehmung ist sehr preiswert geworden. Kosteten bisherige Waffen Millionen - Cyberwaffen kosten fast nichts.\n\nKonnten bisherige Massenvernichtungswaffen über bilaterale Verträge (SALT I und SALT II) begrenzt  werden , so sind Cyberwaffen nicht kontrollierbar. \n\nWar es bisher möglich bestimmte Waffen dem Zugriff beispielweise terroristischer Ogenaisationen zu entziehen, so ist ds bei Cyberwaffen so nicht möglich.\n\nWas ist eine Cyberwaffe überhaupt - was kann sie anrichten- wie liesse sich ihr Einsatz verhindern, wo liegen die Schwierigkeiten bei der Rüstungskontrolle im Cyberdspace u.v.m. versuche ich ich in diesem Talk  zu erläutern.",
        "aboutme": "#57\n#linux User seit 1997\n#zertifizierter Admin seit 2017\n#Selbstdenker\n# Krypto\n# IT-Security",
        "vorwissen": "keines",
        "urlid": "110-krieg-ist-nicht-nur-wenn-geschossen-wird-uber-cyberwaffen-und-wie-man-die-herstellen-konnte",
        "duration": 50,
        "room": "V4 (C118a)",
        "timebegin": "17:00",
        "timeend": "17:50",
        "weblinks": {}
    },
    {
        "name": "Michael Weiss",
        "titel": "Git: Internals, Algorithmen und erweiterte Funktionen (Überblick)",
        "abstract": "Git ist ein weit verbreitetes Hilfswerkzeug mit vielen Einsatzmöglichkeiten. Obwohl wir es meist regelmäßig im Alltag verwenden setzen wir uns selten genauer damit auseinander. Ziel dieses Workshops ist einen Überblick über die Funktionsweise von Git zu vermitteln. Mit dem Verständnis was die jeweilen Befehle machen sollte Git deutlich intuitiver werden und v.a. bei \"Problemen\"/Fehlermeldungen sollte klar werden was das Problem ist und wie es gelöst werden kann.",
        "description": "Wir werden uns zunächst anschauen wie ein Git Repository aufgebaut ist (Internals) und wie Git funktioniert (Algorithmen). Zur Vereinfachung werden wir uns auf das wichtigste konzentrieren und v.a. Performance-Optimierungen weglassen.\n\nIm zweiten Teil werden wir uns darauf aufbauend einen Überblick über die CLI und die \"erweiterte\" Funktionalitäten verschaffen.\n\nAuf Grund der begrenzten Zeit wird es eher ein Vortrag zum mitmachen als ein richtiger Workshop.",
        "aboutme": "Softwareentwickler bzw. Sysadmin bei der science + computing AG in Tübingen (Teil von Atos/Eviden). Früherer NixOS Entwickler. Auf der Tübix seit 2017 im Orgateam (und seit 2016 als Teilnehmer/Speaker).",
        "vorwissen": "Am besten sollte man Git schon verwendet haben und zumindest grob damit vertraut sein. Aus zeitlichen Gründen müssen wir etwas Tempo machen und werden direkt in die Details eintauchen (also z.B. eine Einführung/Motivation zu Versionskontrollsystemen (VCS) überspringen). Die Zielgruppe sind Git Benutzer die mit den Grundlagen der Git CLI vertraut sind und gerne die interne Funktionsweise sowie erweiterte Funktionen erlernen möchten.\n\nWenn man mitmachen will kann man gerne einen eigenen Laptop mit vorinstalliertem Git mitbringen.",
        "urlid": "153-git-internals-algorithmen-und-erweiterte-funktionen-uberblick",
        "duration": 110,
        "room": "W3 (C111)",
        "timebegin": "10:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Yann Büchau",
        "titel": "Praktische Einführung in NixOS",
        "abstract": "NixOS durch Praxisbeispiele kennenlernen",
        "description": "NixOS ist eine fast 20 Jahre bestehende Linux-Distribution mit dem radikal anderen Ansatz, sämtliche Software und Einstellungen des Betriebssystems reproduzierbar in Konfigurationsdateien zu deklarieren. Dazu wird die `nix`-Sprache verwendet, mit der beliebige Software reproduzierbar gebaut werden kann. Das ermöglicht Dinge wie:\n\n- Updates, die durch Unterbrechnung nicht kaputt gehen können\n- Zusammenstellung beliebiger Versionen von Programmen\n- einfaches Konfigurieren auch komplizierter Dienste (z.B. `services.nextcloud.enable = true;`)\n- Testen von Änderungen in VMs (`nixos-rebuild build-vm`)\n- unabhängige Entwicklungsumgebungen für Projekte (`nix-shell -p python git ...`)\n- einfaches Bauen für andere Architekturen (z.B. fertige SD-Karten-Abbilder für Raspberry Pi)\n- und noch viel mehr. \n\nIn diesem Workshop schauen wir uns das in der Praxis an.",
        "aboutme": "",
        "vorwissen": "Laptop mitbringen, möglichst schon versuchen, nix vorher zu installieren (https://nixos.org/download/, oben unter \"Nix\". Geht auf allen Linux-Distributionen und stört das restliche Betriebssystem nicht. Oder man macht sich eine NixOS VM, geht natürlich auch.).\n\nAnsonsten die grundlegenden Linux Dinge, Textdateien bearbeiten, im Terminal arbeiten, bisschen git, etc. sollte beherrscht werden.",
        "urlid": "145-praktische-einfuhrung-in-nixos",
        "duration": 110,
        "room": "W3 (C111)",
        "timebegin": "14:00",
        "timeend": "15:50",
        "weblinks": {}
    }
]