[
    {
        "name": "Tübix Orga Team",
        "titel": "Tübix Init",
        "inhalt": "* Begrüßung\r\n* Infos zum Ablauf des Tages\r\n* Veränderungen zu letztem Jahr\r\n* Änderungen in letzter Minute\r\n* Fragen?",
        "aboutme": "",
        "vorwissen": "",
        "urlid": "tuebix-init",
        "duration": 20,
        "room": "V1",
        "timebegin": "09:30",
        "timeend": "09:50",
        "weblinks": {}
    },
    {
        "name": "Stefan Walter",
        "titel": "Einstieg in Linux Kernel Debugging",
        "inhalt": "Dieser Vortrag soll einen Einstieg in Linux Kernel Debugging bieten.\r\nDanach sollten Teilnehmende prinzipiell in der Lage sein, selbst mit der Thematik zu experimentieren und interaktiv zusammen mit Source-Code den Linux Kernel zu debuggen.",
        "aboutme": "IT Security Consultant bei der SySS GmbH.",
        "vorwissen": "Grundlegende Linux-Kenntnisse, Basis-Erfahrung mit der Kommandozeile",
        "urlid": "8-einstieg-in-linux-kernel-debugging",
        "duration": 50,
        "room": "V1",
        "timebegin": "10:00",
        "timeend": "10:50",
        "weblinks": {}
    },
    {
        "name": "Andreas Grupp & Andi Mundt",
        "titel": "Bildungssysteme nachhaltig digitalisieren",
        "inhalt": "Mit Beginn des ersten Corona-Lockdowns Anfang 2020 waren Schulen schlagartig mit der Problematik konfrontiert, Unterricht auf Distanz zu gestalten. Aus dem Engagement Einzelner entstand in kürzester Zeit eine bislang als für nicht machbar gehaltene Infrastruktur tausender Moodle- und BigBlueButton-Instanzen. Häufig mit schuleigenen Nextcloud-Servern ergänzt, zeigte diese Infrastruktur ihre Tauglichkeit in Pandemiezeiten unter hoher Last – ein Szenario, das bis zu diesem Zeitpunkt ausschließlich proprietären und rechtlich bedenklichen Hyperscalern zugetraut wurde.\r\n\r\nDer Vortrag blickt kurz auf diese bewegte und intensive Zeit zurück, beschreibt das Projekt sowohl von seiner politischen als auch der technischen Seite und zeichnet die Idee konkret weiter in die Zukunft. Welche weiteren zentralen Dienste wären sinnvoll, um Bildung/Schulen zu einer nachhaltigen und datenschutzrechtlich sauberen Kultur der Digitalität zu befähigen? Welches Mindset ist Voraussetzung? Wie könnten Betreibermodelle aussehen? Wäre ein Full-FLOSS-Stack denkbar?",
        "aboutme": "Eigentliche mal was mit Elektrotechnik gelernt. Seit über 25 Jahren Lehrer im beruflichen Schulwesen, Fachberater Unterricht Nachrichtentechnik & Informatik, Lehrkräfte-Fortbildner im Bereich Linux, Rechnernetze, Netzwerksicherheit, Datenschutz, … . Während der Corona-Pandemie zusammen mit einem klitzekleinen Team über 1.000 BigBlueButton-Server mit der Kapazität von über 200.000 simultanen Sessions für Schulen in Baden-Württenberg betrieben.\r\n\r\nMastodon-Account: @angry-ät-social.tchncs.de\n\nPhysiker und Debian-Entwickler, unterwegs im Bildungssystem.",
        "vorwissen": "Keines",
        "urlid": "ldungssysteme-nachhaltig-digitalisieren",
        "duration": 50,
        "room": "V1",
        "timebegin": "12:00",
        "timeend": "12:50",
        "weblinks": {}
    },
    {
        "name": "Frank Hofmann",
        "titel": "So vermittelst du technische Inhalte verständlich",
        "inhalt": "Der Vortrag soll euch helfen, technische Inhalte verständlicher zu machen und euch die Grundlagen zum Schreiben technischer Dokumentationen näher bringen.",
        "aboutme": "Nach dem Informatikstudium begann Frank Hofmann 2002 als Entwickler, Trainer und technischer Redakteur zu arbeiten. So kennt er sich nicht nur bestens mit Linux und Python aus, sondern kann komplexe Vorgänge auch verständlich ausdrücken. Er ist Co-Autor des Debian-Paketmanagement-Buchs (https://dpmb.org) und schreibt regelmäßig  u.a. für das Linux Magazin und Linux Users. Dabei reist er gerne und arbeitet im In- und Ausland.",
        "vorwissen": "",
        "urlid": "43-so-vermittelst-du-technische-inhalte-verstndlich",
        "duration": 50,
        "room": "V1",
        "timebegin": "14:00",
        "timeend": "14:50",
        "weblinks": {}
    },
    {
        "name": "Gerhard Klostermeier",
        "titel": "Hacking von sicheren USB-Sticks und USB-Festplatten",
        "inhalt": "Vertrauliche Daten zu verschlüsseln war schon immer eine gute Idee, insbesondere wenn diese auf kleinen, tragbaren Geräten wie externen Festplatten oder USB-Sticks gespeichert werden. Denn im Falle eines Verlustes oder Diebstahls eines solchen Speichermediums, möchte man ganz sicher sein, dass ein unberechtigter Zugriff auf die vertraulichen Daten nicht möglich ist. Leider werden auch jetzt noch immer  \"sichere\" tragbare Speichermedien mit 256-AES-Hardwareverschlüsselung und manchmal auch zusätzlich mit biometrischer Technologie verkauft, die bei einer genaueren Betrachtung nicht sicher sind.\r\n\r\nIn diesem Vortrag werden Ergebnisse eines Forschungsprojekts zu \"sicheren\" tragbaren Speichermedien präsentiert. Diese Forschungsarbeit setzt die lange Geschichte von unsicheren tragbaren Speichergeräten mit AES-Hardwareverschlüsselung fort, die schon viele Jahre zurückreicht. Im Rahmen dieser Präsentation soll das Bewusstsein für entsprechende Sicherheitsprobleme und für praktische Angriffe hinsichtlich dieser Geräteklasse geschärft werden.",
        "aboutme": "Hallo! Ich bin Gerhard Klostermeier und seit 2014 als Pentester / IT-Security Consultant bei der SySS GmbH in Tübingen tätig. Dort beschäftige ich mich mit der IT-Sicherheit von Embedded Systems. Ich bin begeistert von Hardware-Hacking, IoT Secuirty, Automotive Security, Funktechnologien, RFID/NFC, und natürlich von Linux! (I use Arch, btw ;-)).",
        "vorwissen": "Es ist kein besonders Vorwissen nötig, jedoch ist der Vortrag etwas anspruchsvoller, weil es viel technische Details gibt um alle Angriffe zu verstehen.",
        "urlid": "hacking-von-sicheren-usb-sticks-und-usb-festplatten",
        "duration": 50,
        "room": "V1",
        "timebegin": "15:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Gerhard Klostermeier",
        "titel": "Typische Schwachstellen von Heimnetz-Routern",
        "inhalt": "In diesem Vortrag geht es um IT-Sicherheit von Heimnetz-Routern. Diese Geräte sind heutzutage prinzipiell in jedem Haushalt zu anzutreffen. Dabei wird auf ein paar klassische Probleme eingegangen, aber auch Erkenntnisse aus einer vergangenen Forschungsarbeit vorgestellt. Außerdem gibt es ein paar einfache Tipps, mit denen Anwender die Sicherheit dieser Geräte erhöhen können.",
        "aboutme": "Hallo! Ich bin Gerhard Klostermeier und seit 2014 als Pentester / IT-Security Consultant bei der SySS GmbH in Tübingen tätig. Dort beschäftige ich mich mit der IT-Sicherheit von Embedded Systems. Ich bin begeistert von Hardware-Hacking, IoT Secuirty, Automotive Security, Funktechnologien, RFID/NFC, und natürlich von Linux! (I use Arch, btw ;-)).",
        "vorwissen": "Kein bestimmtes Vorwissen nötig. Der Vortrag sollte für eine recht breite Masse an technikbegeisterten Menschen passen.",
        "urlid": "1-typische-schwachstellen-von-heimnetz-routern",
        "duration": 50,
        "room": "V1",
        "timebegin": "16:00",
        "timeend": "16:50",
        "weblinks": {}
    },
    {
        "name": "Tübix Orga Team",
        "titel": "Tübix Exit",
        "inhalt": "* gemeinsamer Abschluss\r\n* lottery.sh\r\n*Ausblick auf nächstes Jahr",
        "aboutme": "",
        "vorwissen": "",
        "urlid": "tuebix-exit",
        "duration": 20,
        "room": "V1",
        "timebegin": "18:00",
        "timeend": "18:20",
        "weblinks": {}
    },
    {
        "name": "Daniel Kulesz",
        "titel": "Open Source ist für viele Informatik-Studierende ein Mysterium",
        "inhalt": "Anders als man naiverweise glauben könnte fehlt vielen Studierenden der Informatik und verwandter Studiengänge das grundlegende Verständnis von freier Software und Open Source. In diesem Vortrag reflektiere ich über meine Erfahrungen mit diesem Phänomen und diskutiere mögliche Abhilfemaßnahmen.",
        "aboutme": "Professor für Softwareentwicklung und Programmierung an der Technischen Hochschule Würzburg-Schweinfurt und überzeugter Unterstützer freier Software",
        "vorwissen": "",
        "urlid": "41-open-source-ist-fr-viele-informatik-studierende-ein-mysterium",
        "duration": 20,
        "room": "V1",
        "timebegin": "18:30",
        "timeend": "18:50",
        "weblinks": {}
    },
    {
        "name": "Adrian Reber",
        "titel": "Forensic container checkpointing and analysis",
        "inhalt": "With the introduction of \"Forensic Container Checkpointing\" in Kubernetes 1.25 it is possible to checkpoint containers. The ability to checkpoint containers opens up many new use cases. Containers can be migrated without loosing the state of the container, fast startup from existing checkpoints, using spot instances more effective. The primary use case, based on the title of the Kubernetes enhancement proposal, is the forensic analysis of the checkpointed containers. In this session I want to introduce the different possible use cases of \"Forensic Container Checkpointing\" with a focus on how to perform forensic analysis on the checkpointed containers. The presented use cases and especially the forensic analysis will be done as a live demo giving the audience a hands on experience.",
        "aboutme": "Adrian is a Senior Principal Software Engineer at Red Hat and is migrating processes at least since 2010. He started to migrate processes in a high performance computing environment and at some point he migrated so many processes that he got a PhD for that. Most of the time he is now migrating containers but occasionally he still migrates single processes.",
        "vorwissen": "",
        "urlid": "54-forensic-container-checkpointing-and-analysis",
        "duration": 50,
        "room": "V2",
        "timebegin": "11:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Holger Gantikow",
        "titel": "Linux Containers for HPC - 2023 Update",
        "inhalt": "Der Vortrag beantwortet die Frage, wie es aktuell um Container im HPC-Bereich gestellt ist.\r\nSeit Holgers letztem Container@HPC Vortrag hat sich einiges getan - Zeit darueber zu reden ;-)",
        "aboutme": "Holger Gantikow arbeitet als CAE IT-Landscape Architect für Atos/Eviden science + computing in Tübingen.\r\nSeit mehr als einem Jahrzehnt beschäftigt er sich mit der Komplexität von CAE-Berechnungsumgebungen und hilft Kunden aus der Automobilindustrie, das Beste aus ihren Systemen herauszuholen. Von Anfang an war er fasziniert davon, wie die Virtualisierung die IT verändert hat. Heutzutage interessiert er sich vor allem für Container.",
        "vorwissen": "Ein spezielles Vorwissen der Zuhörer wird nicht vorausgesetzt. Interesse an HPC, Virtualisierung, speziell Containern ist sicherlich von Vorteil, um eine rege Diskussion und Erfahrungsaustausch zu gewährleisten.",
        "urlid": "45-linux-containers-for-hpc-2023-update",
        "duration": 50,
        "room": "V2",
        "timebegin": "13:00",
        "timeend": "13:50",
        "weblinks": {}
    },
    {
        "name": "Dr. Christoph Zimmermann",
        "titel": "Neues vom Spielplatz: Kubernetes auf Deinem Smartphone",
        "inhalt": "Mit der Verfügbarkeit von leistungsfähigen Smartphones mit mittlerweile Quad- und Octo-Core Architekturen als gängigem Standard ist ein Deployment von Containern auf dieser Hardware mittlerweile keine Theorie mehr. Der Vortrag stellt am Beispiel der Installation der beliebten Container-Orchestrierungsumgebung Kubernetes auf Android-Basis dar, wie einfach diese durchzuführen ist. \r\n\r\nDer Fokus liegt hierbei nicht auf der Vermittlung von Theorie, sondern auf der Praxis, wie diese Installation durchzuführen und was hierbei zu beachten ist.\r\n\r\nGliederung des Vortrags:\r\n\r\n- Recap Grundlagen Android & Container / k8s\r\n- Installations-Anforderungen \r\n- Installation und Konfiguration\r\n- Demo\r\n- Zusammenfassung & Q&A",
        "aboutme": "Graubärtiger FLOSS-Hacker ohne Bart, besessen von Open-Source-Betriebssystemen und anderen Hipster-Themen.\r\n\r\nMeine erste Begegnung mit den FLOSS-Technologien war 1987, als ich einen Editor namens Emacs kompilierte. Diese Begegnung hatte einen bleibenden Effekt, so dass ich mich mehr als dreißig Jahre später immer noch mit FLOSS-Ökosystemen, -Technologien und -Gemeinschaften sowohl aus technischer als auch aus philosophischer und politischer Sicht beschäftige. Ich bin Vorstandsmitglied einer der größten deutschen Linux User Groups (der Frankfurter LUG) und regelmäßiger Referent auf deutschen und internationalen FLOSS-Veranstaltungen. Zusammen mit Martin Visser moderiere ich einen der am schnellsten wachsenden FLOSS-Podcasts namens Linux Inlaws. In meiner Freizeit bin ich Package Maintainer und Python-Hacker.",
        "vorwissen": "Grundlagen Android, Container & Kubernetes",
        "urlid": "50-neues-vom-spielplatz-kubernetes-auf-deinem-smartphone",
        "duration": 50,
        "room": "V2",
        "timebegin": "14:00",
        "timeend": "14:50",
        "weblinks": {}
    },
    {
        "name": "Gabriel Wustmann",
        "titel": "Docker build Alternativen",
        "inhalt": "Lange Zeit war docker build der bevorzugte Weg ein Containerimage zu erzeugen. Inzwischen gibt es eine ganze Reihe von Tools. Der Vortrag wird ein paar davon vorstellen und den Vergleich zu docker build ziehen.",
        "aboutme": "Technologie Architekt im Umfeld Kubernetes/OpenShift, seit gut 8 Jahren mit dem Thema Container in Berührung/befasst.",
        "vorwissen": "Vorteilhaft wenn man schon mal mit Containervirtualisierung gearbeitet hat. Hilfreich ist auch wenn man schon mal ein docker build ausgeführt und einen selbstgebauten Container ausgeführt hat.",
        "urlid": "42-docker-build-alternativen",
        "duration": 20,
        "room": "V2",
        "timebegin": "15:00",
        "timeend": "15:20",
        "weblinks": {}
    },
    {
        "name": "Finn Rayk Gärtner",
        "titel": "Ordnung im Chaos finden: Microservices Observability",
        "inhalt": "Mit dem Aufstieg von Microservices-Architekturen sind traditionelle Monitoring-Ansätze nicht mehr ausreichend, um die Leistung, Verfügbarkeit und Zuverlässigkeit von verteilten Systeme zu gewährleisten. Die Observability, also die Fähigkeit, Einblicke in das Systemverhalten zu gewinnen, ist von entscheidender Bedeutung, um den Überblick zu behalten und potenzielle Probleme frühzeitig zu erkennen.\r\n\r\nDer Vortrag wird verschiedene Aspekte der Microservices Observability behandeln, darunter das Logging, Tracing, Metriken und Fehlerverfolgung. Es werden bewährte Methoden, Werkzeuge und Techniken vorgestellt, um das Chaos der Microservices zu beherrschen und klare Einblicke in das Systemverhalten zu erhalten.",
        "aboutme": "Ich bin ein Student an der Universät Bonn und beschäftige mich insbesondere mit Systemarchitektur und Microservices.",
        "vorwissen": "Alle benötigten Konzepte werden im Vortrag erklärt.",
        "urlid": "53-ordnung-im-chaos-finden-microservices-observability",
        "duration": 50,
        "room": "V2",
        "timebegin": "16:00",
        "timeend": "16:50",
        "weblinks": {}
    },
    {
        "name": "Michael Jerger",
        "titel": "Embeded Mastodon - Datenschutzfreundliches Marketing & arbeiten an föderierten gitea/forgejo",
        "inhalt": "<h4>aktuelle Probleme</h4>\r\nXing Gruppen einfach gelöscht, toxicTwitter,<br>   \r\nInvest (Community)  ist in fremder Hand.<br>\r\n<br>\r\n<h4>Lösungsvorschläge</h4>\r\nFöderierung - föderiertes gitea/forgejo, Mastodon<br>\r\n<br>\r\n<h4>Erfahrung</h4>\r\n Mastodon - Zuwachs auf 12 mio. (Faktor 60) innerhalb eines Jahr<br>\r\n<br>\r\n<h4>Nutzen</h4>   \r\nInvest bleibt in unserer Hand und nicht beim Konzern<br>\r\n<br>\r\n<h4>Fazit</h4>   \r\nInvest sichern, Mastodon ausprobieren, bei forgejo mithelfen - glücklich und zu \"Frieden\"",
        "aboutme": "<em><strong>Michael Jerger</em></strong> [CEO] ist langjähriger DevOps und unterstützt Kunden bei Ihrem Weg in die Cloud. Im Laufe dieser Arbeit sind viele OpenSource Tools entstanden, die er als Maintainer oder Contributer unterstützt.<br>",
        "vorwissen": "allgemein ;-)\r\n=> keines!",
        "urlid": "6-embeded-mastodon-datenschutzfreundliches-marketing-arbeiten-an-fderierten-gitea-forgejo",
        "duration": 20,
        "room": "V2",
        "timebegin": "17:00",
        "timeend": "17:20",
        "weblinks": {}
    },
    {
        "name": "Christian Heusel",
        "titel": "Howto: Mein erstes Paket im Arch User Repository",
        "inhalt": "**Aktuell umfasst das Arch User Repository stolze 84580 PKGBUILDS! Was aber, wenn genau die Software fehlt, die du gerne nutzen würdest?**\r\n\r\nDieser Vortrag möchte sich damit beschäftigen, welche Schritte notwendig sind, um ein Paket dem AUR hinzuzufügen und das auch direkt mal praktisch veranschaulichen!\r\n\r\nDrum herum gibt es ein buntes Allerlei an nützlichen Tools, Tips aus der Praxis und Infos über die Guidelines, die bei all dem einzuhalten sind.",
        "aboutme": "Aktuell studiere ich in Heidelberg Informatik, habe allerdings meine Wurzeln im schönen Öschingen im Steinlachtal! \r\n\r\nIch bin als Serveradministrator für [meine Fachschaft](github.com/FachschaftMathPhysInfo/) aktiv und seit kurzem auch [Trusted User in Archlinux](https://archlinux.org/people/trusted-users/#gromit). Allgemein entwickle ich sehr gerne [Open Source Software](https://github.com/christian-heusel) 🚀",
        "vorwissen": "",
        "urlid": "13-howto-mein-erstes-paket-im-arch-user-repository",
        "duration": 50,
        "room": "V3",
        "timebegin": "10:00",
        "timeend": "10:50",
        "weblinks": {}
    },
    {
        "name": "Frank Schiebel",
        "titel": "Ein freies Schulnetz!",
        "inhalt": "Der Vortag gibt einen Einblick in die seit mehr als 15 Jahre andauernde Medienentwicklungsplanung eines Gymnasiums in Baden-Württemberg, das konzeptionell einen freien Ansatz bei Mediennutzung und Infrastruktur verfolgt. \r\n\r\nTechnische Bausteine sind freies Wlan mit Freifunk, konsequenter Einsatz von FOSS Software, Betrieb der Schuleigenen Geräte ausschließlich mit Linux auf aus Gründen der Nachhaltigkeit gebraucht beschaffter Harware. \r\n\r\nEin Angebot von (Online-)Werkzeugen für Schüler:inen und Lehrer:innen, ein abgestimmtes Konzept für BYOD sowie das Bestreben, die Rahmenbedingung auch konzeptionell durch die verschiedenen Gremien der Schule curricular zu verankern ergänzen die technischen Aspekte pädagogisch und organisatorisch.",
        "aboutme": "* Lehrer für Mathe/Physik/Informatik/NWT\r\n* Medienentwicklungsplanung  und Betreuung schulischer IT Infrastruktur seit vielen Jahrzehnten - also: alt ;)",
        "vorwissen": "Keines.",
        "urlid": "6-ein-freies-schulnetz-",
        "duration": 50,
        "room": "V3",
        "timebegin": "11:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Roland Imme",
        "titel": "Kamerawagen für H0-Modelleisenbahn mit Linux",
        "inhalt": "Bei diesem Vortrag wird eine Kamerawagen vorgestellt. Die Ansteuerung der Kamera wird mit Linux vorgenommen. Zu diesem Zweck wird ein Raspberry Pi Zero 2 verwendet.",
        "aboutme": "Rechner seit 1993\r\nLinux seit 2001\r\nLaTeX seit 2011\r\nVon 2001 bis 2006 Support bei H+BEDV\r\nVon 2006 bis 2007 Produkttrainer bei Bitdefender\r\nVon 2008 bis 2022 Technical Consultant und Technical Sales Engineer bei Kaspersky Labs GmbH \r\nVon 2023 bis heute Mitarbeiter bei DATEV e.G.\r\nHobbies: Unternehmungen mit der Familie, Gentoo, LaTeX, Fahrrad, Badminton und Modelleisenbahn",
        "vorwissen": "Dank des geänderten Freizeitverhaltens in den vergangenen zwei Jahren habe ich meine Modelleisenbahn im Maßstab 1:87 wiederentdeckt. In diesem Zusammenhang habe ich 2021 ein paar kurze Videos angefertigt. Diese wurden mit einem Handy oder dem Fotoapparat meines Sohnes erstellt.\r\nAus dieser Situation kam meinem Sohn der Gedanke, dass man einen Kamerawagen baut, der mit einem Raspberry Pi Zero 2 verwaltet wird. Auch die weitere Verarbeitung der Videos wird mit einem auf Linux basierenden Laptop umgesetzt. Das Fahrgestell wurde im 3D-Druck-Verfahren hergestellt. Dabei kommt auch wieder ein Raspberry Pi zum Einsatz.\r\nDer Vortrag soll die möglichen Stolpersteine und deren Lösung dieses „Projektes“ vorstellen.  \r\nEs sind keine speziellen Vorkenntnisse erforderlich. Es handelt sich um einen Vortrag, der 2 Welten etwas näher bringt. Es werden mögliche Verknüpfungen zwischen Modelleisenbahn und Linux vorgestellt.",
        "urlid": "4-kamerawagen-fr-h0-modelleisenbahn-mit-linux",
        "duration": 50,
        "room": "V3",
        "timebegin": "12:00",
        "timeend": "12:50",
        "weblinks": {}
    },
    {
        "name": "Gerhard Klostermeier",
        "titel": "Hacking eines Funkthermostats",
        "inhalt": "Mit einer kurzen Suche im Internet findet man schnell viele günstige Lösungen, um Heizkörper intelligent zu steuern. Häufig nutzen solche Geräte auch proprietäre Funkverbindungen, mittels der die Zentrale dem Befehl zum ein- oder ausschalten des Heizkörpers gibt.\r\n\r\nIn diesem Vortrag wollen wir uns die Sicherheit einer solchen Funkverbindung anschauen. Dabei setzten wir Software Defined Radios (SDRs) mit gängigen Linux-Tools (GNU Radio, Universal Radio Hacker, etc.) ein.",
        "aboutme": "Hallo! Ich bin Gerhard Klostermeier und seit 2014 als Pentester / IT-Security Consultant bei der SySS GmbH in Tübingen tätig. Dort beschäftige ich mich mit der IT-Sicherheit von Embedded Systems. Ich bin begeistert von Hardware-Hacking, IoT Secuirty, Automotive Security, Funktechnologien, RFID/NFC, und natürlich von Linux! (I use Arch, btw ;-)).",
        "vorwissen": "Kein Vorwissen nötig. Der gezeigte Angriff ist trivial zu verstehen (Replay-Attack). Im Vordergrund steht eher die Arbeitsweise und (kurze) Einführung in verwendeten Tools.",
        "urlid": "hacking-eines-funkthermostats",
        "duration": 20,
        "room": "V3",
        "timebegin": "14:30",
        "timeend": "14:50",
        "weblinks": {}
    },
    {
        "name": "Lukas Kallies",
        "titel": "Vom Leben und Sterben einer Software",
        "inhalt": "Eine IT-Umgebungen benötigt Software und diese muss konfiguriert werden. Im einfachsten Fall wird die Software auf ein System kopiert und eine Konfigurationsdatei angepasst. In komplexeren Umgebungen kommen unterschiedliche Versionen, Abhängigkeiten und Unterscheidungen in der Konfiguration vor.\r\nDer Vortrag geht auf einige mögliche Wege der Software-, Aktualisierungs- und Konfigurationsverteilung ein. Hierbei wird auch die Frage nach der Relevanz von klassischer Softwareverteilung gestellt.",
        "aboutme": "Working at Puzzle ITC mainly on Open Source, Lifecycle and Configurationmanagement topics.",
        "vorwissen": "",
        "urlid": "9-vom-leben-und-sterben-einer-software",
        "duration": 20,
        "room": "V3",
        "timebegin": "15:00",
        "timeend": "15:20",
        "weblinks": {}
    },
    {
        "name": "Yann Büchau",
        "titel": "PlainTextAccounting mit hledger",
        "inhalt": "Du willst den Überblick über Deine Finanzen behalten, aber die Programme sind Dir zu unflexibel? Plaintextaccounting mit hledger kann helfen.",
        "aboutme": "Doktorand Umweltphysik Uni Tübingen, liebt freie Software",
        "vorwissen": "",
        "urlid": "16-plaintextaccounting-mit-hledger",
        "duration": 5,
        "room": "V3",
        "timebegin": "15:35",
        "timeend": "15:40",
        "weblinks": {}
    },
    {
        "name": "Stefan Baur",
        "titel": "Das Grannophone - ein Videotelefon für Senioren und Demenzpatienten",
        "inhalt": "Ältere Menschen sind mit der Bedienung komplexer Technik wie Smartphones und PCs schnell überfordert. Ein Videotelefon, das sich in der Bedienung an ein klassisches Telefon anlehnt, wird hoffentlich leichter akzeptiert.",
        "aboutme": "Stefan Baur, Jahrgang 1977, ist der aktuelle Projektmanager und Lead Evangelist des Open-Source-Projekts X2Go und geschäftsführender Gesellschafter der BAUR-ITCS UG (haftungsbeschränkt), welche Support für X2Go und eine auf X2Go basierende Security-Lösung anbietet, sowie der 1. Vorsitzende der Open Remote Computing Association - orca e.V., einem Dachverein für freie Remote-Computing-Projekte. Nebenbei bastelt er noch an seinem privaten Projekt \"Grannophone\" - einem Open-Source-Videotelefon für Senioren.",
        "vorwissen": "Keines",
        "urlid": "47-das-grannophone-ein-videotelefon-fr-senioren-und-demenzpatienten",
        "duration": 5,
        "room": "V3",
        "timebegin": "15:40",
        "timeend": "15:45",
        "weblinks": {}
    },
    {
        "name": "Cornelius Kölbel",
        "titel": "Kaputte Authentifizierung",
        "inhalt": "Authentication fail compilation",
        "aboutme": "Cornelius beschäftigt sich seit 2004 mit Multifaktor-Authentifizierung. \r\nEr ist der Projektleiter des MFA-Systems privacyIDEA.",
        "vorwissen": "",
        "urlid": "55-kaputte-authentifizierung",
        "duration": 5,
        "room": "V3",
        "timebegin": "15:45",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Matthias Beyer",
        "titel": "Was ist eigentlich dieses Mastodon?",
        "inhalt": "Mastodon ist inzwischen den meisten ein Begriff. Aber was ist das eigentlich?",
        "aboutme": "Matthias ist (Rust) Software Engineer und freiberuflicher Software-Consultant.",
        "vorwissen": "",
        "urlid": "9-was-ist-eigentlich-dieses-mastodon-",
        "duration": 5,
        "room": "V3",
        "timebegin": "15:50",
        "timeend": "15:55",
        "weblinks": {}
    },
    {
        "name": "Matthias Beyer",
        "titel": "zellij - tmux on steroids",
        "inhalt": "\"zellij\" ist tmux neu gedacht. Warum brauchts das?",
        "aboutme": "Matthias ist (Rust) Software Engineer und freiberuflicher Software-Consultant.",
        "vorwissen": "Was tmux ist.",
        "urlid": "8-zellij-tmux-on-steroids",
        "duration": 5,
        "room": "V3",
        "timebegin": "15:55",
        "timeend": "16:00",
        "weblinks": {}
    },
    {
        "name": "",
        "titel": "Blitzvorträge",
        "inhalt": "Weitere Blitzvorträge a 5 Minuten",
        "aboutme": "",
        "vorwissen": "",
        "urlid": "78-blitzvortrge",
        "duration": 30,
        "room": "V3",
        "timebegin": "16:00",
        "timeend": "16:30",
        "weblinks": {}
    },
    {
        "name": "Matthias Beyer",
        "titel": "101 coole Kommandozeilen-Werkzeuge",
        "inhalt": "101 CLI Werkzeuge die jeder gepflegte Nerd kennen sollte",
        "aboutme": "Matthias ist (Rust) Software Engineer und freiberuflicher Software-Consultant.",
        "vorwissen": "Talk Audience sind ganz klar Linux Commandline User",
        "urlid": "18-101-coole-kommandozeilen-werkzeuge",
        "duration": 50,
        "room": "V3",
        "timebegin": "16:30",
        "timeend": "17:20",
        "weblinks": {}
    },
    {
        "name": "Harald König",
        "titel": "Basteleien: Vom Shell-Skript zum TuX dem Wafer und LED-Lauflicht",
        "inhalt": "Wie so oft begann alles mit einem (fast;) einzeiligen Shell-Skript: ich wurde gefragt, wie man beliebige Bilder in DXF konvertieren kann für einen sehr speziellen \"Drucker\", welcher mit Zinnkügelchen auf Silizium-Wafern druckt (für Muster von BGA-Chips)...",
        "aboutme": "Physik-Studium in Tübingen,\r\nRechner und DCF77 seit ~1980,\r\n(La)TeX seit 1986,\r\nUNIX seit ~1987,\r\nLinux seit 1992 (0.98.4),\r\nXFree86-Treiber fuer S3 von ~1993-2001.\r\nVon 2001 bis 2014 bei der science+computing ag in Tuebingen als SW-Entwickler.\r\nSeit 2014 nun bei Bosch Sensortec GmbH in Kusterdingen/Reutlingen als \"System Expert\" fuer Linux (DevOps) und embedded Android (Treiber).\r\n\r\nWeitere Interessen sind u.a. Kernel, System-Technik und -Tools, Hardware, Grafik (-Treiber,-HW), Virtualisierung (v.a. XEN und ein bissl KVM), neuerdings mal wieder Embedded-Systeme und Messtechnik, GPS und OpenStreetmap, u.v.a.m.....",
        "vorwissen": "kein Vorwissen erforderlich -- einfach Spass haben an Technik & Basteleien",
        "urlid": "52-basteleien-vom-shell-skript-zum-tux-dem-wafer-und-led-lauflicht",
        "duration": 50,
        "room": "V4",
        "timebegin": "10:00",
        "timeend": "10:50",
        "weblinks": {}
    },
    {
        "name": "Stefan Baur & Mihai Moldovan",
        "titel": "X2Go Remote Desktops/Remote Applications - was bringt das neue Release? KDrive!",
        "inhalt": "X2Go ist eine Open-Source-Remote-Desktop-/Remote-Application-Services-Lösung. Sie basiert auf den GPL-NX-V3-Libraries der Firma NoMachine, auf denen auch FreeNX und NeatX basier(t)en. Zusätzlich bringt X2Go mit dem neuen Release sein eigenes, neues Protokoll \"KDrive\" mit.",
        "aboutme": "Stefan Baur, Jahrgang 1977, ist der aktuelle Projektmanager und Lead Evangelist des Open-Source-Projekts X2Go und geschäftsführender Gesellschafter der BAUR-ITCS UG (haftungsbeschränkt), welche Support für X2Go und eine auf X2Go basierende Security-Lösung anbietet, sowie der 1. Vorsitzende der Open Remote Computing Association - orca e.V., einem Dachverein für freie Remote-Computing-Projekte. Nebenbei bastelt er noch an seinem privaten Projekt \"Grannophone\" - einem Open-Source-Videotelefon für Senioren.\n\nSoftwareentwickler für das X2Go-Projekt.",
        "vorwissen": "Schon mal von X2Go gehört zu haben und es vielleicht auch schon mal installiert zu haben, wäre hilfreich. Wir werden im Vortrag zwar auch kurz erklären, was X2Go überhaupt ist, aber komplett ohne Vorkenntnisse wird es gegebenenfalls schwer.",
        "urlid": "46-x2go-remote-desktops-remote-applications-was-bringt-das-neue-release-kdrive-",
        "duration": 20,
        "room": "V4",
        "timebegin": "11:30",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Werner Heuser",
        "titel": "LPI Exam 701: DevOps Tools Engineer",
        "inhalt": "Der Vortrag beschreibt, wie man sich auf das LPI Exam 701: DevOps Tools Engineer vorbereiten kann.",
        "aboutme": "Werner Heuser studierte Verwaltungswissenschaft an der Verwaltungsfachhochschule Duisburg. Nach Abschluss des Studiums arbeitete er im Kulturamt der Stadt Duisburg und in der Verwaltung verschiedener Krankenhäuser in Berlin. Es folgten einige Jahre als Softwareberater für Personalabrechnungssysteme. 1997 startete er ein Webportal mit Informationen zu Linux mit mobilen Computern. Ab 1999 verkaufte er Laptops, Notebooks und PDAs mit vorinstalliertem Linux. Seit 2015 arbeitet er als freiberuflicher Dozent für Themen aus dem Bereich Linux. Sein Spezialgebiet als LPI Certified Trainer - LCT sind Kurse zur Vorbereitung auf die Prüfungen des Linux-Professional-Institute (LPI). Nach einem kurzen Umweg über SuSE Linux ist er seit der Version 2.0 Hamm bei Debian GNU/Linux geblieben. Seine persönliche \"Powershell\" heisst zsh.",
        "vorwissen": "Es sind keine Vorkenntnisse erforderlich.",
        "urlid": "7-lpi-exam-701-devops-tools-engineer",
        "duration": 20,
        "room": "V4",
        "timebegin": "12:00",
        "timeend": "12:20",
        "weblinks": {}
    },
    {
        "name": "Yann Büchau",
        "titel": "Prozedurales 3D-Design mit OpenSCAD und Python-SDF",
        "inhalt": "3D-Design muss nicht mit KlickiBunti sein, grade bei parametrisierbaren Designs bietet sich das Code-orientierte Gestalten an. Hier stelle ich dazu OpenSCAD und Python-SDF vor.",
        "aboutme": "Doktorand Umweltphysik Uni Tübingen, liebt freie Software",
        "vorwissen": "",
        "urlid": "15-prozedurales-3d-design-mit-openscad-und-python-sdf",
        "duration": 20,
        "room": "V4",
        "timebegin": "12:30",
        "timeend": "12:50",
        "weblinks": {}
    },
    {
        "name": "Yann Büchau",
        "titel": "Git Annex: Dateien synchronisieren, sichern und verwalten für Poweruser",
        "inhalt": "Git Annex ist das ultimative Werkzeug zum Verwalten, Synchronisieren und Sichern von Dateien - seien es Forschungsdaten, persönliche Dokumente oder eine Mediensammlung. In diesem Workshop wollen wir lernen, was Git Annex uns dabei an Arbeit und Sorgen abnehmen kann.",
        "aboutme": "Doktorand Umweltphysik Uni Tübingen, liebt freie Software",
        "vorwissen": "- Kommandozeilenerfahrung erforderlich\r\n- git-Kenntnisse sehr empfehlenswert\r\n- Wenn ihr Euch Git Annex schon installiert habt, können wir gleich loslegen.",
        "urlid": "5-git-annex-dateien-synchronisieren-sichern-und-verwalten-fr-poweruser",
        "duration": 110,
        "room": "W1",
        "timebegin": "10:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Mike Sperber",
        "titel": "Blitz-Einführung in die funktionale Programmierung",
        "inhalt": "Funktionale Programmierung bringt eine Reihe von Vorteilen gegenüber der traditionellen objektorientierten Entwicklung mit: kürzere und zuverlässige Programme, deklarative Programmierung, Kombinatormodelle, algebraische Abstraktionen, eingebettete domänenspezifischen Sprachen.",
        "aboutme": "Dr. Michael Sperber ist Geschäftsführer der Active Group GmbH.  Er ist international anerkannter Experte für funktionale Programmierung und hat zahlreiche Fachartikel und Bücher zum Thema verfasst.  Michael Sperber ist Mitbegründer des Blogs funktionale-programmierung.de und Mitorganisator der Entwicklerkonferenz BOB.",
        "vorwissen": "Ist ist kein Vorwissen erforderlich, noch nicht einmal im Programmieren.",
        "urlid": "40-blitz-einfhrung-in-die-funktionale-programmierung",
        "duration": 110,
        "room": "W1",
        "timebegin": "12:00",
        "timeend": "13:50",
        "weblinks": {}
    },
    {
        "name": "Philipp Kammerer",
        "titel": "LaTeX für Einsteiger",
        "inhalt": "Mit dem Textsatzsystem LaTeX kann man einfach und effizient umfangreiche Dokumente, wie etwa wissenschaftliche Arbeiten, Vortragsfolien, (Serien-)Briefe nach DIN, Musikpartituren und vieles mehr  erstellen. Die Auszeichnungssprache erlaubt es, systemübergreifend einheitliche PDF Dateien zu erstellen, die sprachspezifische typografische Regeln und Konventionen einhalten.\r\nIn diesem Workshop gebe ich euch einen kleinen Rundumschlag, was LaTeX ist, wie es funktioniert und wie man es einsetzen kann. \r\nVon der Installation aus den Paketquellen, über das erste einfache \"Hallo Welt\" Dokument, hin zu den wichtigsten semantischen Elementen wie Gliederung des Textes durch Überschriften und Absätze, Tabellen, Abbildungen, Fußnoten, Inhaltsverzeichnis, Titelblatt (und ggf. mehr?), sollte für den LaTeX Neueinsteiger alles wichtige dabei sein. Die Handhabung von Fehlern beim Übersetzen der Eingabedatei ins PDF ist ebenfalls Teil des Workshops.",
        "aboutme": "Fachinformatiker für Anwendungsentwicklung und Mediengestalter. Seit 2017 mit der B1 Systems GmbH unterwegs als Trainer & Consultant. Begeistert sich für LaTeX, Blender und Inkscape.",
        "vorwissen": "",
        "urlid": "latex-fr-einsteiger",
        "duration": 110,
        "room": "W1",
        "timebegin": "14:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Harald König",
        "titel": "Same Procedure as Every Year: Kommandozeilen-Sprechstunde(n)",
        "inhalt": "Was ich schon immer auf der Kommandozeile mit der BASH lösen wollte...\r\nIhr fragt, ich erzähle und skripte.\r\n\r\nEure Vorschläge & Fragen bitte möglichst vorab an koenig (at) linux.de -- danke!",
        "aboutme": "Physik-Studium in Tübingen,\r\nRechner und DCF77 seit ~1980,\r\n(La)TeX seit 1986,\r\nUNIX seit ~1987,\r\nLinux seit 1992 (0.98.4),\r\nXFree86-Treiber fuer S3 von ~1993-2001.\r\nVon 2001 bis 2014 bei der science+computing ag in Tuebingen als SW-Entwickler.\r\nSeit 2014 nun bei Bosch Sensortec GmbH in Kusterdingen/Reutlingen als \"System Expert\" fuer Linux (DevOps) und embedded Android (Treiber).\r\n\r\nWeitere Interessen sind u.a. Kernel, System-Technik und -Tools, Hardware, Grafik (-Treiber,-HW), Virtualisierung (v.a. XEN und ein bissl KVM), neuerdings mal wieder Embedded-Systeme und Messtechnik, GPS und OpenStreetmap, u.v.a.m.....",
        "vorwissen": "kein Vorwissen erforderlich -- nur Interesse an der Kommandozeile & ihrer vielen Tools",
        "urlid": "48-same-procedure-as-every-year-kommandozeilen-sprechstunde-n-",
        "duration": 110,
        "room": "W1",
        "timebegin": "16:00",
        "timeend": "17:50",
        "weblinks": {}
    }
]