[
    {
        "name": "Tübix Orga Team",
        "titel": "Tübix init",
        "abstract": "* Begrüßung\n* Infos zum Ablauf des Tages\n* Veränderungen zu letztem Jahr\n* Änderungen in letzter Minute\n* Fragen?",
        "description": "",
        "aboutme": "",
        "vorwissen": "",
        "urlid": "tuebix-init",
        "duration": 20,
        "room": "V1 (F119)",
        "timebegin": "09:30",
        "timeend": "09:50",
        "weblinks": {}
    },
    {
        "name": "Christian Heusel",
        "titel": "Bisecting Regressions in the Linux Kernel",
        "abstract": "Was wenn nach dem Update die Hard- oder Sofware verrückt spielt, vorher aber noch alles in Ordnung war?! Dieser Vortrag beschäftigt sich damit, wie man Regressions im Linux Kernel bisected.",
        "description": "Ich hatte jüngst beim Test des ersten Release Candidates für Linux 6.8 eine kleine Regression bemerkt und sie dann gedebuggt und gemeldet.\n\nIm Vortrag geht es grob um das folgende:\n1. Wie erkenne ich eine Regression?\n2. Wie debugge/bisecte ich den Bug?\n3. Wie und wohin schreibe ich den Bugreport?\n4. Wer kümmert sich denn wann um die Regression?\n\nHier drei beispielhafte Bugreports:\n- https://bugzilla.kernel.org/show_bug.cgi?id=218407\n- https://lore.kernel.org/all/3iccc6vjl5gminut3lvpl4va2lbnsgku5ei2d7ylftoofy3n2v@gcfdvtsq6dx2/\n- https://gitlab.archlinux.org/archlinux/packaging/packages/linux/-/issues/56",
        "aboutme": "Informatikstudent an der Universität Heidelberg und Arch Linux Package Maintainer, Bug Wrangler & DevOps-Team.\n\nQuatscht mich gerne einfach so an, auch wenn wir uns bisher noch nicht kennen! 🤗\n\nGithub: https://github.com/christian-heusel",
        "vorwissen": "- git\n- Kommandozeilenfähigkeiten",
        "urlid": "72-bisecting-regressions-in-the-linux-kernel",
        "duration": 20,
        "room": "V1 (F119)",
        "timebegin": "10:00",
        "timeend": "10:20",
        "weblinks": {}
    },
    {
        "name": "Olaf Flebbe",
        "titel": "Fledermäuse oder C neu entdeckt",
        "abstract": "Aufbau eines Selbstbau Fledermausdetektors auf Basis rp2040 mit Spektrogramm und Datenlogger.\n\nWie ich die Programmiersprache C wiederentdeckte für die Firmware: DMA, SDIO, SPI, Multicore und Signalverarbeitung. \n\n* Schaltung\n* Signalverarbeitung\n* neuere C Sprachfeatures\n* Wie Fledermäuse rufen\n* Interpretation von Spektrogrammen\n* Enthält keine Pinguine aber jede Menge Open Source",
        "description": "",
        "aboutme": "Jo mei",
        "vorwissen": "",
        "urlid": "75-fledermuse-oder-c-neu-entdeckt",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "10:30",
        "timeend": "11:20",
        "weblinks": {}
    },
    {
        "name": "Holger Gantikow",
        "titel": "High Performance Computing - was ist das eigentlich?",
        "abstract": "Der Vortrag gibt einen Einblick in die Welt des High Performance Computings (HPC), beschreibt Einsatzzwecke, grundlegende Architekturen, warum früher alles anders war, wie es mit Linux in diesem Umfeld aussieht und wohin die Reise wohl gehen wird.",
        "description": "",
        "aboutme": "Holger Gantikow arbeitet als IT-Landscape Architect für Atos/Eviden science + computing in Tübingen.\nSeit knapp 15 Jahren beschäftigt er sich dort mit der Komplexität von CAE-Berechnungsumgebungen und hilft Kunden aus der Automobilindustrie, das Beste aus ihren Systemen herauszuholen. Von Anfang an war er fasziniert davon, wie die Virtualisierung die IT verändert hat. Heutzutage interessiert er sich vor allem für Container.",
        "vorwissen": "Ein spezielles Vorwissen der Zuhörenden wird nicht vorausgesetzt. \nInteresse an Technik ist sicherlich von Vorteil, auch wenn dieser Vortrag gar nicht so in die Tiefe gehen soll.",
        "urlid": "88-high-performance-computing-was-ist-das-eigentlich-",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "12:00",
        "timeend": "12:50",
        "weblinks": {}
    },
    {
        "name": "Holger Gantikow",
        "titel": "Linux Containers im High Performance Computing - 2024 Update",
        "abstract": "Der Vortrag beantwortet die Frage, wie es aktuell um Container im HPC-Bereich mit Fokus auf Automotive gestellt ist, warum man das eigentlich haben möchte und welche Themen hier die nächste Zeit wichtiger werden.",
        "description": "Vorwissen\nEin spezielles Vorwissen der Zuhörenden wird nicht vorausgesetzt. Interesse an HPC, Virtualisierung, speziell Containern ist sicherlich von Vorteil, um eine rege Diskussion und Erfahrungsaustausch zu gewährleisten.",
        "aboutme": "Holger Gantikow arbeitet als IT-Landscape Architect für Atos/Eviden science + computing in Tübingen.\nSeit knapp 15 Jahren beschäftigt er sich dort mit der Komplexität von CAE-Berechnungsumgebungen und hilft Kunden aus der Automobilindustrie, das Beste aus ihren Systemen herauszuholen. Von Anfang an war er fasziniert davon, wie die Virtualisierung die IT verändert hat. Heutzutage interessiert er sich vor allem für Container.",
        "vorwissen": "Ein spezielles Vorwissen der Zuhörer wird nicht vorausgesetzt. Interesse an HPC, Virtualisierung, speziell Containern ist sicherlich von Vorteil, um eine rege Diskussion und Erfahrungsaustausch zu gewährleisten.",
        "urlid": "87-linux-containers-im-high-performance-computing-2024-update",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "13:30",
        "timeend": "14:20",
        "weblinks": {}
    },
    {
        "name": "Kai Uwe Broulik",
        "titel": "Plasma 6.0 – Was ist neu?",
        "abstract": "Am 28. Februar 2024 veröffentlichte die KDE Community die neue Major-Version der beliebten Desktop-Umgebung: Plasma 6",
        "description": "In diesem Vortrag werde ich KDE Plasma 6 vorstellen, was sich mit der neuen Version ändert, aber auch, warum man sich in der neuen Version dennoch sofort heimisch fühlen wird.\n\nPlasma 6 ist eine konsequente Weiterentwicklung von Plasma 5.27 und bringt vor allem wichtige Verbesserungen unter der Haube, ohne jedoch gewohnte Bedien-Paradigmen zu brechen. Plasma 5 hat ein Jahrzehnt lang treue Dienste geleistet und die neue Major-Version macht die Plattform fit für das nächste. Und auch der Desktop Cube ist zurück!",
        "aboutme": "Kai Uwe Broulik ist seit 2011 Entwickler in der KDE Community. Beim Plasma Desktop betreut er insbesondere das Benachrichtigungssystem und die Browser-Integration. Mit seiner Qt-Erfahrung, dem Toolkit hinter KDE, hat er bereits Projekte auf Mobilplattformen, Desktops sowe im Automobil- und Embedded-Bereich umgesetzt.",
        "vorwissen": "",
        "urlid": "65-plasma-6-0-was-ist-neu-",
        "duration": 20,
        "room": "V1 (F119)",
        "timebegin": "14:30",
        "timeend": "14:50",
        "weblinks": {}
    },
    {
        "name": "Roland Fehrenbacher",
        "titel": "100% Open Source Full Stack Cluster Management with Qlustar",
        "abstract": "Setting up and operating HPC, AI or storage clusters remains a\nchallenge. Individual software packages are freely available for many\nareas, however an integrated open-source solution covering all aspects\nof cluster management is needed to handle the ever growing complexity.\nAs a mature Cluster OS, Qlustar fills this gap. It includes scalable\nboot/image technology coupled with powerful management software to\nallow precise configuration of cluster components as well as their\nefficient operation.\n\nThis presentation will give an introductory overview of Qlustar and\nits use cases. Special focus is put on the new dramatically\nsimplified Qlustar HA stack that allows to set up highly-available\nclusters with much less effort than traditional solutions.",
        "description": "",
        "aboutme": "Roland is the founder and CEO of Q-Leap Networks. He created the\nQlustar Cluster OS in 2012 and is the main driving force behind its\ndevelopment. Based on Qlustar, he designs and implements HPC, AI and\nstorage clusters for Q-Leap customers. Some of his spare time, he spends on\ncontributions to the Debian HPC and DebianMed projects in his role as\nan active Debian developer.",
        "vorwissen": "",
        "urlid": "90-100-open-source-full-stack-cluster-management-with-qlustar",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "15:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Mike Sperber",
        "titel": "Besser Programmieren mit Mathematik",
        "abstract": "Die Menschheit hat die Mathematik entwickelt, um die Welt zu verstehen.  Entsprechend nützlich kann sie für die Softwareentwicklung sein.  Dabei geht es nicht bloß ums \"Rechnen\"; Mathematik kann auch ein mächtiges Werkzeug bei der Domänenmodellierung sein.",
        "description": "In diesem Vortrag schauen wir uns an, was Algebra und Logik zur Programmierung beitragen können. Sie helfen dabei, die Essenz komplexer Probleme zu extrahieren und bringend Ordnung und Eleganz auch in chaotische Domänen.  Die entstehenden Modelle sind einfach, erweiterbar und antizipieren auch zukünftige Anforderungen.  Kompliziert ist das ganze nicht und erfordert auch kein Spezialstudium: Eine kleine Handvoll mathematischer Konzepte reichen schon aus, um bei vielen Problemen eine Menge herauszuholen.  Das geht natürlich am besten in Kombination mit funktionaler Programmierung, aber auch OO-Software kann profitieren.",
        "aboutme": "Dr. Michael Sperber ist Geschäftsführer der Active Group GmbH.  Er ist international anerkannter Experte für funktionale Programmierung und hat zahlreiche Fachartikel und Bücher zum Thema verfasst.  Michael Sperber ist Mitbegründer des Blogs funktionale-programmierung.de und Mitorganisator der Entwicklerkonferenz BOB.",
        "vorwissen": "Man sollte schonmal was programmiert haben.",
        "urlid": "67-besser-programmieren-mit-mathematik",
        "duration": 50,
        "room": "V1 (F119)",
        "timebegin": "16:00",
        "timeend": "16:50",
        "weblinks": {}
    },
    {
        "name": "Tübix Orga Team",
        "titel": "Tübix exit",
        "abstract": "* gemeinsamer Abschluss\n* lottery.sh\n* Ausblick auf nächstes Jahr",
        "description": "",
        "aboutme": "",
        "vorwissen": "",
        "urlid": "tuebix-exit",
        "duration": 20,
        "room": "V1 (F119)",
        "timebegin": "17:00",
        "timeend": "17:20",
        "weblinks": {}
    },
    {
        "name": "Harald König",
        "titel": "Hacker Jeopardy für alle",
        "abstract": "Wer kennt es nicht: das Hacker Jeopardy. Der Spaß für die ganze Familie, von klein bis groß, von nüchtern bis...  \n\nDieses Mal findet das große Infotainment-Ereignis auch ein Zuhause beim .Tübix",
        "description": "",
        "aboutme": "Physik-Studium in Tübingen,\nRechner und DCF77 seit ~1980, (La)TeX seit 1986,\nUNIX seit ~1987,\nLinux seit 1992 (0.98.4),\nXFree86-Treiber fuer S3 von ~1993-2001.\nVon 2001 bis 2014 bei der science+computing ag in Tuebingen als SW-Entwickler.\nSeit 2014 nun bei Bosch Sensortec GmbH in Kusterdingen/Reutlingen als “System Expert” fuer Linux (DevOps) und embedded Android (Treiber).\n\nWeitere Interessen sind u.a. Reisen, Kernel, System-Technik und -Tools, Hardware, Grafik (-Treiber,-HW), neuerdings mal wieder Embedded-Systeme und Messtechnik, GPS und OpenStreetmap, u.v.a.m…..",
        "vorwissen": "",
        "urlid": "79-hacker-jeopardy-fr-alle",
        "duration": 110,
        "room": "V1 (F119)",
        "timebegin": "17:30",
        "timeend": "19:20",
        "weblinks": {}
    },
    {
        "name": "Torsten Kockler",
        "titel": "Einführung in OpenSCAD",
        "abstract": "Eine kurze Einführung in die Bedienung des OpenSource CAD Programmes OpenSCAD",
        "description": "OpenSCAD ermöglicht es dreidimensionale Objekte anhand von geometrischen Grundkörpern wie Kugel, Würfel, Quader, Zylinder, Kegel etc. zu erstellen. Im Gegensatz zu vielen anderen CAD Programmen, werden in OpenSCAD Modelle in rein textueller Beschreibung (Code) erstellt. \n\nGezeigt wird an praktischen Beispielen, wie man 3D Objekte in OpenSCAD erstellen kann. Diese könnten dann z.B. mit einem Slicer für den 3D-Drucker vorbereitet und gedruckt werden.",
        "aboutme": "Webmaster der Universität Tübingen, Dozent der Vorlesungen \"Einführung in Linux\" und \"Linux für Fortgeschritten\".",
        "vorwissen": "",
        "urlid": "81-einfhrung-in-openscad",
        "duration": 50,
        "room": "V2 (F122)",
        "timebegin": "10:00",
        "timeend": "10:50",
        "weblinks": {}
    },
    {
        "name": "Peter Hrenka",
        "titel": "Wieso Linux - für Softwareentwickler",
        "abstract": "Software entwickeln mit Linux? Ja, bitte!\n\nMit den Bordmitteln von Linux ist ein leichtes, eine effiziente Entwicklungsumgebung für die (praktisch) alle Programmiersprachen aufzusetzen.\n\nIch werde zeigen, wie man mit wenigen Handgriffen und eine paar Cheat Codes zu einem funktionsfähigen Entwicklungssystem kommt.",
        "description": "Viele Software-Entwickler kennen leider nur Windows als Entwicklungsumgebung, weil sie es nicht anders gelernt haben und in ihrem beruflichen Umfeld so vorgesetzt bekommen. Linux ist schon irgendwie bekannt wird aber nicht als Entwicklungssystem wahrgenommen.\n\nObwohl auch Windows langsam besser wird, ist Linux ein System von Entwicklern für Entwickler und jeder sollte die Vorzüge des \"Originals\" kennenlernen.",
        "aboutme": "Ich habe in Tübingen Informatik und Mathematik studiert und verwende fast ebensolange schon Linux in allen Lebenslagen. Mit einer kurzen Unterbrechung war ich auch in der Lage, Linux auch in meiner beruflichen Umgebung einzusetzen.\n\nIch nicht gerade arbeite, funke oder Klavier spiele, besuche ich C++ und OpenSource Konferenzen.",
        "vorwissen": "Die Zielgruppe ist \"Software-Entwickler\", aber es ist ein Linux spezifisches Vorwissen erforderlich.",
        "urlid": "84-wieso-linux-fr-softwareentwickler",
        "duration": 20,
        "room": "V2 (F122)",
        "timebegin": "11:00",
        "timeend": "11:20",
        "weblinks": {}
    },
    {
        "name": "Roland Imme",
        "titel": "Kamerawagen mit Linux (H0-Modelleisenbahn)",
        "abstract": "Bei diesem Vortrag wird eine Kamerawagen vorgestellt. Die Ansteuerung der Kamera wird mit Linux vorgenommen. Zu diesem Zweck wird ein Raspberry Pi Zero 2 verwendet. Seit 2023 gab es ein paar technische Anpassungen.",
        "description": "Bereits seit 3 Jahren befassen sich mein Sohn Adrian und ich mit der Entwicklung eines Kamerawagens, der mit der Unterstützung vom Betriebssystem Linux genutzt wird. \nAls Basis nutzen wir einen Raspberry Pi Zero 2. Der Kamerawagen ist eine Eigenentwicklung, die wir mit Hilfe eines 3D Druckers ausdrucken. \nDie Weiterverarbeitung der erstellten Videos erfolgt mittlerweile auch über einen Raspberry Pi 5. \nIn den vergangenen Jahren haben wir auf unterschiedlichen Linux-Veranstaltungen Impulse und Ideen erhalten, die wir in diesem Familienprojekt umsetzen konnten. \nDer Vortrag soll die möglichen Stolpersteine und deren Lösung dieses „Projektes“ vorstellen.\nEs sind keine speziellen Vorkenntnisse erforderlich. Es handelt sich um einen Vortrag, der 2 Welten etwas näher bringt. Es werden mögliche Verknüpfungen zwischen Modelleisenbahn und Linux vorgestellt.",
        "aboutme": "Rechner seit 1993\nLinux seit 2001\nLaTeX seit 2011\nVon 2001 bis 2006 Support bei H+BEDV\nVon 2006 bis 2007 Produkttrainer bei Bitdefender\nVon 2008 bis 2022 Technical Consultant und Technical Sales Engineer bei Kaspersky Labs GmbH\nVon 2023 bis heute Mitarbeiter bei DATEV e.G.\nHobbies: Unternehmungen mit der Familie, Gentoo, LaTeX, Kamerawagen, Fahrrad, Badminton und Modelleisenbahn",
        "vorwissen": "",
        "urlid": "70-kamerawagen-mit-linux-h0-modelleisenbahn-",
        "duration": 50,
        "room": "V2 (F122)",
        "timebegin": "11:30",
        "timeend": "12:20",
        "weblinks": {}
    },
    {
        "name": "Christian Heusel",
        "titel": "Getting Started with Open Source Software Contributions",
        "abstract": "Dieser Vortrag möchte eine paar Möglichkeiten aufzeigen, wie man in einen guten Einstieg als Contributor in die Open Source Welt schaffen kann.",
        "description": "Ich habe Anfangs länger gebraucht um die richtigen Einstiegspunkte zu finden, um vom Open Source Nutzer zum Contributor zu werden. Ein paar dieser Einstiegspunkte möchte ich in meinem Vortrag vorstellen und dabei eine Mischung aus meinen Erfahrungen als auch wie ich heute bei mir neuen Projekten vorgehe. \n\nIch bin selbst viel als Packager und Bug Wrangler aktiv, wodurch sehr viele Interaktionen mit den verschiedensten Projekten entstehen, wenn Programme crashen oder Upgrades nicht wie gewünscht funktionieren. \n\nFragen, die der Vortrag versucht zu beantworten:\n1. Was bedeutet es, dass eine Software Open Source / FOSS ist?\n2. Welche Möglichkeiten habe ich mich einzubringen?\n   2.1 Wie kann ich mich einbringen, wenn ich nicht programmieren kann?\n   2.2 Wie kann ich mich als Programmierer einbringen?\n3. Vorstellung ein paar konkreter Projekte\n\nDer Vortrag richtet sich vor allem an Einsteiger (oder natürlich FOSS Veteranen, die motiviert sind sich mehr Einzubringen) und erfordert kein besonderes Vorwissen! Kommt auch abseits der Vorträge gerne auf mich zu falls ihr Fragen zu einzelnen Projekten habt.",
        "aboutme": "Informatikstudent an der Universität Heidelberg und Arch Linux Package Maintainer, Bug Wrangler & DevOps-Team.\n\nQuatscht mich gerne einfach so an, auch wenn wir uns bisher noch nicht kennen! 🤗\n\nGithub: https://github.com/christian-heusel",
        "vorwissen": "",
        "urlid": "71-getting-started-with-open-source-software-contributions",
        "duration": 50,
        "room": "V2 (F122)",
        "timebegin": "12:30",
        "timeend": "13:20",
        "weblinks": {}
    },
    {
        "name": "Reinhard Müller",
        "titel": "Ada & Zangemann - Ein Märchen über Software, Skateboards und Himbeereis",
        "abstract": "Matthias Kirschner, Präsident der Free Software Foundation Europe, hat etwas verrücktes versucht: ein Kinderbuch über Freie Software zu schreiben. Das Ergebnis? Kinder und Erwachsene sind gleichermaßen begeistert.\n\nReinhard Müller präsentiert das Buch in Form einer Lesung.",
        "description": "In einer riesigen Villa hoch oben über der Stadt lebt der berühmte Erfinder Zangemann. Erwachsene wie Kinder lieben seine Erfindungen und wollen sie unbedingt haben. Doch dann geschieht etwas: Zangemann kommt in die Stadt, um seine Erfindungen wieder einmal aus der Nähe zu betrachten und – RUMMS! – ein Kind fährt ihm mit seinem Skateboard gegen das Schienbein. Wutentbrannt trifft der Erfinder eine Entscheidung und dann passieren merkwürdige Dinge... Aber das kluge Mädchen Ada durchschaut, was vor sich geht. Gemeinsam mit ihren Freund:innen schmiedet sie einen Plan.\n\nDas illustrierte Buch erzählt die Geschichte vom berühmten Erfinder Zangemann und dem Mädchen Ada, einer neugierigen Tüftlerin. Ada beginnt mit Hard- und Software zu experimentieren und erkennt dabei, wie wichtig der eigenständige, freie Umgang mit Software für sie und andere ist.\n\nEin Buch Kindern die Freude am Tüfteln vermittelt und zum selbstbestimmten Umgang mit Technik aufruft. Von 6 bis 106 Jahren.",
        "aboutme": "Reinhard Müller ist Softwareentwickler und engagiert sich seit über 20 Jahren ehrenamtlich bei der FSFE.",
        "vorwissen": "keines",
        "urlid": "76-ada-zangemann-ein-mrchen-ber-software-skateboards-und-himbeereis",
        "duration": 50,
        "room": "V2 (F122)",
        "timebegin": "14:00",
        "timeend": "14:50",
        "weblinks": {}
    },
    {
        "name": "Florian Snow",
        "titel": "Banken und Freie Software",
        "abstract": "Seit geraumer Zeit werden immer mehr Bereiche unseres Lebens appifiziert, wir werden also dazu gedrängt, eine bestimmte, meist unfreie App zu verwenden, um bestimmte Aufgaben erledigen zu können. Banken drängen ihre Kunden auch vermehrt in diese Richtung und es stellt sich die Frage warum. Dieser Talk beschreibt den langen Weg auf der Suche nach Antworten in Bezug auf Freiheit beim Banking.",
        "description": "",
        "aboutme": "Florian Snow ist ein Softwareentwickler aus Nürnberg, mit einem Hintergrund in einer Vielzahl verschiedener Bereiche wie Lehre, Programmierung, Linguistik und Design. Seit etwa 1999 interessiert er sich für Freie Software und ist seit etwa 2006 in der Community aktiv. Neben seiner Arbeit als Softwareentwickler arbeitet er und engagiert sich ehrenamtlich für die Free Software Foundation Europe, wo er über die Jahre in vielen verschiedenen Bereichen aktiv war.",
        "vorwissen": "",
        "urlid": "82-banken-und-freie-software",
        "duration": 50,
        "room": "V2 (F122)",
        "timebegin": "15:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Oleksandr Shcherbakov",
        "titel": "SSH für/vs. Security Engineers?",
        "abstract": "SSH (Secure Shell) ist ein Netzwerkprotokoll, das zu einem de-facto Standard für die Fernverwaltung von Servern geworden ist. Der Vortrag bietet eine Einführung in SSH, einschließlich grundlegender Anwendungen und Konfigurationen, und wird durch (leicht) fortgeschrittene Themen wie Tunnels und Proxies ergänzt. Ein ausgewähltes Beispiel zeigt, wie man mit einem SSH-Befehl ein sicheres VPN (Virtual Private Network) aufbaut.",
        "description": "",
        "aboutme": "DevOps Experte am Höchstleistungsrechenzentrum Stuttgart (HLRS)",
        "vorwissen": "Der Vortrag richtet sich an Anfänger, wobei Basiskenntnisse über Netzwerke (z.B. was IP, Port, Subnetz sind) von Vorteil sind.",
        "urlid": "77-ssh-fr-vs-security-engineers-",
        "duration": 20,
        "room": "V2 (F122)",
        "timebegin": "16:00",
        "timeend": "16:20",
        "weblinks": {}
    },
    {
        "name": "Yann Büchau",
        "titel": "Dateien zeitstempeln, um damalige Existenz zu beweisen",
        "abstract": "Technische Möglichkeiten, Dateien mit Zeitstempeln zu versehen",
        "description": "Von wann ist das Bild? Steht ja in den EXIF-Daten. Ja ne ist klar: Die Zeit, die da steht, kann man ja selber ändern. 🙃 Wie beweise ich also, dass dieses Foto wirklich von vor drei Jahren ist und nicht jetzt erst aufgenommen wurde? Zum Beispiel bei Schadensaufnahmen von Mietsachen. Oder Verträgen. Besonders sinnvoll im Zusammenhang mit digitalen Signaturen, sollte ein Schlüssel kompromittiert worden sein.",
        "aboutme": "Doktorand in der Umweltphysik an der Uni Tübingen, FOSS Verfechter und Linux-Enthusiast",
        "vorwissen": "",
        "urlid": "69-dateien-zeitstempeln-um-damalige-existenz-zu-beweisen",
        "duration": 20,
        "room": "V2 (F122)",
        "timebegin": "16:30",
        "timeend": "16:50",
        "weblinks": {}
    },
    {
        "name": "Stefan Baur",
        "titel": "Sicherer Fernzugriff dank Linux - selbst auf ein uraltes Windows",
        "abstract": "Immer häufiger nutzen Ransomware-Gruppen statt Phishing-Mails schlecht abgesicherte\nFernwartungszugänge als Einfallstor, um in Unternehmen einzudringen und alle Daten zu\nverschlüsseln.\nWir zeigen, wie man Fernzugriffe mit aktueller Verschlüsselungstechnik und Zwei-Faktor-Authentisierung absichern kann - selbst wenn man auf ein uraltes Windows zugreifen muss.",
        "description": "In diesem Vortrag zeigen wir verschiedene Fernzugriffs-Techniken, unter anderem auch mehrere\nMöglichkeiten, wie man mit einem zwischengeschalteten Linuxsystem von einem aktuellen\nPC aus sogar auf ein altes Windows XP sicher aus der Ferne zugreifen kann - ohne VPN,\nund auf Wunsch sogar portabel vom USB-Stick, ohne Softwareinstallation.\nWir beginnen damit, wie man einen SSH-Server auf einem Raspberry Pi aufsetzt und diesen per\nZwei-Faktor-Authentisierung absichert.\nDarauf aufbauend zeigen wir, wie man sich von diesem auf einen X2Go-Server \"weiterhangeln\"\nkann, aber auch, wie man diesen Raspberry Pi selbst zum X2Go-Server machen kann, um sich von\ndort auf Windows-Systeme zu verbinden.\nDie letzte Komponente ist der Aufruf des X2GoClients, der auch als \"Portable Application\", von einem USB-Stick, an einem beliebigen Windows-PC gestartet werden kann - oder man bootet von diesem Stick unser X2Go-Thin-Client-Image.",
        "aboutme": "Stefan Baur, Jahrgang 1977, ist der aktuelle Projektmanager und Lead Evangelist des Open-\nSource-Projekts X2Go und geschäftsführender Gesellschafter der BAUR-ITCS UG\n(haftungsbeschränkt), welche Support für X2Go anbietet, sowie der 1. Vorsitzende der Open\nRemote Computing Association - orca e.V., einem Dachverein für freie Remote-Computing-\nProjekte",
        "vorwissen": "Grundsätzliches Verständnis von Betriebssystemen (Linux, Windows) und Remote-Desktop-Verbindungen (VNC, RDP, X2Go) ist hilfreich.",
        "urlid": "74-sicherer-fernzugriff-dank-linux-selbst-auf-ein-uraltes-windows",
        "duration": 50,
        "room": "V3 (A301)",
        "timebegin": "10:00",
        "timeend": "10:50",
        "weblinks": {}
    },
    {
        "name": "Robert Scheck",
        "titel": "Internet-Messungen mit RIPE Atlas",
        "abstract": "[RIPE Atlas](https://atlas.ripe.net/) ist ein globales und offenes Messnetz mit tausenden Messpunkten, welches die Internet-Konnektivität in Echtzeit misst. Der Vortrag bietet einen Einstieg in RIPE Atlas und wie damit einfache eigene Messungen durchgeführt werden können.",
        "description": "RIPE Atlas ermöglicht sowohl eigene Messungen als auch den Betrieb eigener Messpunkte und kann damit ein hilfreiches Werkzeug für Internet/Netzwerk-Administratoren bzw. Betreiber von öffentlich erreichbaren Servern und Cloud-Diensten sein. Konkrete Anwendungsbeispiele sind Traceroutes oder Pings von anderen Internet-Providern oder aus anderen Ländern, oder GeoDNS-Abfragen. Die dabei ermittelten Daten sind öffentlich zugänglich und verwendbar. Durch die eigenen Messungen werden zudem auch Forschungen ermöglicht, die bereits zu diversen Veröffentlichungen geführt haben.\n\nDie zentralen Steuerungskomponenten sowie Auswertungswerkzeuge und Visualisierungen werden vom RIPE NCC in Amsterdam, der Vergabestelle für IP-Adressbereiche und AS-Nummern in Europa, dem Nahen Osten und Teile von Zentralasien, bereitgestellt, betrieben und weiterentwickelt. Die Messpunkte selbst bestehen aus Open-Source-Software und können von Interessierten und Freiwilligen, auch am heimischen Internetanschluss, betrieben werden.",
        "aboutme": "Langjähriger Contributor beim Fedora-Projekt, z.B. als Paket-Maintainer, sowie Mitwirkender bei diversen anderen Open-Source-Projekten – mit Interesse an IPv6 und (öffentlichen) Netzwerken.",
        "vorwissen": "Internet/Netzwerk-Grundkenntnisse, Traceroute, Ping",
        "urlid": "91-internet-messungen-mit-ripe-atlas",
        "duration": 50,
        "room": "V3 (A301)",
        "timebegin": "11:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "UDO SEIDEL",
        "titel": "RPM, DEB, GitHub, Codeberg, Woodpecker ... und noch viel mehr!!",
        "abstract": "Wie baue ich am effektivsten eigene RPM/DEB-Pakete - idealerweise über ein \"git push\"? \nUnd geht das auch ohne Github?",
        "description": "Es gibt sehr verschieden Gründe, die für das Generieren von \"eigenen\" RPM/DEB-Paketen. Typischerweise ist das ein sehr steiniger Weg. Und sogar, wenn man den allgemeinen Wegen und Empfehlungen folgt. Es ist noch turbulenter abseits der üblichen Pfade. Doch wenn man es wirklich will, dann erhält nach \"viel Geduld und Spucke\" ein schönes Resultat.",
        "aboutme": "Dr. Udo Seidel would have been a teacher for mathematics and physics if he would not have been infected by the Linux virus in 1996. After his PhD he has been in several roles: Linux/Unix instructor, sysadmin, senior solution engineer, manager, evangelist, ambassador, enterprise architect, account CTO and Senior CXA. Now he is an CSM for XM Cyber working out of Munich. He regularly attends conferences and publishes articles in computer magazines. On top he shares his IT thoughts and adventures on X (formerly known as Twitter), Mastodon and Facebook.",
        "vorwissen": "- Wie mann RPM/DEB Pakete baut\n- Basis Git-Wissen",
        "urlid": "80-rpm-deb-github-codeberg-woodpecker-und-noch-viel-mehr-",
        "duration": 20,
        "room": "V3 (A301)",
        "timebegin": "12:00",
        "timeend": "12:20",
        "weblinks": {}
    },
    {
        "name": "Peter Hrenka",
        "titel": "Wie teste ich Tests?",
        "abstract": "Langsam hat es sich herumgesprochen, dass man Software testen sollte und OpenSource Projekte gehen auch oft mit gutem Beispiel voran.\n\nAber wann ist ein Test denn ein guter Test? Wenn er 100% Coverage hat?\nLeider taugt Coverage nicht als alleiniges Gütekriterium weshalb man noch etwas anderes braucht.\nIch stelle die Idee des \"adversarial testing\" vor, das mit (relativ) einfachen Mitteln eine Verbesserung der Test-Qualität erreichen kann.",
        "description": "Die Grundidee ist recht einfach: Ein guter Test muss \"gute\" von \"schlechten\" Programmen unterscheiden können. Wenn man nun die Test-Infrastruktur so aufbaut, dass man beliebige Funktionen und Klassen mit demselben Test prüfen kann, kann man mit recht trivialen \"bösartigen Implementierungen\" ungeeignete Tests entlarven und anschließend verbessern.\nIn dem Vortrag werde ich einige Beispiele zeigen, wie man das \"adversarial testing\" mit einem leicht modifizierten googletest praktisch an einem C++-Programm durchführen kann.",
        "aboutme": "Ich habe in Tübingen Informatik und Mathematik studiert und verwende fast ebensolange schon Linux in allen Lebenslagen. Mit einer kurzen Unterbrechung war ich auch in der Lage, Linux auch in meiner beruflichen Umgebung einzusetzen.\n\nIch nicht gerade arbeite, funke oder Klavier spiele, besuche ich C++ und OpenSource Konferenzen.",
        "vorwissen": "C/C++ Grundwissen, Grundwissen Softwaretest.",
        "urlid": "83-wie-teste-ich-tests-",
        "duration": 50,
        "room": "V3 (A301)",
        "timebegin": "13:00",
        "timeend": "13:50",
        "weblinks": {}
    },
    {
        "name": "Michael Jerger",
        "titel": "Community in der eigenen Hand - föderiertes forgejo",
        "abstract": "Die Großen werden immer lieb und nett bleiben. Wer das nach den vielen Erfahrungen mit gelöschten XING-Gruppem, werbeverseuchtem SourceForge, copilitisiertem GitHub oder toxicTwitter nicht mehr so recht glauben will, der wartet sicher ungeduldig auf eine föderierte GitPlatform. Das haben wir auch lange und jetzt aber beschlossen, nicht länger zu warten sondern zu handeln.\n\nWir implementieren Föderation mit Forgjo, ein erstes benutzersichtbares Feature \"Föderierte Stars\" sind gerade im PR-Merge-Prozess. Den Einblick in den Maschinenraum, Überlegungen zur Sicherheit, Herausforderungen und wie es weitergehen könnte zeigen wir euch.",
        "description": "Hier ist unsere dazu passende PRs:\n \n1. Validierung der LikeActirvity: https://codeberg.org/forgejo/forgejo/pulls/3494\n2. Validierung der ActorID: https://codeberg.org/forgejo/forgejo/pulls/3662\n3. Es wird noch mehr Babysteps geben ...\n3. All In One: https://codeberg.org/forgejo/forgejo/pulls/1680\n\nUnd hier haben wir eine aktuellen Stand zum Testen: \n\nhttps://federated-repo.prod.meissa.de/",
        "aboutme": "Wer wir sind: meissa GmbH\nAus: Reutlingen - <http://meissa.de>\nDev: Python, Java, Kotlin, Clojure, Go\nOps: K8s & OpenShift, Cloud, OpenTofu, CI/CD\nService&Support: Forgejo\n\nHier unser Blog: https://domaindrivenarchitecture.org",
        "vorwissen": "OpenSource Softwareentwickler und Fediverse Nutzer.",
        "urlid": "68-community-in-der-eigenen-hand-fderiertes-forgejo",
        "duration": 20,
        "room": "V3 (A301)",
        "timebegin": "14:00",
        "timeend": "14:20",
        "weblinks": {}
    },
    {
        "name": "Christoph Wirth",
        "titel": "Linux im Elternhaus",
        "abstract": "Erfahrungsbericht von einem Jahr Umstellung auf Linux im Elternhaus",
        "description": "",
        "aboutme": "Ausbilder in der IT / Linux Admin",
        "vorwissen": "",
        "urlid": "94-linux-im-elternhaus",
        "duration": 5,
        "room": "V3 (A301)",
        "timebegin": "15:00",
        "timeend": "15:05",
        "weblinks": {}
    },
    {
        "name": "Michael Weiss",
        "titel": "Nix(OS) - Ein Überblick",
        "abstract": "Ein kurzer Überblick über den funktionalen Paketmanager Nix, die darauf basierende Linux Distribution NixOS, sowie Nixpkgs und weitere nützliche Tools. Es geht v.a. darum die Konzepte zu vermitteln sowie die Unterschiede zu klassischen Paket-Managern aufzuzeigen (mögliche Vor- und Nachteile).",
        "description": "Nix ist ein funktionaler Paketmanager, der auch auf anderen Betriebssystem genutzt werden kann, ohne Konflikte mit dem bestehenden package manager zu bekommen. NixOS ist eine auf Nix basierende Linux-Distribution, mit der neben den Software-Paketen zusätzlich auch die System-Konfiguration über Nix verwaltet werden kann. Die Paket-Definitionen und NixOS Module zur Systemkonfiguration werden in Nixpkgs, einem großen Git Repository, zentral verwaltet.\n\nNix(OS) verfügt unter anderem über folgende Features:\n- Transparent source/binary model\n- Declarative (system configuration)\n- Reproducible builds\n- Multi-user, multi-version (no conflicts)\n- Portable (Linux, macOS, …)\n- Reliable and atomic updates\n- Rollbacks",
        "aboutme": "Software engineer / sysadmin (science+computing AG / Atos / Eviden) and NixOS developer from Germany. Loves FLOSS, mainly interested in GNU/Linux and computer networks.",
        "vorwissen": "Zum besseren Verständnis hilft es bereits (genauer) mit anderen Linux Distributionen bzw. Paketmanagern vertraut zu sein.",
        "urlid": "86-nix-os-ein-berblick",
        "duration": 5,
        "room": "V3 (A301)",
        "timebegin": "16:00",
        "timeend": "16:05",
        "weblinks": {}
    },
    {
        "name": "Harald König",
        "titel": "Same Procedure as Every Year: Kommandozeilen-Sprechstunde(n)",
        "abstract": "Was ich schon immer auf der Kommandozeile mit der BASH lösen wollte…\nIhr fragt, ich erzähle und skripte.",
        "description": "An euren Fragen, Themen und Problemen (oder doch wieder nur meine eigenen Lösungen?) werde ich einige Shell-Grundlagen erörtern und helfen, neue Ideen zu bekommen...\n\nDie Kommandozeilenwerkzeuge von UNIX/Linux zusammen mit der Shell sind immer noch sehr mächtig und schnell, und zwar sowohl bezüglich der Laufzeit als auch der Entwicklungszeit für kleine Lösungen. Diese einfachen Tools helfen immer noch jeden Tag bei vielen Aufgaben, sowohl im Job als auch privat.\n\nDaher, wie schon in den letzten Jahren: Angebot, über hoffentlich interessante und aktuelle shell-Probleme zu reden.\n\nAm besten natürlich über EURE Probleme, daher bitte im VORAUS mit interessanten Themen melden an: koenig (at) linux.de",
        "aboutme": "Physik-Studium in Tübingen,\nRechner und DCF77 seit ~1980, (La)TeX seit 1986,\nUNIX seit ~1987,\nLinux seit 1992 (0.98.4),\nXFree86-Treiber fuer S3 von ~1993-2001.\nVon 2001 bis 2014 bei der science+computing ag in Tuebingen als SW-Entwickler.\nSeit 2014 nun bei Bosch Sensortec GmbH in Kusterdingen/Reutlingen als “System Expert” fuer Linux (DevOps) und embedded Android (Treiber).\n\nWeitere Interessen sind u.a. Reisen, Kernel, System-Technik und -Tools, Hardware, Grafik (-Treiber,-HW), neuerdings mal wieder Embedded-Systeme und Messtechnik, GPS und OpenStreetmap, u.v.a.m…..",
        "vorwissen": "kein Vorwissen erforderlich – nur Interesse an der Kommandozeile & ihrer vielen Tools",
        "urlid": "78-same-procedure-as-every-year-kommandozeilen-sprechstunde-n-",
        "duration": 110,
        "room": "W1 (A302)",
        "timebegin": "10:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Yann Büchau",
        "titel": "SolveSpace - Pragmatisches, freies 2D/3D CAD für Normalsterbliche",
        "abstract": "[🖱️ Maus mitbringen!] Lerne, mit SolveSpace praktische 3D-Modelle z.B. für funktionalen 3D-Druck oder Lasercutting zu erstellen.",
        "description": "SolveSpace ist ein freies 2D/3D CAD Programm mit überschaubarem aber trotzdem mächtigem Funktionsumfang. Es ist sehr leichtgewichtig und läuft auf allen Platformen. Für funktionale Teile mit einfachen oder auch komplexen geometrischen Einschränkungen sowie zum Simulieren von mechanischen Bewegungen eignet es sich hervorragend. In diesem Workshop werden die Grundlagen vermittelt, um mit SolveSpace zu arbeiten.\n\nEin Laptop und eine Maus (!) werden benötigt. Touchpad geht auch, macht aber keinen Spaß.",
        "aboutme": "Doktorand in der Umweltphysik an der Uni Tübingen, FOSS Verfechter und Linux-Enthusiast",
        "vorwissen": "Vorwissen wird keins benötigt. Eine Maus zur Bedienung ist aber sehr zu empfehlen! Ich bringe eine Handvoll Mäuse mit, aber lieber selber eine mitbringen.",
        "urlid": "64-solvespace-pragmatisches-freies-2d-3d-cad-fr-normalsterbliche",
        "duration": 110,
        "room": "W1 (A302)",
        "timebegin": "14:00",
        "timeend": "15:50",
        "weblinks": {}
    },
    {
        "name": "Rüdiger Marwein",
        "titel": "Blender 3D Schnelleinstieg",
        "abstract": "Schneller, praktischer Einstieg in Blender",
        "description": "Als Teilnehmer wird ein **Laptop benötigt**, die **Software Blender** und eine **Maus**. \n\nZiel des Workshops ist, die aller-wichtigsten Funktionen in Blender praktisch kennenzulernen, so dass hoffentlich alle Teilnehmer Lust bekommen sich weiter mit Blender zu beschäftigen.\nBlender ist ein leistungsstarkes Open Source 3D-Programm das mittlerweile sogar in Blockbuster-Produktionen genutzt wird. Es findet u.a. Anwendung in Kunst, Spielen und Filmen aber bspw auch der Medizin zur Visualisierung. Zu Spektrum zählen u.a. 3D-Modelle, Skulpturen, Texturierung, Rigging, Animation, Visual Effects, Raytracing, Compositing, Film-Schnitt sowie Zeichnen und Animation in einem 2D/3D Mix.\nGerade wegen der fast grenzenlosen Möglichkeiten, die das Programm bietet, ist der Einstieg oft schwierig. \nDoch mit den richtigen Kenntnissen lassen sich schnell Erfolge erzielen.\n\nErgebnisse:\n* Erstellung eines eigenen 3D-Modells\n* Erstellung und Anwendung eines Material-Shaders\n* Erstellung einer kleinen Animation\n* Durchführung einer Kamerafahrt",
        "aboutme": "",
        "vorwissen": "Blender-Vorkenntnisse sind nicht nötig.\nVorhandene Kenntnisse im Umgang mit Grafiksoftware und Tastatur-Kürzeln sind nützlich.\nEnglischkenntnisse sind von Vorteil (der Workshop ist deutsch, doch Blender nutzt englische Begriffe).",
        "urlid": "73-blender-3d-schnelleinstieg",
        "duration": 110,
        "room": "W2 (C118a)",
        "timebegin": "10:00",
        "timeend": "11:50",
        "weblinks": {}
    },
    {
        "name": "Michael Weiss",
        "titel": "How to Git: Internals/Algorithmen und erweiterte Funktionen",
        "abstract": "Git ist ein weit verbreitetes Hilfswerkzeug mit vielen Einsatzmöglichkeiten. Obwohl wir es meist regelmäßig im Alltag verwenden setzen wir uns selten genauer damit auseinander. Ziel dieses Workshops ist einen Überblick über die Funktionsweise von Git zu vermitteln. Mit dem Verständnis was die jeweilen Befehle machen sollte Git deutlich intuitiver werden und v.a. bei \"Problemen\"/Fehlermeldungen klar sein was das Problem ist und wie es gelöst werden kann.",
        "description": "Wir werden uns zunächst anschauen wie ein Git Repository aufgebaut ist (Internals) und wie Git funktioniert (Algorithmen). Zur Vereinfachung werden wir uns auf das wichtigste konzentrieren und v.a. Performance-Optimierungen weglassen.\n\nIm zweiten Teil werden wir uns darauf aufbauend einen Überblick über die CLI und die \"erweiterte\" Funktionalitäten verschaffen.\n\nUpdate: Auf Grund der begrenzten Zeit wird es evtl. eher ein Vortrag zum mitmachen als ein richtiger Workshop.",
        "aboutme": "Software engineer / sysadmin (science+computing AG / Atos / Eviden) and NixOS developer from Germany. Loves FLOSS, mainly interested in GNU/Linux and computer networks.",
        "vorwissen": "Am besten sollte man Git schon verwendet haben und zumindest grob damit vertraut sein. Aus zeitlichen Gründen müssen wir etwas tempo machen und werden direkt in die Details eintauchen (also z.B. eine Einführung/Motivation zu Versionskontrollsystemen (VCS) überspringen). Die Zielgruppe sind Git Benutzer die mit den Grundlagen der Git CLI vertraut sind und gerne die interne Funktionsweise sowie erweiterte Funktionen erlernen möchten.\n\nNach Möglichkeit bitte einen Laptop mit vorinstalliertem Git mitbringen um richtig am Workshop teilnehmen zu können.",
        "urlid": "85-how-to-git-internals-algorithmen-und-erweiterte-funktionen",
        "duration": 110,
        "room": "W2 (C118a)",
        "timebegin": "14:00",
        "timeend": "15:50",
        "weblinks": {}
    }
]