[
    {
        "titel": "Zocken unter Linux? Zocken unter Linux!",
        "weblinks": "",
        "vorwissen": "Die Teilnehmer sollten wissen, was Linux ist und gerne Computerspiele spielen.",
        "timeend": "17:00",
        "buzzword": "Linux, OpenSource, Steam, closed source, Treiber, Installation",
        "duration": 55,
        "urlid": "sascha-kaupp-zocken-unter-linux",
        "timebegin": "16:00",
        "name": "Sascha Kaupp",
        "inhalt": "Spiele unter Linux sind seit einigen Jahren ein Randthema, welches oft belächelt wird. Doch seit einiger Zeit ist Steam für Linux und OS X verfügbar, sodass der Zugang zu vielen Spielen, die plattformübergreifend veröffentlicht werden, gewährleistet ist. Der Vortrag gibt eine Übersicht der Anforderungen an einen Linux-basierten Spielerechner und beleuchtet die Probleme, die beim Installieren auftreten.",
        "room": "V4"
    },
    {
        "titel": "Container Migration using CRIU and LXC",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "13:30",
        "buzzword": "CRIU, LXC, POST-COPY, PRE-COPY, USERFAULTFD",
        "duration": 25,
        "urlid": "adrian-reber-container-migration-using-criu-and-lxc",
        "timebegin": "13:00",
        "name": "Adrian Reber",
        "inhalt": "Mit der Hilfe von CRIU ist es möglich Container live von einem System zum einem anderen System zu migrieren. Dieser Vortrag zeigt verschiedene Optimierung der Live Migration, welche hilfreich sind um die Downtime zu minimieren. Im Rahmen des Vortrages wird auf Optimierung basierend auf pre-copy (dirty memory tracking) und post-copy (userfaultfd basiert) eingegangen.",
        "room": "V2"
    },
    {
        "titel": "WLAN an der Schule - Ein Konzept mit Freifunk, Unifi und linuxmuster.net",
        "weblinks": "http://www.linuxmuster.net/ https://www.linuxmuster.net/wiki/dokumentation:handbuch:addons:chillispot http://freifunk-stuttgart.de/",
        "vorwissen": "",
        "timeend": "15:00",
        "buzzword": "Freifunk, Schule, Wlan ",
        "duration": 55,
        "urlid": "frank-schiebel-wlan-an-der-schule",
        "timebegin": "14:00",
        "name": "Frank Schiebel",
        "inhalt": "Am Quenstedt-Gymnasium in Mössingen gibt es seit etwa einem Jahr Freifunk an der Schule, seit etwa 2 Monaten fast flächendeckend. Umgesetzt wird das Konzept mit Ubiquiti Unifi APs, die zwei SSIDs ausstrahlen: Aus Datenschutzgründen muss man für Lehrer ein getrenntes, abgesichertes Netz anbieten. In diesem Netz kommt eine Hot-Spot Lösung auf Basis von Coova-Chilli zum Einsatz, die in der Schulserverlöung linuxmuster.net als Erweiterung verfügbar ist.  Das WLAN Konzept ist die Grundlage für BYOD Szenarien im unterrichtlichen Einsatz. Der Vortrag beschreibt die Entstehung der Idee und die erste Umsetzung unter Einbindung der schulischen Gremien wie Gesamtlehrerkonferenz und Schulkonferenz.  Welche Probleme treten auf, wenn man Freifunk an einer Schule anbieten möchte?  Außerdem wird die technische Umsetzung im Rahmen der FOSS Schulserverlösung linuxmuster.net erläutert.",
        "room": "V4"
    },
    {
        "titel": "Warum ist es (fast) unmöglich, eine Linux-Distribution weiterzugeben?",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "11:00",
        "buzzword": "Urheberrecht, Open Source, Lizenz, Lizenzpflichten, Ableitung, Copyleft, GPL, LGPL, BSD, MIT",
        "duration": 25,
        "urlid": "carsten-emde-warum-ist-es-fast-unmoeglich-eine-linux-distribution-weiterzugeben",
        "timebegin": "10:00",
        "name": "Carsten Emde",
        "inhalt": "Urheberrecht hat mit gewährtem oder eben auch nicht gewährtem Recht zu kopieren (copyright!) zu tun. Beim Herunterladen eines binären Distro-Image via Internet oder beim Erwerben einer binären Distro-CD/DVD kopiert der Hersteller der jeweiligen Distro und muss die Lizenzpflichten erfüllen, was er in der Regel auch tut. Wenn ich das von mir heruntergeladene Distro-Image kopiere und weitergebe, dann muss ich die Lizenzpflichten erfüllen, was (fast) unmöglich ist. Dieser Vortrag erklärt, warum das alles so ist und was man unbedingt tun bzw. unbedingt vermeiden muss, wenn man Open Source-Software weitergibt. Natürlich ist das alles besonders relevant, wenn die Weitergabe von Open Source-Software kommerziell erfolgt. Aber die Regeln sind identisch und gelten im Prinzip genauso bei nicht-kommerzieller Weitergabe.",
        "room": "V1"
    },
    {
        "titel": "Open Source Mehr-Faktor-Authentifizierung mit privacyIDEA",
        "weblinks": "https://privacyidea.org https://github.com/privacyidea/privacyidea https://netknights.it/migration-einer-proprietaeren-otp-zwei-faktor-loesung/",
        "vorwissen": "",
        "timeend": "11:00",
        "buzzword": "Security, 2FA, Einmalpasswort, OTP, Anmeldesicherheit",
        "duration": 55,
        "urlid": "cornelius-koelbel-open-source-mehr-faktor-authentifizierung-mit-privacyidea",
        "timebegin": "10:00",
        "name": "Cornelius Kölbel",
        "inhalt": "privacyIDEA ist ein offenes System zur Verwaltung von Authentifizierungs-Faktoren für Benutzer. Dies können klassische Einmalpasswort-Token (OTP), Display-Karten, U2F-Devices, Smartphone-Apps aber auch bspw. SSH-Keys sein. Dieser Vortrag zeigt die aktuellen Neuerungen in privacyIDEA. Die Entwicklung ist rasant, so dass der heutige Text im Juni schon wieder veraltet ist. ;-) Das zur Zeit brennende Thema ist die Migration eines bestehenden, alten OTP-Systems hin zu privacyIDEA. Ab der Version 2.11 ist es ein Kinderspiel, alte, proprietäre Systeme mit privacyIDEA abzulösen. Mit einer einzigen Policydefinition lässt sich sanft, auch über einen langen Zeitraum hinweg das alte System schmerzfrei migrieren.",
        "room": "V3"
    },
    {
        "titel": "Serverfarm mit zentral verwaltetem zweiten Faktor absichern",
        "weblinks": "https://privacyidea.org https://github.com/privacyidea/privacyidea",
        "vorwissen": "SSH-Server, Apache, PAM von Vorteil",
        "timeend": "18:00",
        "buzzword": "Zwei-Faktor-Authentifizierung, privacyIDEA, SSH, 2FA, OTP, Einmalpasswort",
        "duration": 120,
        "urlid": "cornelius-koelbel-serverfarm-mit-zentral-verwaltetem-zweiten-faktor-absichern",
        "timebegin": "16:00",
        "name": "Cornelius Kölbel",
        "inhalt": "In diesem Workshop installieren wir ein privacyIDEA-System, mit dem man auch für größere Benutzergruppen Authentifizierungsdevices verwalten kann. Somit lässt sich eine Mehr-Faktor-Authentifizierung zentral verwalten. Benutzer können sich mit Smartphones, OTP-Token, Yubikeys und vielen anderen, zusätzlichen Objekten anmelden. Wir konfigurieren exemplarisch einen SSH-Server, um die Anmeldung an diesem System um einen zweiten Faktor zu erweitern. ",
        "room": "W3"
    },
    {
        "titel": "Debian für Ein- und Umsteiger",
        "weblinks": "https://www.debian.org/ https://wiki.debian.org/ http://get.debian.org/cdimage/unofficial/non-free/cd-including-firmware/ https://www.debian.org/releases/jessie/releasenotes http://backports.debian.org/ http://mozilla.debian.net/ https://www.debian.org/releases/stable/installmanual https://people.debian.org/~andi/",
        "vorwissen": "",
        "timeend": "14:00",
        "buzzword": "Debian, Einsteiger, Installation, Backports, Firmware, Systemadministration",
        "duration": 55,
        "urlid": "andreas-mundt-debian-fuer-ein-und-umsteiger",
        "timebegin": "13:00",
        "name": "Andreas Mundt",
        "inhalt": "Debian GNU/Linux gilt nicht als typische Einsteigerdistribution. Dabei ist es mit ein wenig Hintergrundwissen leicht, die möglicherweise bei Installation, Konfiguration und Betrieb auftretenden Unzulänglichkeiten zu beseitigen. Dazu gehört oft fehlende Firmware sowie der Wunsch nach neueren Programm- oder Kernelversionen.  Der Vortrag vermittelt die erforderlichen Kenntnisse, um auch als Ein- und Umsteiger Debian ungetrübt genießen zu können. Er erläutert Hintergründe, verrät Tipps und Tricks und eröffnet dabei auch einen kleinen Einblick in das Debian Projekt und seine Philosophie. ",
        "room": "V1"
    },
    {
        "titel": "NixOS als Desktop-OS - Ein Erfahrungsbericht",
        "weblinks": "http://nixos.org http://nixos.org/nix",
        "vorwissen": "Grundverständnis von Package-Management unter Linux (apt-get, pacman, yum,... o.ä. schonmal benutzt).",
        "timeend": "15:00",
        "buzzword": "nixos,linux,distribution,nix,packagemanagement,desktop,os",
        "duration": 25,
        "urlid": "matthias-beyer-nixos-als-desktop-os-ein-erfahrungsbericht",
        "timebegin": "14:30",
        "name": "Matthias Beyer",
        "inhalt": "Seit inzwischen über einem Jahr setze ich NixOS Linux als Desktop-Betriebssystem auf allen meinen Maschinen ein. In meinem Vortrag möchte ich NixOS vorstellen und ein paar Erfahrungen teilen, die ich im letzten Jahr gemacht habe. Ich hoffe, dass ich damit die Linux-Distribution NixOS, welche meiner Meinung nach das Package-Management Problem löst, bekannt(er) machen.",
        "room": "V2"
    },
    {
        "titel": "XeLaTeX für Präsentationen... ?!?",
        "weblinks": "",
        "vorwissen": "Es ist kein spezielles Vorwissen für diesen Vortrag notwendig. Für die spätere Erstellung von Präsentationen sind Vorkenntnisse mit XeLaTeX von Vorteil. ",
        "timeend": "12:00",
        "buzzword": "Technologien, Programmiersprachen, Präsentationen",
        "duration": 55,
        "urlid": "roland-imme-xelatex-fuer-praesentationen",
        "timebegin": "11:00",
        "name": "Roland Imme",
        "inhalt": "Wie kann man XeLATeX für die Erstellung von Präsentationen einsetzen? Wo liegen die Vorteile beim Einsatz von XeLaTeX? Ist XeLaTeX eine Alternative zu den klassischen Anwendungen? Diese und weitere Fragen zum Thema XeLaTeX zur Erstellung von Präsentationen werden im Vortrag angesprochen. ",
        "room": "V4"
    },
    {
        "titel": "Fit for Git",
        "weblinks": "http://git-scm.com https://github.com",
        "vorwissen": "Gegenanzeigen: Bekannte Unverträglichkeit mit der Kommandozeile.  Anwendungshinweise: Für eine optimale Wirkung sollte *Fit for Git* in Kombination mit einem Notebook mit Git (>= 2.0), zugehöriger Dokumentation (man-pages) sowie gitk eingenommen werden. (bei älteren Git-Version kann es vereinzelt zu Komplikationen kommen)  Ubuntu/Debian: `sudo apt-get install git git-man gitk`  Fedora/RedHat: `sudo yum install git-all`  Windows: https://git-for-windows.github.io/  Mac: https://git-scm.com/download/mac",
        "timeend": "14:00",
        "buzzword": "Git Kommandozeile Versionskontrolle social coding GitHub",
        "duration": 120,
        "urlid": "knut-franke-fit-for-git",
        "timebegin": "12:00",
        "name": "Knut Franke",
        "inhalt": "Anwendungsgebiete: Mitarbeit an OpenSource-Projekten die Git verwenden, berufliche Perspektive im Softwareentwicklungs-Umfeld, eigene Webseiten erstellen auf [GitHub Pages](https://pages.github.com/), Versionschaos-Beschwerden bei der Verwaltung von Abschlussarbeiten oder persönlichen Projekten.  Risiken und Nebenwirkungen: Vereinzelt kann es zu plötzlicher Commit-Euphorie kommen, die jedoch in der Regel nach ein paar Tagen von selbst wieder zurückgeht. Frage im Zweifelsfall bitte deinen Prof oder Psychiater.",
        "room": "W1"
    },
    {
        "titel": "Korrektheit von Programmen beweisen mit Coq",
        "weblinks": "Coq: https://coq.inria.fr/ Compiler: http://compcert.inria.fr/ Dateisystem: http://css.csail.mit.edu/fscq/ Betriebssystem: http://sel4.systems/",
        "vorwissen": "Programmiererfahrung",
        "timeend": "18:00",
        "buzzword": "Coq, ocaml, Formale Systeme, Softwarequalität, Mathematik",
        "duration": 55,
        "urlid": "peter-hrenka-korrektheit-von-programmen-beweisen-mit-coq",
        "timebegin": "17:00",
        "name": "Peter Hrenka",
        "inhalt": "\"Jede nicht-triviale Software hat Fehler!\" - Wirklich? Es gibt mittlerweile (mindestens) einen C-Compiler, ein Dateisystem und ein Betriebsystem  deren Implementierung von Beweisassistenzsystemen gegen deren Spezifikation verifiziert wurden.  Der Vortrag soll einen kleinen Einblick liefern wie man mit dem Beweisassistenzsystem Coq mathematische Sätze beweisen und Software implementieren und verifizieren kann.",
        "room": "V2"
    },
    {
        "titel": "TiddlyWiki - das Wiki für die Hosentasche",
        "weblinks": "http://tiddlywiki.com http://nodejs.org",
        "vorwissen": "Bitte einen Laptop, vorzugsweise mit Firefox als Browser, mitbringen. Optional nodejs vorinstallieren.",
        "timeend": "16:00",
        "buzzword": "wiki, ",
        "duration": 120,
        "urlid": "matthias-windrich-tiddlywiki-das-wiki-fuer-die-hosentasche",
        "timebegin": "14:00",
        "name": "Matthias Windrich",
        "inhalt": "Nach einer kurzen Vorstellung legt sich jeder sein eigenes TiddlyWiki an und lernt spielerisch die Funktionsweise kennen.",
        "room": "W2"
    },
    {
        "titel": "Quo vadis Linux?!?",
        "weblinks": "http://osv.io/ http://rumpkernel.org/ https://mirage.io/ https://coreos.com/",
        "vorwissen": "Aufbau und Funktion klassischer Linux-Distributionen, insbesondere Enterprise (RHEL, SLES, ...) Erfahrung beim Betrieb von Anwendungen auf Openstack, AWS, GCP oder sogar Azure Offenheit für neue Konzepte/Ansätze/Ideen",
        "timeend": "14:00",
        "buzzword": "Cloud, Linux, Unikernel",
        "duration": 25,
        "urlid": "udo-seidel-quo-vadis-linux",
        "timebegin": "13:30",
        "name": "Udo Seidel",
        "inhalt": "Die IT-Welt hat sich in den letzten 3-5 Jahren stark verändert. Cloud und Container haben hier massgeblichen Einfluss. Dies hat starke Auswirkung auf das klassische Betriebssystem-Model und -Verständnis. Dies geht auch nicht spurlos an Linux vorbei. Der Vortrag zeigt, wie das freie Betriebssystem sich verändern muss/wird.",
        "room": "V2"
    },
    {
        "titel": "15 Tipps für besseres C++ oder warum es nur 10 wurden.",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "13:00",
        "buzzword": "C++, Modernes C++, The Zen of Python, C++14, C++11",
        "duration": 55,
        "urlid": "rainer-grimm-15-tipps-fuer-besseres-cplusplus-oder-warum-es-nur-10-wurden",
        "timebegin": "12:00",
        "name": "Rainer Grimm",
        "inhalt": "Python besitzt den \" The Zen of Python\". Das sind 19 Aphorismen von Tim Peters, die die Entwurfsprinzipien mit Python beschreiben.  Auf meiner Suche nach dem Zen of C++ komme ich zu 10 Tipps, wie modernes C++ geschrieben werden sollte. Alle Tipps unterlege ich mit vielen Beispielen.",
        "room": "V1"
    },
    {
        "titel": "Raspberry Pi (Zero) als Internet of Things ",
        "weblinks": "",
        "vorwissen": "Bastelfreude sollte dabei sein.",
        "timeend": "12:05",
        "buzzword": "Raspberry Pi, Pi Zero, Bewegungserkennung, Solarertragmessung, Temperaturmonitoring, Thermostat, Python, Raspbian",
        "duration": 5,
        "urlid": "marcus-siegl-raspberry-pi-als-internet-of-things",
        "timebegin": "12:00",
        "name": "Marcus Siegl",
        "inhalt": "Kleiner Showcase, was man mit einem Rasberry Pi Zero (\"dem 5$ Computer\") alles anstellen kann.",
        "room": "V3"
    },
    {
        "titel": "git sub - ähhm - dings",
        "weblinks": "https://git-scm.com/book/en/v2/Git-Tools-Submodules https://github.com/apenwarr/git-subtree/blob/master/git-subtree.txt https://github.com/ingydotnet/git-subrepo",
        "vorwissen": "git Grundwissen",
        "timeend": "12:25",
        "buzzword": "git, shell, workflow",
        "duration": 5,
        "urlid": "peter-hrenka-git-sub-aehhm-dings",
        "timebegin": "12:20",
        "name": "Peter Hrenka",
        "inhalt": "Um mehrere voneinander abhängige Projekte mit git zu verwalten gibt eine ganze Reihe von git \"sub\"-Kommandos: * git submodule * git subtree * git subrepo Ich werde diese Tools vergleichen und ein paar typische Abläufe damit vorstellen.",
        "room": "V3"
    },
    {
        "titel": "GNU emacs 101",
        "weblinks": "(The Editor of a Lifetime) https://youtu.be/VADudzQGvU8 (GNU Emacs) https://www.gnu.org/software/emacs/",
        "vorwissen": "Weil viel Ausprobieren angesagt ist, solltest du einen Laptop mit installiertem GNU Emacs in möglichst aktueller Version, optimal wäre Version 24.x (emacs --version), mitbringen. Emacs gibt es als freie Software für alle großen Betriebssysteme.   Zur Motivation eignet sich das Video \"The Editor of a Lifetime\"  von Perry Metzger",
        "timeend": "12:00",
        "buzzword": "emacs, Editor, lifetime, Lisp, Konfiguration, org-mode",
        "duration": 120,
        "urlid": "david-elias-kuenstle-gnu-emacs-101",
        "timebegin": "10:00",
        "name": "David-Elias Künstle",
        "inhalt": "Emacs ist ein Editor, der sich so flexibel an die Bedürfnisse des Benutzers anpassen lässt, dass viele mit oder durch ihn fast alle Arbeiten des Alltags erledigen. Nach einer Einführung in die grundlegende Struktur von GNU Emacs lernen wir interaktiv die Navigation und das starke Hilfesystem kennen. Dann wollen wir ausprobieren, wie man die Funktionen des Editors durch Konfiguration und das Installieren von Paketen erweitern und an unsere individuellen Bedürfnisse anpassen kann. Dazu gibt es Tipps zur Organisation der Konfiguration und zu hilfreichen Paketen. Im letzten Drittel des Workshops werfen wir einen Blick darauf, wie das Lösen von Alltagsaufgaben wie z.B. LaTeX editieren, Python Entwicklung, Arbeiten auf dem Server oder die Organisation des Alltags (Notizen & Exportieren dieser, TODO Liste, ...) in Emacs aussehen kann. Ziel ist es, dass jeder Teilnehmer sich in Emacs grundlegend zurecht finden kann, dass er weiß, wo er Hilfe bekommt und wie er den Editor an seine Bedürfnisse anpasst. ",
        "room": "W2"
    },
    {
        "titel": "Dokumenten-KungFoo für Hacker mit Pandoc Filter",
        "weblinks": "Pandoc: http://pandoc.org/index.html Pandoc Filter: https://github.com/jgm/pandoc/wiki/Pandoc-Filters Pandoc for Haskell Hackers: http://johnmacfarlane.net/BayHac2014/#/ Pandoc Filter Exercises: http://johnmacfarlane.net/BayHac2014/exercises.pdf Pandoc Filter Python Schnittstelle: https://github.com/jgm/pandocfilters Tuebix 2015 Archiv: http://www.tuebix.org/downloads/",
        "vorwissen": "Pandoc zu kennen sowie Programmierkenntnisse helfen dem Verständnis. Zu Pandoc gab es auf dem Tuebix 2015 eine Veranstalltung von Kurt Pfeifle \"Dokumenten-KungFoo mit Pandoc, Markdown & Co.\", Aufnahmen und Slides finden sich im Archiv.",
        "timeend": "12:45",
        "buzzword": "Pandoc, Dokument, Filter, Haskell, Python, AST, Markdown, PDF, HTML",
        "duration": 5,
        "urlid": "david-elias-kuenstle-dokumenten-kungfoo-fuer-hacker-mit-pandoc-filter",
        "timebegin": "12:40",
        "name": "David-Elias Künstle",
        "inhalt": "Mit Pandoc kann man eine Vielzahl an Dokumententypen ineinander umwandeln. So groß die Anzahl der Möglichkeiten damit ist, so wird sie umso größer, wenn man sich traut den AST des Dokumentes mit Skripten, Filter genannt, zu ändern. ",
        "room": "V3"
    },
    {
        "titel": "Webdienste unter NixOS",
        "weblinks": "nixos.org",
        "vorwissen": "",
        "timeend": "18:00",
        "buzzword": "nixos webhosting packaging purly-functional",
        "duration": 120,
        "urlid": "paul-seitz-webdienste-unter-nixos",
        "timebegin": "16:00",
        "name": "Paul Seitz",
        "inhalt": "In diesem Workshop lernen die Teilnehmer: 1. NixOS zu konfigurieren. 2. Mit Hilfe von NixOS einen Webservice aufzusetzen. 3. Einen Webservice für NixOS zu packetieren.",
        "room": "W1"
    },
    {
        "titel": "MobaXterm - Linux-Feeling unter Windows",
        "weblinks": "http://mobaxterm.mobatek.net",
        "vorwissen": "",
        "timeend": "12:35",
        "buzzword": "Windows, Terminal, X-Server, SSH, Cygwin",
        "duration": 5,
        "urlid": "alexander-nehmer-mobaxterm-linux-feeling-unter-windows",
        "timebegin": "12:30",
        "name": "Alexander Nehmer",
        "inhalt": "Vorstellung von MobaXterm, einem Toolkit von Linux-Werkzeugen unter Windows. MobaXterm basiert auf Cygwin und ermöglicht das Arbeiten unter Windows mit Linux-Feeling. MobaXterm kommt als Tab-organisierter Terminal daher, bringt einen X-Server mit, einen (S)FTP-Client, einen Telnet-Client, SSH-Agent, sämtliche Cygwin-Tools (sed, wget, awk, grep etc.), einen Paket-Manager (apt-cyg), einen SSH-Client und umfangreiche Konfigurationsmöglichkeiten. Wer den Commandline-Komfort einen Linux-Systems der Bedienschwere von Windows Explorer und CMD vorzieht, wird von MobaXterm schwer begeistert sein.",
        "room": "V3"
    },
    {
        "titel": "NX ist tot, es lebe <del>N</del>Xpra",
        "weblinks": "http://xpra.org",
        "vorwissen": "",
        "timeend": "13:10",
        "buzzword": "*nix,Linux,Unix,X11,NX,ssh,Remote Desktop,Xpra,Winswitch,Persistent Remote X11",
        "duration": 5,
        "urlid": "alexander-berg-nx-ist-tot-es-lebe-xpra",
        "timebegin": "13:05",
        "name": "Alexander Berg",
        "inhalt": "\"Xpra is an open-source multi-platform persistent remote display server and client for forwarding applications and desktop screens. It gives you remote access to individual applications or full desktops. On X11, it is also known as screen for X11: it allows you to run programs, usually on a remote host, direct their display to your local machine, and then to disconnect from these programs and reconnect from the same or another machine, without losing any state. It can also be used to forward full desktops, from X11 servers, MS Windows, or Mac OS X.\"",
        "room": "V3"
    },
    {
        "titel": "Docker ! Docker ! Docker !",
        "weblinks": "www.docker.com",
        "vorwissen": "Keine Angst vor der Kommandozeile und Vorwissen über Netzwerke und Filesysteme wären zum Verständnis hilfreich",
        "timeend": "12:00",
        "buzzword": "Docker, Docker Registry, Docker Toolbox, Docker Volumes, Docker Networking, Dockerhub",
        "duration": 55,
        "urlid": "olaf-flebbe-docker-docker-docker",
        "timebegin": "10:00",
        "name": "Olaf Flebbe",
        "inhalt": "Eine Einführung in Docker und Installation der Docker Toolbox. Als Demo stelle ich in Live Demos mit u.a. dem minecraft server, Jenkins, Sonatype Nexus, Wordpress, Java Webapplikationsentwicklung und die Docker Registry als Docker Applikation vor. Im Anschluss zeige ich den Einsatz von Docker zur Software Entwicklung:  z.B. Entwickeln mit den Programmiersprachen swift und go und wie man Docker selbst recompiliert und Images selber erstellt.  Im Anschluss ein paar Worte zu Docker auf nicht Intel Architekturen.",
        "room": "V2"
    },
    {
        "titel": "2038 - alles ist kaputt",
        "weblinks": "http://kernelnewbies.org/y2038 https://lwn.net/Articles/643234/",
        "vorwissen": "",
        "timeend": "12:20",
        "buzzword": "time_t, apocalypse, y2k, linux, kernel, glibc",
        "duration": 5,
        "urlid": "arnd-bergmann-2038-alles-ist-kaputt",
        "timebegin": "12:15",
        "name": "Arnd Bergmann",
        "inhalt": "Zeit wird in Unix und Linux in time_t beschrieben, oft eine 32-bit Zahl, die Sekunden zwischen 1970 und 2038 zählt. Wir arbeiten daran, das Grundsätzlich auf 64 bit zu erweitern, damit es auch 2039 noch funktionierende Computer gibt.",
        "room": "V3"
    },
    {
        "titel": "Maintaining a large Linux kernel subsystem",
        "weblinks": "http://git.kernel.org/cgit/linux/kernel/git/arm/arm-soc.git https://plus.google.com/+LinusTorvalds/posts/TyGZ8se6hhn",
        "vorwissen": "This presentation will be in English language, and is an updated version of a talk I originally gave the embedded Linux Conference 2015",
        "timeend": "12:00",
        "buzzword": "ARM, git, linux, kernel",
        "duration": 55,
        "urlid": "arnd-bergmann-maintaining-a-large-linux-kernel-subsystem",
        "timebegin": "11:00",
        "name": "Arnd Bergmann",
        "inhalt": "Arnd is co-maintainer for one of the largest subsystems in the linux kernel: the arm-soc tree that is used for collecting all the changes to SoC vendor specific files in the ARM architectures. He gives an overview of his work, how he deals every release with over 1000 patches and 100 pull requests from downstream maintainers, and how you can get your patches into the tree",
        "room": "V1"
    },
    {
        "titel": "NixOS als guest in LXC, systemd-nspawn & Docker verwenden",
        "weblinks": "https://nixos.org",
        "vorwissen": "Interesse an Container-Technologien und abgefahrenen [tm] Deploymentkonzepten.",
        "timeend": "14:30",
        "buzzword": "NixOS, LXC, systemd, docker, container, security",
        "duration": 55,
        "urlid": "joachim-schiele-nixos-als-guest-in-lxc-systemd-nspawn-docker-verwenden",
        "timebegin": "14:00",
        "name": "Joachim Schiele",
        "inhalt": "Im Vortrag geht es darum, wie man NixOS als 'guest' in Containern nutzt und das Setup deklarativ beschreibt.",
        "room": "V2"
    },
    {
        "titel": "gnuplot - Ein Bild sagt mehr als 1000 Zahlen...",
        "weblinks": "https://chemnitzer.linux-tage.de/2015/de/programm/beitrag/268 https://chemnitzer.linux-tage.de/2016/de/programm/beitrag/405",
        "vorwissen": "keine (naja, tippen können, und nicht zu viel Angst vor Tastatur nud Kommandozeile;-)",
        "timeend": "16:00",
        "buzzword": "hae?",
        "duration": 120,
        "urlid": "harald-koenig-gnuplot-ein-bild-sagt-mehr-als-1000-zahlen",
        "timebegin": "14:00",
        "name": "Harald König",
        "inhalt": "gnuplot in meiner UNIX-Werkzeugkiste seit mehr als einem Jahrzehnt nicht wegzudenken!  gnuplot kann viel mehr, als nur mathematische Funktionen (schön) zu plotten. Wann immer man ein paar Zahlen antrifft, die irgendwie in zusammen gehören (ob Spritpreise, das Wetter, vielleicht ja sogar die Lottozahlen) – eine Grafik zeigt Zusammenhänge und Entwicklungen. Und das geht super einfach mit nur wenigen, intuitiven Befehlen.  Im Vortrag wird an verschiedenen Beispielen erklärt, wie man Zahlen in informative und skalierbare Grafiken vewandeln kann, und wie man mit gnuplot Daten auswerten und Kurven-Fits an Ausgleichsfunktionen in Sekundenschnelle erstellen kann. ",
        "room": "W1"
    },
    {
        "titel": "Crazyflie - Frei wie ein...",
        "weblinks": "https://www.bitcraze.io/crazyflie-2/ ",
        "vorwissen": "Lust auf Technik und freie Hardware/Software",
        "timeend": "12:30",
        "buzzword": "QuadCopter OpenSource OpenHardware Vogel cool",
        "duration": 5,
        "urlid": "harald-koenig-crazyflie-frei-wie-ein",
        "timebegin": "12:25",
        "name": "Harald König",
        "inhalt": "Crazyflie 2.0 ist ein schnuckelig kleiner QuadCopter (nur 27 Gramm), dessen Hardware und Software frei sind. Das ermöglicht, ohne grossen Aufwand ein bissl in die Copter-Welt einzusteigen.",
        "room": "V3"
    },
    {
        "titel": "3D Konstruktion und 3D Druck mit OpenSCAD und Slic3r",
        "weblinks": "http://knopper.net/tuebix/",
        "vorwissen": "Kenntnis einer prozeduralen Programmiersprache (Basic, C, Java, Bash) ist hilfreich, aber nicht unbedingt erforderlich.",
        "timeend": "14:00",
        "buzzword": "3D,Konstruktion,Druck,OpenSCAD,Slic3r",
        "duration": 120,
        "urlid": "klaus-knopper-3d-konstruktion-und-3d-druck-mit-openscad-und-slic3r",
        "timebegin": "12:00",
        "name": "Klaus Knopper",
        "inhalt": "Auch wenn man selbst noch keinen 3D-Drucker besitzt, kann es für kreative Menschen sehr interessant sein, Dinge am Computer selbst zu entwerfen. Leider reichen die eigenen Zeichenkünste oft nicht aus, um maßgenaue Modelle zu erstellen. OpenSCAD (http:/openscad.org/) ist ein \"wenig-interaktives\" 3D Konstruktions-Programm für druckbare 3D-Modelle, das dank einer einfach zu erlernende Programmiersprache selbst von zeichnerisch eher unbegabten Personen in kurzer Zeit gemeistert werden kann. Mit Slic3r (http://slic3r.org/) können die Ergebnisse dann in Gcode für verschiedene Drucker übersetzt werden. ",
        "room": "W2"
    },
    {
        "titel": "Hadoop Distribution selber machen",
        "weblinks": "http://bigtop.apache.org",
        "vorwissen": "Ich versuche auf den Vortrag \"Big Data in a Nutshell\" vom letzten TüBIX aufzubauen: http://www.tuebix.org/2015/programm/flebbe-bigdata1/",
        "timeend": "17:00",
        "buzzword": "Docker, Hadoop, Hive, Spark, Map Reduce, Yarn, HDFS, Hue, Maven, Jenkins, AARCH64, Power8, Java, puppet, Smoke Test, vagrant, Debian, Fedora, SuSE, Centos",
        "duration": 55,
        "urlid": "olaf-flebbe-hadoop-distribution-selber-machen",
        "timebegin": "16:00",
        "name": "Olaf Flebbe",
        "inhalt": "Ich stelle die Apache Bigtop Distribution vor: Was ist das überhaupt ? Warum macht man so was ? Wie compiliert man eine Hadoop Distribution ? Wie testet man so was ? Wird man damit reich und berühmt?  Was für Verrückte sind das denn ? Warum überhaupt Apache, das ist doch ein Webserver ? ",
        "room": "V2"
    },
    {
        "titel": "Kinder, Computerzeitbegrenzung und New-Style-Daemons",
        "weblinks": "https://bitbucket.org/akruis/ctlimit https://www.freedesktop.org/wiki/Software/systemd/ http://lazka.github.io/pgi-docs/#GLib-2.0",
        "vorwissen": "Python-Programmierung, Grundlagen der UNIX-Programmierung und Linux-Systemverwaltung",
        "timeend": "16:00",
        "buzzword": "Python, daemon(7), systemd, D-Bus, logind, GLib, Kinder",
        "duration": 55,
        "urlid": "anselm-kruis-kinder-computerzeitbegrenzung-und-new-style-daemons",
        "timebegin": "15:00",
        "name": "Anselm Kruis",
        "inhalt": "Haben sie Lust, mit ihren Kindern über die Dauer der Computer Nutzung zu diskutieren? Wir hatten keine und haben uns mit einem kleinen Programm geholfen: ctlimit beschränkt die täglich Nutzungszeit auf faire Weise. Es ist übrigens ein in Python geschriebener \"new style daemon\". Und damit ein schönes Beispiel, um einiges über Linux Desktop Automatisierung, systemd, dbus, Glib und GObject Introspection, und die Frage wie man das alles praktisch umsetzt (debugging), zu erzählen. ",
        "room": "V4"
    },
    {
        "titel": "Mit LyX Master/Doktorarbeit schreiben",
        "weblinks": "http://www.miede.de/ http://www.lyx.org/",
        "vorwissen": "",
        "timeend": "12:30",
        "buzzword": "Lyx 2.2, Wordprozessor, Latex, Texlive ",
        "duration": 25,
        "urlid": "wolfgang-engelmann-mit-lyx-master-doktorarbeit-schreiben",
        "timebegin": "12:00",
        "name": "Wolfgang Engelmann",
        "inhalt": "Mit Classicthesis lassen sich wissenschaftliche Abschlussarbeiten eindrucksvoll schreiben. Besonders geeignet für Naturwissenschaften, aber auch Sprachwissenschaften. Lyx erlaubt ein schnelles Einarbeiten und ist ein sehr stabiles System.",
        "room": "V4"
    },
    {
        "titel": "Hadoops 'secure mode' - Fluch oder Segen? ",
        "weblinks": "",
        "vorwissen": "Kerberos-Grundlagen",
        "timeend": "16:00",
        "buzzword": "Hadoop, secure mode, Kerberos, Active Directory, LDAP, Linux",
        "duration": 55,
        "urlid": "reiner-schlotte-hadoops-secure-mode-fluch-oder-segen",
        "timebegin": "15:00",
        "name": "Reiner Schlotte",
        "inhalt": "Hadoops 'simple mode' ist für die Anwendung im Unternehmen viel zu unsicher. Der 'secure mode' stellt völlig neue Herausforderungen an die Systemintegration. Der Vortrag präsentiert einige Probleme, Lösungsansätze, offene Fragen.",
        "room": "V2"
    },
    {
        "titel": "Gentoo Installparty",
        "weblinks": "Gentoo-Wiki: https://wiki.gentoo.org/wiki/Main_Page Gentoo-Handbook: https://wiki.gentoo.org/wiki/Handbook:AMD64 Gentoo-Installation: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/About Portage: https://wiki.gentoo.org/wiki/Handbook:AMD64/Working/Portage",
        "vorwissen": "Linux-Grundlagen ;)",
        "timeend": "18:00",
        "buzzword": "Gentoo, Installparty, Meta-Disti, portage, emerge",
        "duration": 120,
        "urlid": "mark-schmidt-gentoo-installparty",
        "timebegin": "16:00",
        "name": "Mark Schmidt",
        "inhalt": "Gentoo ist eine eine Linux-Distribution, die sich an erfahrenere Linux-Benutzer richtet und diesen sehr viele Freiheiten bietet. Dies beginnt bei der verwendeten Software, Diensten und endet beim Init-System und einem eigenen Kernel. Um dies zu erreichen nutzt Gentoo ein spezielles Paketverwaltungssystem namens \"portage\", das die Pakete nach Benutzerwünschen auf dem jeweiligen System kompiliert.  In diesem Workshop wird kurz auf die Gentoo-Philosophie, die Benutzung von Portage und die Grundinstallation eingegangen.",
        "room": "W2"
    },
    {
        "titel": "systemd für Admins",
        "weblinks": "",
        "vorwissen": "erste Erfahrung mit Linux als Administrator",
        "timeend": "15:00",
        "buzzword": "systemd,admin,init",
        "duration": 55,
        "urlid": "jonas-genannt-systemd-fuer-admins",
        "timebegin": "14:00",
        "name": "Jonas Genannt",
        "inhalt": "Systemd für Admins - Praktisches Wissen für den Einsatz von Systemd und dessen vielen kleinen tollen Features",
        "room": "V1"
    },
    {
        "titel": "Vim für Nicht-Mehr-Beginner und Noch-Nicht-Fortgeschrittene",
        "weblinks": "http://www.tuebix.org/programm/zimmer-vim/ :)",
        "vorwissen": "vimtutor 7.x sollte bekannt/durchgespielt worden sein",
        "timeend": "12:00",
        "buzzword": "Textverarbeitung, Texteditor, vim",
        "duration": 120,
        "urlid": "toni-zimmer-vim-fuer-nicht-mehr-beginner-und-noch-nicht-fortgeschrittene",
        "timebegin": "10:00",
        "name": "Toni Zimmer",
        "inhalt": "Unterschiede zu vi ggf. kurze Auffrischung des vimtutors vim starten und beenden Erläuterung des Hilfesystems fortgeschrittenes “Bewegen” und Editieren in einer Datei .vimrc und .viminfo Arbeiten mit selbst definierten Shortcuts (Mappings, Abbreviations) Makros Arbeiten mit Tabs Arbeiten im “visual mode” Skeletons",
        "room": "W1"
    },
    {
        "titel": "Der Wal im Windkanal - Docker Container für Scientific Computing",
        "weblinks": "https://docs.docker.com/linux/",
        "vorwissen": "Die thematisierten Punkte sind selbstverständlich nicht ausschließlich für High Performance Computing (HPC)-Umgebungen relevant, sondern lassen sich praktisch auf alle Umgebungen mit komplexen Softwareanforderungen übertragen, so dass von den Zuhörern kein besonderes HPC-Vorwissen erwartet wird ;-)  Dies gilt auch für das nötige Vorwissen zu Containern und speziell Docker - tiefergehende Vorkenntnisse werden nicht erwartet. Wer noch erste Schritte machen möchte kann dies unter Verwendung des Weblinks \"Get Started with Docker Engine for Linux\" gerne tun ;)",
        "timeend": "12:00",
        "buzzword": "Scientific Computing, HPC, Docker, Container, Linux, Cloud, Security",
        "duration": 55,
        "urlid": "holger-gantikow-der-wal-im-windkanal-docker-container-fuer-scientific-computing",
        "timebegin": "11:00",
        "name": "Holger Gantikow",
        "inhalt": "Der Vortrag gibt einen kurzen Einblick in die spannende Welt des Scientific Computings, der dortigen Anforderungen und Problemfelder und zeigt welche Vorteile und Nutzen die flexible Containerlösung auch dort bieten kann  - und stellt beispielsweise vor, warum man hier eher mit Containern als mit virtuellen Maschinen \"rechnen\" möchte.  Da der Einsatz von Docker in der Regel nicht ohne Sicherheitsimplikationen bleibt, soll auch betrachtet werden, wie sich Docker in einem solchen Bereich \"bändigen\" lässt, welche Neuerungen aktuelle Versionen gebracht haben und welche Herausforderungen aktuell allgemein bei der Integration noch zu beachten sind.",
        "room": "V2"
    },
    {
        "titel": "High-Performance-Computing mit Docker",
        "weblinks": "https://www.docker.com/",
        "vorwissen": "Mal etwas gehört haben von... ... Docker oder LXC oder BSDJails oder ähnlichem ... Linux Kernel Funktionen wie cgroups, namespaces und Co. ... High-Performance-Computing und Queuening Systemen",
        "timeend": "13:00",
        "buzzword": "docker,hpc,etcd,linux,openvswitch,container,queueing,sdn",
        "duration": 55,
        "urlid": "sebastian-klingberg-high-performance-computing-mit-docker",
        "timebegin": "12:00",
        "name": "Sebastian Klingberg",
        "inhalt": "Spätestens im Jahr 2015 sollte man schon mal etwas den Hype um die offene Containertechnologie *Docker* mitbekommen haben, die nun schon länger den Status \"production-ready\" trägt und - über ein vonen den großen IT Firmen unserer Zeit gestütztes Start-Up und eine euphorisierte Community - stetig wächst und gedeiht.  Vorangetrieben wird dieser Trend für die Microservices unter dem Linux-Kernel bisher allerdings hauptsächlich in den Kreisen hipper Cloud-Entwickler.  Doch auch für die Bereiche eines traditionellen High-Performance-Computing (HPC) enthält die Technologie  (vielleicht) das Potential, nicht nur dem Administrator das Leben zu erleichtern.  Die Integration von Docker in bestehende Sturkturen ist jedoch mit einigen Überlegungen, Problemen und Fallstricken verbunden. In diesem Vortrag werden diese Punkte identifiziert, diskutiert und bewertet.   Im Rahmen eines Proof-of-Concept wird ausserdem gezeigt, wie eine umfassende HPC-Lösung aussehen könnte, die parallele Rechenjobs in verteilten Docker-Containern über ein Queueing System ermöglicht.",
        "room": "V2"
    },
    {
        "titel": "Netzwerkbaukasten OpenVSwitch",
        "weblinks": "http://openvswitch.org/",
        "vorwissen": "",
        "timeend": "13:05",
        "buzzword": "sdn,container,openvswitch,openflow",
        "duration": 5,
        "urlid": "sebastian-klingberg-netzwerkbaukasten-openvswitch",
        "timebegin": "13:00",
        "name": "Sebastian Klingberg",
        "inhalt": "Möchte man eine Netzwerkbasis zwischen VMs und Containern schaffen und das am besten noch in einen Cloud Context setzen, so Bedarf dies einer gewissen Dynamik. Virtuelle Switche können diese Dynamik bieten und bieten dabei noch einige weitere Vorteile - allerdings auch ein paar Eigenheiten.  In diesem Lightning Talk soll einer der prominentesten Vertreter der Sorte kurz vorgestellt werden: OpenVSwitch",
        "room": "V3"
    },
    {
        "titel": "Das PHP-Framework (TYPO3) Flow ",
        "weblinks": "http://flow.typo3.org",
        "vorwissen": "Interesse an Webentwicklung; Grundkenntnisse in PHP hilfreich, aber nicht notwendig.",
        "timeend": "13:00",
        "buzzword": "PHP, Web-Framework, TYPO3 Flow, Domain Driven Design, Dependency Injection, Aspect-oriented Programming, Fluid, Doctrine",
        "duration": 25,
        "urlid": "frederik-milkau-das-php-framework-typo3-flow",
        "timebegin": "12:30",
        "name": "Frederik Milkau",
        "inhalt": "Ein kurzer Überblick über das PHP-Web-Framework TYPO3 Flow (LGPL/MIT). Das Framework dient u.a. als Basis des Content Management Systems Neos, das sich aus der Arbeit am TYPO3 CMS entwickelt hat.  Flow implementiert fancy Entwicklungsmuster wie Domain Driven Design, Dependency Injections und Aspect-oriented Programming. Mit Extbase als Rückportierung von Flow kommen diese z.T. auch bei der Entwicklung von TYPO3 CMS Extensions zum Einsatz.  Kurzum: Was ist Flow? Was kann Flow? Was bedeuten all die anderen Wörter und warum könnte mich das interessieren? ",
        "room": "V4"
    },
    {
        "titel": "Open Source Software beim Freien Radio Wüste Welle",
        "weblinks": "http://wueste-welle.de",
        "vorwissen": "",
        "timeend": "13:30",
        "buzzword": "Freie Software im Radioalltag: Audiostreaming, Datenmanagement, Sendungsautomation, Webservices, Mitgliederverwaltung, Buchhaltung/Büro,...",
        "duration": 25,
        "urlid": "friedrich-strohmaier-andy-kuestner-open-source-software-beim-freien-radio-wueste-welle",
        "timebegin": "13:00",
        "name": "Friedrich Strohmaier, Andy Küstner",
        "inhalt": "Der Radioalltag will Lösungen für die verschiedensten Anwendungsbereiche: Sowohl Audiotechnik mit digitaler Studio und Mischtechnik, als auch Verwaltung verschiedenster Dateien (archivierte Aufnahmen, Vor- und nachbereitete Audiodateien, Videos, Fotos, Schriftliche Dokumente). Dafür gebraucht wird eine Leistungsfähige Vernetzung mit Client- und Serversystemen. Automatisierung und Archivierung von Ausstrahlungen, Übertragungstechnik zum Sender und in's Web, aber auch z.B. der Aufbau einer Schließanlage sind Bereiche, die die Technik auf Trab halten. Auch der Bürobetrieb und die Organisation der Arbeit von ca. 160 Leuten wollen mit Anwendungen verschiedenster Art unterstützt sein. ",
        "room": "V4"
    },
    {
        "titel": "Linux und X2Go: ein  effektiver & günstiger Schutz vor Ransomware auf Windows-Systemen",
        "weblinks": "http://www.x2go.org http://www.baur-itcs.de https://www.bsi.bund.de/SharedDocs/Downloads/DE/BSI/Internetsicherheit/recobslanginfo_pdf.html",
        "vorwissen": "Windows-Hasser, bitte draußen bleiben. ;-)",
        "timeend": "18:00",
        "buzzword": "Ransomware, X2Go, Remote Desktop, Remote Application, ReCoBS",
        "duration": 55,
        "urlid": "stefan-baur-linux-und-x2go-ein-effektiver-und-guenstiger-schutz-vor-ransomware-auf-windows-systemen",
        "timebegin": "17:00",
        "name": "Stefan Baur",
        "inhalt": "Vor 3 Jahren, aufgerüttelt durch Snowden, hatte jeder Angst, per Trojaner ausgespäht zu werden. Das Risiko, durch einen Virenbefall nicht mehr an seine Daten zu kommen, war im Vergleich zum „Datenleck“ gering. Heute ist Ransomware in aller Munde. Kurz: Gestern standen wir am Abgrund, heute sind wir einen Schritt weiter. Auftritt ReCoBS: Schon vor 10 Jahren durch das BSI als Konzept entwickelt, aber bislang viel zu wenig beachtet. Was bedeutet ReCoBS (Remote-Controlled-Browsers-System)? Wieso ist es ein viel effektiverer Schutz als Virenscanner, Firewall, oder UTM? Wir gehen kurz auf die ReCoBS-Historie ein und blicken auf 6 Jahre Praxiserfahrung mit einer konkreten Umsetzung auf Basis X2Go als fertiger Appliance zurück. Anschließend zeigen wir, dass X2Go/Linux/OpenSource gut skaliert: Ein X2Go-ReCoBS, individuell auf die Bedürfnisse eines Mittelständlers angepasst, und auf dessen eigener Virtualisierungshardware installiert, ist sehr kostengünstig machbar.",
        "room": "V3"
    },
    {
        "titel": "Statistik mit R",
        "weblinks": "https://www.r-project.org/",
        "vorwissen": "Interesse und Neugier",
        "timeend": "11:00",
        "buzzword": "R, Datenanalyse, Datenvisualisierung, Statistik, Data Mining, Machine Learning, Big Data",
        "duration": 55,
        "urlid": "janko-dietzsch-statistik-mit-r",
        "timebegin": "10:00",
        "name": "Janko Dietzsch",
        "inhalt": "R stellt das Open Source Projekt für die statistische Analyse dar. Es ist sowohl eine Programmiersprache wie auch eine Statistik-Umgebung mit einem breiten und dynamischen \"Ökosystem\". Der Vortrag soll anhand von Beispielen eine Einführung in die Arbeit mit R geben. Dabei kommen nicht nur seine Möglichkeiten zur Analyse zur Sprache, sondern auch die guten und umfangreichen Optionen für die Datenvisualisierung.   ",
        "room": "V4"
    },
    {
        "titel": "Was ist ownCloud? Und wieso?",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "17:30",
        "buzzword": "Cloud,Software",
        "duration": 25,
        "urlid": "vinzenz-rosenkranz-was-ist-owncloud-und-wieso",
        "timebegin": "17:00",
        "name": "Vinzenz Rosenkranz",
        "inhalt": "Kurzer Überblick über die Funktionen und Möglichkeiten von ownCloud. Für Neugierige und alle, die mit dem Begriff nichts anfangen können.",
        "room": "V4"
    },
    {
        "titel": "E-Mail-Verschlüsselung mittels GnuPG und das Web of Trust",
        "weblinks": "GnuPG - https://www.gnupg.org/ OpenPGP - https://tools.ietf.org/html/rfc4880 Enigmail - https://www.enigmail.net/index.php/en/",
        "vorwissen": "- Interesse am Thema ;) - GNU/Linux (andere Betriebssysteme sind auch möglich solange dann schon die notwendigen Tools installiert sind) - Keine Angst vor dem Terminal (sollte man am besten schon mal benutzt haben) - Ein funktionierendes E-Mail-Setup das GnuPG unterstützt (z. B. Thunderbird, Mutt, Kmail, etc.) - kein Webmail!",
        "timeend": "16:00",
        "buzzword": "GnuPG,gpg,OpenPGP,WOT,Web of Trust,E-Mail,Verschlüsselung,Kryptographie",
        "duration": 120,
        "urlid": "michael-weiss-e-mail-verschluesselung-mittels-gnupg-und-das-web-of-trust",
        "timebegin": "14:00",
        "name": "Michael Weiss",
        "inhalt": "Jeder Teilnehmer soll lernen, wie man E-Mails mittels GnuPG verschlüsselt und signiert. Wir werden dazu einfach ein paar Mails hin und her schicken und die grundlegenden Konzepte vermitteln. Auch das Web of Trust wird ein zentrales Thema sein (was das ist wird noch erklärt). Je nach Interessen und Vorwissen der Teilnehmer können wir uns auch noch weitere Themen wie die Verschlüsselung von Dateien anschauen.",
        "room": "W3"
    },
    {
        "titel": "Hard Disk Heart Attack",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "16:30",
        "buzzword": "Demo, python, fuse, hack, HDD",
        "duration": 25,
        "urlid": "felix-bauer-hard-disk-heart-attack",
        "timebegin": "16:00",
        "name": "Felix Bauer",
        "inhalt": "Gefahren durch kompromittierte HDD-Firmware  Gefahren für und ausgehend von Computerhardware in Form von physischen und  logischen Angriffen auf Festplatten (Geräten mit leistungsfähigen  ARM-Cores, viel RAM, seriellen Schnittstellen, mehreren TB Storage und 6  Gbits/s interfaces). Persistente Backdoors (APT), Spionage, Spielereien, nicht  detektierbare Datenextraktion und vieles mehr.",
        "room": "V1"
    },
    {
        "titel": "Squid Reproduction",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "13:15",
        "buzzword": "squid, docker, proxy, caching, datenschutz, sicherheit, systemd, no logging",
        "duration": 5,
        "urlid": "felix-bauer-squid-reproduction",
        "timebegin": "13:10",
        "name": "Felix Bauer",
        "inhalt": "Automatische Instantiierung eines Docker-Containers mit Caching Proxy  Caching Proxy in 3..2..1. Als Package-Cache für Linuxe (Linux-Install-Party)  oder für sonstige Beschleunigungen, Proxies haben auch im Jahr 2016  noch eine Daseinsberechtigung (aber eigentlich nicht direkt auf meinem  schönen System). Daher eine schnelle Lösung mit Containern und allen  Vorteilen: Kapselung, Separierung, Isolierung, Ver- und Entsorgung von Daten,  Loggs und Unnötigem, ständig frisch und ohne Aufwand.",
        "room": "V3"
    },
    {
        "titel": "Free Internet",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "15:05",
        "buzzword": "Hostapd, Dnsmasq, RaspberryPI, systemd, Tor, socksproxy, iptables, Datenschutz, Privatsphäre",
        "duration": 5,
        "urlid": "felix-bauer-free-internet",
        "timebegin": "15:00",
        "name": "Felix Bauer",
        "inhalt": "Einmal frei machen bitte - Sicher und unbeschränkt, WLAN für alle  Das Internet gehört zu den Grundbedürfnissen und sollte Grundrecht sein. Freies Internet bedeutet freien Zugang zu Informationen und Kommunikation  und solle jedem überall und immer zur Verfügung stehen. Störerhaftung stört.  Ein technischer Lösungsansatz ist das TOR-Netzwerk als Anonymisierungsdienst.  Der Vortrag beschreibt mit welchen Komponenten man aus einem Linux Rechner  einen WLAN-Router macht und wie die Daten ihren Weg ins ordentliche Internet  finden.  Wunsch:  Sind Anwälte anwesend? Kennt jemand jemanden der Anwalt ist? Spezialisten für  Medienrecht? Ich möchte eine vernünftige (nicht technische) Lösung für das  Problem der Störerhaftung!",
        "room": "V3"
    },
    {
        "titel": "WOL-on-ARP - Anturnen bei Bedarf",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "12:50",
        "buzzword": "Scapy, Sniffing, ARP, WOL, Code, Python, systemd",
        "duration": 5,
        "urlid": "felix-bauer-wol-on-arp-anturnen-bei-bedarf",
        "timebegin": "12:45",
        "name": "Felix Bauer",
        "inhalt": "Es wird erst heiß wenns richtig los geht. PC automatisch bei Bedarf einschalten. Ein System das ständig läuft genügt (kann der Router sein), alles andere sollte nur bei Bedarf die Wohnung heizen. Wake-on-Lan ist eine Lösung, aber alleine doch zu umständlich. Wake-on-ARP wird nur von den wenigsten Netzwerkkarten unterstützt, kann aber leicht \"nachgerüstet\" werden. Ein kleines Skript stellt die Verbindung zwischen ARP und WOL her. Der Vortrag zeigt wie und erklärt warum.",
        "room": "V3"
    },
    {
        "titel": "AlpineLinux",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "12:10",
        "buzzword": "Linux, PIE, statically linked, busybox, musl libc, grsec/PaX",
        "duration": 5,
        "urlid": "felix-bauer-alpinelinux",
        "timebegin": "12:05",
        "name": "Felix Bauer",
        "inhalt": "Alpine Linux ist eine sicherheitsorientierte und leichtgewichtige Distribution auf Basis von musl libc und busybox. Im Vortrag werden die schönsten Features, Unterschiede, Merkmale und Eigenheiten gezeigt und kurz erklärt.",
        "room": "V3"
    },
    {
        "titel": "BYOD - OTA Deanonymisierung",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "14:00",
        "buzzword": "Smartphone, airmon, scapy, tracking, Bring-Your-Own-Disaster, Over-The-Air",
        "duration": 120,
        "urlid": "felix-bauer-byod-ota-deanonymisierung",
        "timebegin": "12:00",
        "name": "Felix Bauer",
        "inhalt": "Sniffing for WIFI clients: Moderne Smartphones werden ständig mitgeführt und mit unzähligen Drahtlosnetzwerken verbunden, um diese Verbindungen wieder aufnehmen zu können  werden die Netze auch aktiv angefragt. Wir wollen uns diese Pakete genauer  anschauen und ein kleines Tool entwickeln um die Namen der WLANs darzustellen  und eventuell Rückschlüsse auf den Besitzer des Geräts zu ziehen.",
        "room": "W3"
    },
    {
        "titel": "/var/log/LUG",
        "weblinks": "http://www.linux-magazin.de/Heft-Abo/Linux-User-Groups http://linux-presentation-day.de/",
        "vorwissen": "",
        "timeend": "15:00",
        "buzzword": "Linux User Groups, FabLab, Shack, Linux Presentation Day",
        "duration": 55,
        "urlid": "lugs-und-co-var-log-lug",
        "timebegin": "14:00",
        "name": "LUGs + Co",
        "inhalt": "Aufgrund der vielen guten Rückmeldungen vom letzten Jahr (http://www.tuebix.org/2015/programm/lugs-kurzvorstellungen/) abermals die Gelegenheit zum Austausch zwischen den User Groups und ähnlichen Gruppen. Diesmal zusätzlich mit kleinem Austausch/Rückblick auf die beiden vergangenen Linux Presentation Days.",
        "room": "V3"
    },
    {
        "titel": "Lightning Talks für Kurzentschlossene",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "16:00",
        "buzzword": "ad-hoc Talks, ungeprobt",
        "duration": 55,
        "urlid": "nachzuegler-und-kurzentschlossene-lightning-talks-fuer-kurzentschlossene",
        "timebegin": "15:00",
        "name": "Nachzügler und Kurzentschlossene",
        "inhalt": "Lightning Talks, die es nicht zur Deadline geschafft haben oder gar erst am TüBIX selbst eingereicht werden (falls dann noch Platz ist). 11 Slots zu je 5 Minuten sind derzeit noch frei. Einreichungen sind jetzt noch über das CfP-Formular möglich: https://nixcloud.io/cfp/ oder ggf. am Tag selbst am Info-Stand. Wer zuerst kommt, malt zuerst.",
        "room": "V3"
    },
    {
        "titel": "Blender Inside Out",
        "weblinks": "Meine Webseite: www.dingto.org Blender: www.blender.org",
        "vorwissen": "",
        "timeend": "18:00",
        "buzzword": "Grafik, Gestaltung, 3D, Blender, CGI",
        "duration": 55,
        "urlid": "thomas-dinges-blender-inside-out",
        "timebegin": "17:00",
        "name": "Thomas Dinges",
        "inhalt": "In diesem Vortrag bekommt ihr eine Einführung in das Open Source 3D Programm Blender. Anhand von animierten Kurzfilmen und interessanten Beispielen erfahrt ihr alles über Blenders Möglichkeiten und Einsatzgebiete. ",
        "room": "V1"
    },
    {
        "titel": "Elementar (Unix-)Tools für Windows-CLI",
        "weblinks": "https://mridgers.github.io/clink/ https://conemu.github.io/ https://msys2.github.io/",
        "vorwissen": "",
        "timeend": "12:40",
        "buzzword": "Clink, Conemu, MSYS2",
        "duration": 5,
        "urlid": "sebastian-niedworok-elementar-unix-tools-fuer-windows-cli",
        "timebegin": "12:35",
        "name": "Sebastian Niedworok",
        "inhalt": "Kurze Vorstellung einiger Tools, mit denen man schnell eine einigermaßen brauchbare Kommandozeilenumgebung in Windows hinbekommt.",
        "room": "V3"
    },
    {
        "titel": "Das Geheimnis der Zahl 5",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "19:00",
        "buzzword": "Mathematik, goldener Schnitt, Kunst",
        "duration": 55,
        "urlid": "ingo-blechschmidt-das-geheimnis-der-zahl-5:-die-ananas-aus-spongebob-schwammkopf-ist-eine-luege",
        "timebegin": "18:15",
        "name": "Ingo Blechschmidt",
        "inhalt": "Dieser Vortrag gibt eine leicht verständliche Einführung in das Geheimnis der Zahl 5, das SpongeBobs Ananas, Annäherungen an die Kreiszahl Pi aus der Antike, das Mandelbrot-Fraktal (\"Apfelmännchen\") und unendliche Kettenbrüche miteinander verbindet.  Der Vortrag richtet sich an alle, die sich an mathematischen Mustern erfreuen können, setzt aber keinerlei Fachwissen oder Erinnerungsvermögen an Schulmathematik voraus. Es wird schöne Bilder geben!",
        "room": "V1"
    },
    {
        "titel": "freifunk",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "14:00",
        "buzzword": "freifunk",
        "duration": 25,
        "urlid": "justin-humm-freifunk",
        "timebegin": "13:30",
        "name": "Justin Humm",
        "inhalt": "Kommt noch",
        "room": "V4"
    },
    {
        "titel": "Keine Lust auf lange Übersetzungszeiten bei LaTeX auf schwachen Rechnern?",
        "weblinks": "https://github.com/iblech/sshlatex",
        "vorwissen": "Zugänglich ist der Vortrag einem breiten Publikum, aber besonders wertschätzen kann man das vorgestellte Werkzeug wohl nur, wenn man LaTeX selbst verwendet und zudem auf einem langsamen Computer arbeitet.",
        "timeend": "15:10",
        "buzzword": "sshlatex, latex, ssh",
        "duration": 5,
        "urlid": "ingo-blechschmidt-keine-lust-auf-lange-uebersetzungszeiten-bei-latex-auf-schwachen-rechnern",
        "timebegin": "15:05",
        "name": "Ingo Blechschmidt",
        "inhalt": "Ich bin ein großer Fan des Textsatzsystems LaTeX, bei dem man seine Texte in einer wilden Mischung aus einer reinen Auszeichnungssprache und einer vollwertigen, Turing-vollständigen Sprache formatiert. LaTeX eignet sich insbesondere für längere Dokumente, für Dokumente mit vielen  mathematischen Formeln und für LiebhaberInnen eines typographischen Niveaus, das über das von LibreOffice und ähnlichen Produkten weit hinausgeht.  Auf meinem Laptop läuft LaTeX allerdings quälend langsam.  Aus der Frustration ist ein kleines Werkzeug entstanden, mit dem man LaTeX auf effiziente Art und Weise auf einem schnelleren Server ausführen kann. Der Lightning Talk stellt dieses Progrämmchen, sshlatex, vor und berichtet von seiner Entstehung.",
        "room": "V3"
    },
    {
        "titel": "Die Parabel der Polygone",
        "weblinks": "http://ncase.me/polygons-de/",
        "vorwissen": "",
        "timeend": "13:20",
        "buzzword": "Gesellschaft",
        "duration": 5,
        "urlid": "ingo-blechschmidt-die-parabel-der-polygone",
        "timebegin": "13:15",
        "name": "Ingo Blechschmidt",
        "inhalt": "Die Parabel der Polygone ist ein Projekt der Mathemusikerin Vi Hart und des Interaktivkünstlers Nicky Case. Es ist eine Geschichte darüber, wie zunächst harmlose Entscheidungen eine Welt dramatisch verändern können und wieso man in seiner Umgebung Vielfalt verlangen sollte.",
        "room": "V3"
    },
    {
        "titel": "Mein erstes selbstgebautes RPM-Paket!",
        "weblinks": "https://de.wikipedia.org/wiki/RPM_Package_Manager",
        "vorwissen": "Linux-Grundwissen, Kenntnisse über die Nutzung von \"./configure\", \"make\" und \"make install\" sind hilfreich",
        "timeend": "12:00",
        "buzzword": "RPM, Packaging, Entwicklung, Fedora, CentOS, openSUSE",
        "duration": 55,
        "urlid": "robert-scheck-mein-erstes-selbstgebautes-rpm-paket",
        "timebegin": "11:00",
        "name": "Robert Scheck",
        "inhalt": "Dieser vorwiegend technische Vortrag zeigt Einsteigern und Fortgeschrittenen, wie sie eigene Programme als RPM-Pakete bereitstellen können. Es werden typische Fehler und Probleme besprochen und geeignete Build-Umgebungen vorgestellt. Der Paketbau wird auf einem Fedora-System gezeigt, funktioniert aber genauso für alle anderen RPM-basierten Distributionen.",
        "room": "V3"
    },
    {
        "titel": "SELinux: Bitte nicht deaktivieren…",
        "weblinks": "https://de.wikipedia.org/wiki/SELinux https://fedoraproject.org/wiki/SELinux_FAQ",
        "vorwissen": "Der Vortrag richtet sich an technisch orientierte Besucher, somit sollte das normale Linux-Rechtekonzept kein Fremdwort sein; Interesse an Systemsicherheit bzw. Systemhärtung ist natürlich von Vorteil.",
        "timeend": "16:00",
        "buzzword": "SELinux, Sicherheit, Systemhärtung",
        "duration": 55,
        "urlid": "robert-scheck-selinux-bitte-nicht-deaktivieren",
        "timebegin": "15:00",
        "name": "Robert Scheck",
        "inhalt": "Die vermutlich häufigste Reaktion von Benutzern und Administratoren zu SELinux ist: „Habe ich sofort deaktiviert!“. Dieser Vortrag erklärt, warum SELinux, die Sicherheitserweiterung „Security Enhanced Linux“ im Linux-Kernel, existiert, wie es funktioniert und aufgebaut ist. Selbstverständlich werden auch die täglichen Probleme und Lösungswege erläutert, die Konfiguration und Analyse bzw. Fehlersuche durchgesprochen. Ziel ist es, den verbreiteten Schrecken zu nehmen und ein Verständnis zu schaffen, warum man SELinux nicht sofort nach der Installation deaktivieren, sondern tatsächlich benutzen sollte.",
        "room": "V1"
    },
    {
        "titel": "Mein eigener Jabber-Server mit Prosody",
        "weblinks": "https://de.wikipedia.org/wiki/XMPP https://prosody.im/",
        "vorwissen": "Installation von Software-Paketen und Verständnis zum grundsätzlichen Umgang mit Daemons unter Linux sollte gegeben sein, Kenntnisse zu DNS sind hilfreich.",
        "timeend": "18:00",
        "buzzword": "XMPP, Jabber, Prosody, Instant Messaging, Instant Messenger",
        "duration": 55,
        "urlid": "robert-scheck-mein-eigener-jabber-server-mit-prosody",
        "timebegin": "17:30",
        "name": "Robert Scheck",
        "inhalt": "Instant Messenger gibt es wie Sand am Meer: ICQ, Skype, WhatsApp, Threema, Telegram, Facebook-Chat, Yahoo! Messenger – und viele mehr. Aber warum nicht mal Jabber (XMPP) benutzen? Wo liegen die Vorteile von XMPP? Ja, man müsste sich auch wieder einen Anbieter suchen... oder man setzt seinen eigenen Jabber-Server auf. Und dieser Vortrag erklärt am Beispiel von Prosody wie das relativ einfach und schnell, aber vor allem sicher, unter Linux geht!",
        "room": "V4"
    },
    {
        "titel": "Matheschülerzirkel",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "12:55",
        "buzzword": "Mathe, SchülerInnen",
        "duration": 5,
        "urlid": "ingo-blechschmidt-matheschuelerzirkel",
        "timebegin": "12:50",
        "name": "Ingo Blechschmidt",
        "inhalt": "Die Schülerin Emma hat Spaß an Mathe und möchte ihr Interesse vertiefen. In ihrer Klasse steht sie damit fast alleine da. Wohin kann Emma gehen?",
        "room": "V3"
    },
    {
        "titel": "Einmal Stratosphäre und zurück",
        "weblinks": "https://www.youtube.com/watch?v=Ruv2ZmiM5H8",
        "vorwissen": "",
        "timeend": "12:15",
        "buzzword": "Stratosphärenballon, Helium, Wärmekissen",
        "duration": 5,
        "urlid": "ingo-blechschmidt-einmal-stratosphaere-und-zurueck",
        "timebegin": "12:10",
        "name": "Ingo Blechschmidt",
        "inhalt": "Es ist erstaunlich leicht, einen Heliumballon etwa 30.000 Meter bis in die Stratosphäre aufsteigen zu lassen und so eindrucksvolle Fotos zu schießen. Der Lightning Talk klärt die wichtigsten Punkte. Für anwesende Kinder oder deren Eltern gibt es ein kleines nerdiges Überraschungsgeschenk zum mit nach Hause nehmen.",
        "room": "V3"
    },
    {
        "titel": "Physik der Klänge: Experimente mit Linux-Bordmitteln",
        "weblinks": "",
        "vorwissen": "",
        "timeend": "17:00",
        "buzzword": "awk, aplay, arecord",
        "duration": 25,
        "urlid": "ingo-blechschmidt-physik-der-klaenge-experimente-mit-linux-bordmitteln",
        "timebegin": "16:30",
        "name": "Ingo Blechschmidt",
        "inhalt": "Wie kommt es, dass ein Saxophon viel voller klingt als etwa eine Panflöte oder eine einfache Stimmgabel? Und was genau versteht man überhaupt unter dem „Klang“ eines Instruments? Wie kann man Schallwellen sichtbar machen? Was haben Schall und Regenwürmer gemeinsam? Und wie kann eine echte Programmiererin die Versionsnummer ihres Linux-Kernels an seinem Klang erkennen?  Diese und weitere Fragen möchten wir in diesem Vortrag beleuchten. Im Mittelpunkt werden dabei Experimente stehen, die wir mit Linux-Bordmitteln durchführen können: Ausgehend von den einfachsten Tönen, den reinen Sinustönen, werden wir immer komplexere Wellenformen erzeugen und hören.  Außerdem werden wir Ultraschall studieren und mit Bordmitteln ein einfaches Modem programmieren: Ein Laptop wird Daten in Töne umwandeln und diese ausgeben, ein anderer wird diese Töne aufnehmen und wieder zu Daten zusammensetzen.  Der Vortrag setzt weder technisches noch physikalisches Vorwissen voraus.",
        "room": "V1"
    },
    {
        "titel": "mutt konfigurieren",
        "weblinks": "http://www.guckes.net/tuebix2016/workshop.mutt_config.txt",
        "vorwissen": "",
        "timeend": "12:00",
        "buzzword": "mutt",
        "duration": 120,
        "urlid": "sven-guckes-mutt-konfigurieren",
        "timebegin": "10:00",
        "name": "Sven Guckes",
        "inhalt": "Den mutt Mailer einstellen Wir werden die Konfigurationsdatei ~/.muttrc editieren, und eventuell in mehrere Dateien aufteilen, mit dem \"source\" Kommando verbinden.    # schnelle Änderungen    * autoedit + edit_headers    * reverse_alias + reverse_name    * index_format + to_chars    * header      (Auswahl, Reihenfolge, Farben)    * attachments (Auswahl, mailcap processing)    * Farben für header und den index; signatures    # längere Themen    * mailing lists: folder_hook, mailboxes, subscribe, save_hook    * Farben für den message body    * display_filter: Änderungen und Löschungen mit \"sed\"    * macros    * pgp commands    * imap    * fetchmail + procmail    ### Vorwissen    * mutt schonmal verwendet, besser: in Verwendung    * Editor      - sicherer Umgang damit        - Dateien öffnen	  - schnelles Suchen	    - Ändern der Inhalte und speichern	    * Umgang mit der shell	    * Umgang mit einem Terminal Multiplexer: \"screen\" oder \"tmux\"",
        "room": "W3"
    },
    {
        "titel": "Linux Essentials in der Schule",
        "weblinks": "https://www.lpi.org/certification/linux-essentials/",
        "vorwissen": "",
        "timeend": "13:30",
        "buzzword": "Zertifizierung, Education, Linux in der Schule",
        "duration": 5,
        "urlid": "anni-theil-schiebel-linux-essentials-in-der-schule",
        "timebegin": "13:25",
        "name": "Anni Theil-Schiebel",
        "inhalt": "Bericht über einen aktuell laufenden Versuch im Fach Informatik in der Kursstufe des Gymnasiums im Rahmen der Unterrichtseinheit 'Betriebssysteme'. Die Schülerinnen und Schüler werden im 'ange leiteten Selbststudium' durch den Kurs geführt und können auf freiwilliger Basis das Linux Essentials-Zertifikat ablegen.",
        "room": "V3"
    },
{
        "titel": "imag - CmdLine Personal Information Management Suite in Rust",
        "weblinks": "https://github.com/matthiasbeyer/imag",
        "vorwissen": "Menschen, die auf der Kommandozeile zuhause sind werden sich wohl fühlen.",
        "timeend": "13:35",
        "buzzword": "rust,commandline,cli,programming,opensource,gpl,community",
        "duration": 5,
        "urlid": "matthias-beyer-imag-cmdline-personal-information-management-suite-in-rust",
        "timebegin": "13:30",
        "name": "Matthias Beyer",
       "inhalt": "Ich stelle mein Projekt \"imag\" vor, eine Commandline Personal Information Management Suite, welche ich in Rust schreibe. Erst kurz warum, weshalb und wie, dann der Aufruf Code beizutragen, da ich Mitstreiter suche.",
        "room": "V3"
    }
]
